[{
    "common_name": "Tanglin",
    "scientific_name": "Adenanthera intermedia",
    "vernacular_names": ["Coralwood", "Coral Bean", "Saga Bean"],
    "conservation_status": "Vulnerable",
    "ancestry": {
        "kingdom": "Plantae",
        "clade": "Tracheophytes-Angiosperms-Eudicots-Rosids",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Adenanthera",
        "species": "Adenanthera intermedia"
    },

    "description": "Adenanthera intermedia or commonly known as Tanglin is a tree that can be only found in the Philippines. The tree belongs to the third largest family of flowering plants called the Fabaceae family. The Adenanthera intermedia is medium-sized and has bipinnate leaves that divide into oblong-shaped leaves. Its bark is usually gray to brown with a rough texture when the tree gets older. The flowers are small and pale yellow to creamy white, they also have an attractive smell. Lastly, the tree commonly grows in rainforests.",
    "notable_features": "Adenanthera intermedia is medium-sized, reaching about 19 meters tall, it has a sturdy trunk and an upright form that makes it stand out in the landscape. Its overall appearance is ornamental, often used for shade and decorative planting, while its strong and durable wood is valued for construction and furniture. The bark of Adenanthera intermedia is generally gray to brown in color, with a rough and slightly fissured texture as the tree matures. It provides a sturdy protective layer for the tree and adds to its rugged appearance, making the trunk visually distinct against its delicate foliage.\n\nThe roots of Adenanthera intermedia are strong and well-developed, anchoring the tree firmly in the soil and supporting its structure. Its roots form associations with nitrogen-fixing bacteria, similar to many members of the Fabaceae family, this enriches the soil and contributes to the fertility of its surrounding environment. The flowers of Adenanthera intermedia are small and pale yellow to creamy white, it produces its flowers along thin, dropping stalks, drooping racemes that resemble rat tails. Though individually tiny, the flowers appear in clusters that give the tree a graceful look when in bloom, attracting insects and adding beauty to its form.\n\nThe fruits of Adenanthera intermedia are flattened pods that hang down on clusters and twist as they mature. When they split open, they reveal hard, glossy red seeds marked with a distinctive black spot, making them one of the tree’s most recognizable features. The tree is a bipinnately compound tree, and it is divided into smaller leaves called leaflets.  The bright green colored leaves of the Adenanthera intermedia are divided into oblong leaflets. The size of the leaflets usually ranges from 2 to 4 cm. When the leaflets become old, the color of the tree turns brown, and they fall off.  In one branch, the leaflets grow alternately, which pattern looks like a zigzag. The tree is known as a deciduous tree; it sheds its leaves once a year. The leaves usually grow from summer, and when they shed, they reproduce new green colored leaves.",
    "uses": "In the Philippines, which is known as a tropical country, it is usually hot, and this tree is common in the country. It can be used as shade by its leaves and trunk. Its red shiny seeds can be used as a design or an ornament. Its wood can be useful for different types of furniture. Moreover, the tree can be used as a charcoal.  Adenanthera intermedia is only in the Philippines. They can be found in the different islands in this country.",
    "references": ["PROSEA - Plant resources of South East Asia. (n.d.). https://prosea.prota4u.org/view.aspx?id=4781#:~:text=Vernacular%20Names,%5D%20qu%5Baj%5Dch.", "Saga hutan, Adenanthera pavonina Linn., CIRCASSIAN BEAN, Xiang si dou: Philippine Herbal Therapy  /  Alternative Medicine. (n.d.). https://www.stuartxchange.com/SagaHutan.html#:~:text=Pods%20are%20linear%2C%2015%20to,0.5%20cm)%20and%20strongly%20fragrant.", "Adenanthera pavonina - an underutilized tree of the humid tropics - Winrock International. (n.d.-b). Winrock International. https://winrock.org/factnet/fact-net-fact-sheets/adenanthera-pavonina-an-underutilized-tree-of-the-humid-tropics/?", "Saga hutan, Adenanthera pavonina Linn., CIRCASSIAN BEAN, Xiang si dou: Philippine Herbal Therapy  /  Alternative Medicine. (n.d.). https://www.stuartxchange.com/SagaHutan.html#:~:text=Pods%20are%20linear%2C%2015%20to,0.5%20cm)%20and%20strongly%20fragrant."],

    "coordinates": "",
    "tree_code": "tanglin",
    "image": "/images/tree/tanglin.jpg"
}, 

    {
    "common_name": "Binunga Tree",
    "scientific_name": "Macaranga tanarius",
    "vernacular_names": ["Himindang (Bicol)", "Kuyonon (Bisaya)"],
    "conservation_status": "Least Concern",
    "ancestry": {
    "kingdom": "Plantae",
    "clade": "Rosids",
    "order": "Euphorbiales",
    "family": "Euphorbiaceae",
    "genus": "Macaranga",
    "species": "M. tanarius"
    },
    "description": "The Binunga Tree, scientifically known as Macaranga tanarius, is a species of the Euphorbiaceae family. The tree is known by various names including Himindang (Bicol), and Kuyonon (Bisaya). It is native to the Philippines, Andaman Islands, Thailand, Myanmar, New South Wales, and etc. The Binunga is a small, dioecious tree, which can grow up to a height of 4 to 8 meters tall. Its leaves are large and round with an alternate leaf pattern.",
    "notable_features": "Its bark is rather smooth, strips off easily, and is gray-brown in color. The inner bark of the tree is yellowish-white and excretes a colorless liquid. Its fruit is small, and capsule-like, which can grow 10 to 12 millimeters in diameter. These fruits grow in dense, spherical clusters and are covered in soft prickles. The trees’ crown is thick, dome-shaped and with many slender branches. The flowers of this tree are small and can be yellow or orange in color. The Binunga has been recommended as a pioneer species to provide shade and shelter in order to promote natural regeneration on deforested land.",
    "uses": "The Binunga Tree has various uses in different aspects. It is used in traditional medicine such as a root-bark extract from the tree used to treat diarrhea, dysentery, and fever. Its bark and leaves are also utilized in our country to prepare a fermented drink “basi”, an Ilocano beverage which is made from sugarcane. The bark of the tree also contains tannin, used to toughen fishing nets. The wood of the tree is also a favorite material for making wooden shoes.",
    "references": [],
    "coordinates": "",
    "tree_code": "",
    "image": ""
},
{
    "common_name": "Mango",
    "scientific_name": "Mangifera indica",
    "vernacular_names": ["Mangga (Filipino)", "Paho (Bisaya)", "Mango (Ilokano)", "Mango"],
    "conservation_status": "Least Concern",
    "ancestry": {
        "kingdom": "Plantae",
        "clade": "Tracheophytes, Angiosperms, Eudicots, Rosids",
        "order": "Sapindales",
        "family": "Anacardiaceae",
        "genus": "Mangifera",
        "species": "M. indica"
    },
    "description": "Mangifera indica L., known commonly as Mango, an evergreen tree species of the Anacardiaceae family. Originating in Southeast Asia and India, and considered native in Southern Asia, it usually reaches a height of 15-18 meters tall, but it has a possibility to grow taller. Parts of the tree that are harvested are the fruit for its flesh and seeds, the wood for the purpose of furniture and musical instruments, the leaves for medicinal purposes, and the bark for dye. The tree has a rounded and symmetrical canopy with a thick and smooth trunk and deep, wide-spreading roots springing from its trunk. The leaves are long and pointed at both ends, along with small yellowish or white flowers. Lastly, the fruit has a variety of shapes, ranging from round, kidney-shaped, or long and slender.",
    "notable_features": "The Mangifera indica L. tree has greyish-brown colored trunks, being thick in diameter, while its bark is smooth in texture, peeling off in irregular and thick pieces. The roots are formed at the base of the trunk and have a deep depth. Its leaves are dark green, simple, and in shapes like oblong, oval-lanceolate, or etc. The length can range from 12-45 centimeters and are borne in clusters. Flowers are small and fragrant, with colors of yellowish and white, grouped into clusters. Its fruit has variation with the size, having forms such as oval, round, heart-shaped, kidney-shaped, or long and slender. They have greenish yellow color for the outer skin, while their insides have a bright orange-yellow sweet and juicy flesh along with a large pit in the middle.",
    "uses": "Mangoes are primarily enjoyed for their juicy fruit, which is used fresh in juices, smoothies, cooking, and desserts. The wood of the mango tree is used for making furniture and carvings, while the leaves have medicinal uses for treating conditions like diabetes and digestive issues. Mango seed oil is valued in skincare for its moisturizing properties, and mango butter, extracted from the seed, is a common ingredient in lotions.",
    "references": [],
    "coordinates": "",
    "tree_code": "mango",
    "image": "/images/tree/mangga.jpg"
},
{
    "common_name": "Chico / Sapodilla",
    "scientific_name": "Manilkara zapota",
    "vernacular_names": ["Chico", "Sapodilla", "Soapapple", "Chicozapote"],
    "conservation_status": "Not threatened",
    "ancestry": {
        "kingdom": "Plantae",
        "clade": "Tracheophytes, Angiosperms, Eudicots, Asterids",
        "order": "Ericales",
        "family": "Sapotaceae",
        "genus": "Manilkara",
        "species": "M. zapota"
    },
    "description": "Manilkara zapota, more commonly known as Chico or Sapodilla, is an evergreen tree which is native to Southern Mexico, Central America, and the Caribbean. This tree can also be found in tropical and subtropical regions all around the world, especially in Asia. The Manilkara zapota was first introduced in the Philippines during the Spanish colonization period through various resource exchanges like the Galleon trade. Its epithet zapota was derived from the Spanish word “zapote” which alludes to the tree’s soft fruit.",
    "notable_features": "The Manilkara zapota is a medium-sized tree, having a sturdy and reddish trunk which is able to grow up to more than 30 meters tall with a diameter of 1.5 meters. The bark of the tree contains a white latex also known as chicle, this was used as an important component of gum. The leaves are elliptic and ovate in shape, and are arranged alternately. It also has a light green color with a glossy appearance. The leaves of this tree have a length of about 5 - 12.5 cm. The tree also bears small, unnoticeable bell-shaped flowers with a light cream color. The fruit it bears has a spheroid shape and is rusty brown in color. It has a diameter roughly around 5 - 10 cm. Inside it contains a translucent, yellowish, and juicy flesh. The fruit is usually eaten fresh and its taste is often described to have a sweet flavor, usually alluded to as a pear combined with brown sugar. The fruit also contains 2 - 5 seeds that are glossy, black, and have a size identical to beans.",
    "uses": "The Manilkara zapota was mainly used as building materials for various structures like posts, rafts, and it was also utilized in the creation of Maya Temples back in the day. Its chicle is a milky latex which was a prominent ingredient for gum. The chicle itself was also used as chewing gum by the Aztecs. It was believed that by chewing chicle, it was able to quench one’s thirst and was an accompaniment to meals. In various research studies, its fruit poses many health-benefits as it contains bioactive compounds with antioxidants, anti-inflammatory, and other properties that are able to fight off diseases. The Manilkara zapota can also be used in various chemicals such as pesticides.",
    "references": [],
    "coordinates": "",
    "tree_code": "chico",
    "image": ""
},
{
    "common_name": "Rambutan",
    "scientific_name": "Nephelium lappaceum",
    "vernacular_names": ["Rambutan", "Hairy Lychee", "Ramboostan"],
    "conservation_status": "Least Concern",
    "ancestry": {
        "kingdom": "Plantae",
        "clade": "Tracheophytes, Angiosperms, Eudicots, Rosids",
        "order": "Sapindales",
        "family": "Sapindaceae",
        "genus": "Nephelium",
        "species": "N. lappaceum"
    },
    "description": "Nephelium lappaceum L., more widely known as Rambutan or Hairy Lychee, is a tropical tree native to the Malay-Indonesian region, and other Southeast Asian countries. They usually grow in warm or tropical regions. Its name originated from the Malay word 'rambut' which means 'hairy' that alludes to its fruit’s appearance. It is closely related to other edible fruits such as lychee and longan. This evergreen tree has a fairly straight and erect trunk which can grow up to 15–24 m tall. Its leaves are compound, having around 5 - 11 elliptic leaflets which have a length of about 5 - 15 cm. The leaf itself ranges from about 14 - 30 cm long.",
    "notable_features": "Its fruit is a round oval shape with a thick reddish skin covered in spines ('hairs'). The fruit inside is a translucent whitish or pale pink aril or a seed covering. Its taste is described to be sweet with hints of an acidic flavor that is similar to grapes. This fruit may be consumed fresh, blended into juices and smoothies, and used in desserts like jam and ice creams.",
    "uses": "Rambutan’s sweet flesh can be eaten fresh or made into jams, juices, and desserts. The fruit is rich in vitamin C, which helps the body absorb iron from foods and boost the immune system. The seeds can be used to make oil for soap and beauty products, while the peel is sometimes used in traditional medicine. Its peel is used to fight infections. Even the tree is valuable because its wood can be used for furniture or firewood.",
    "references": [],
    "coordinates": "",
    "tree_code": "rambutan",
    "image": ""
},
{
    "common_name": "Avocado",
    "scientific_name": "Persea americana",
    "vernacular_names": ["Avocado", "Alligator Pear", "Butter Fruit", "Avokado"],
    "conservation_status": "Least Concern",
    "ancestry": {
        "kingdom": "Plantae",
        "clade": "Tracheophytes, Angiosperms, Magnoliids",
        "order": "Laurales",
        "family": "Lauraceae",
        "genus": "Persea",
        "species": "Persea americana"
    },
    "description": "Persea americana, commonly known as the Avocado tree, is an evergreen tree in the laurel family (Lauraceae). This tree is widely cultivated because of the fruit’s rich flavor and nutrition. The Avocado tree is a tall or spreading tree that typically reaches the heights of 9 - 20 meters tall. It’s leaves are elliptical or egg-shaped with an average length that ranges from 10–30 cm (4–12 inches). It may even emerge with a reddish hue when young, then mature to a deep green color. The Avocado tree’s flowers are small and have a greenish color. They are borne in dense inflorescences in the leaf axils. The flowers have nine stamens that are arranged in three series (and a one-celled ovary). The fruit produced is a large berry (commonly known as the avocado), it may be pear-shaped or oval, with a smooth and thick layer of skin, with a color of green to purplish-black. It has a buttery edible pulp, with one large seed in the middle.",
    "notable_features": "One of the most notable characteristics of the avocado tree is the buttery, oil-filled pulp of its fruit. Another unique trait of this species is that it has a special flowering mechanism called synchronous dichogamy (flower types A and B) that facilitates cross-pollination and improved fruiting. The tree's broad shiny leaves and heavy canopy also provide it with ornamental use in favorable climates. Cultivated varieties are often grafted to secure good fruit quality and a head start on production in commercial use.",
    "uses": "The avocado tree is cultivated mainly for its fruit, as it is rich in healthy fats, vitamins and minerals, and consumed extensively in salads, dips (in particular, guacamole), spreads, and smoothies. The pulp is also commercially used to make avocado oil for cooking, cosmetics, and skincare. In terms of landscaping, avocado trees can serve as shades and decorative garden specimens in hot climates. Some traditional uses also include seed, skin or leaves in folk remedies or craft materials, although care should be taken because the parts of the tree can be poisonous to some animals.",
    "references": [],
    "coordinates": "",
    "tree_code": "avocado",
    "image": ""
},
{
    "common_name": "False Ashoka / Indian Mast Tree",
    "scientific_name": "Monoon longifolium (Polyalthia longifolia)",
    "vernacular_names": ["False Ashoka", "Indian Mast Tree"],
    "conservation_status": "Least Concern",
    "ancestry": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Magnoliales",
        "family": "Annonaceae",
        "genus": "Monoon",
        "species": "Monoon longifolium"
    },
    "description": "Polyalthia longifolia, belonging to the family Annonaceae and commonly known as False Ashoka or Indian Mast Tree, is a large evergreen tree native to India and Sri Lanka. It typically grows to a height of 12–25 meters, featuring a straight, slender trunk and pendulous, glossy, lance-shaped leaves that remain green throughout the year. The tree’s graceful, columnar form and dense foliage make it a popular ornamental species in tropical regions.",
    "notable_features": "The Polyalthia longifolia is known for its height and its resemblance to the true Ashoka tree (Saraca asoca), from which it got its name “False Ashoka.” It can grow up to 12–25 meters tall, with a woody, slender, and column-like stem that gives it a symmetrical and upright appearance. The bark is gray and smooth when young, becoming slightly rough and flaky as the tree matures. The leaves are simple, leathery, and evergreen, lanceolate to oblong-lanceolate in shape, and are arranged alternately along the branches. They are glossy, pendulous, and wavy-edged, giving the tree a graceful, cascading look. The flowers are star-shaped, with six thin, linear petals that range in color from pale green to greenish yellow. These are followed by clusters of small, oval fruits that mature from green to dark purple or black. The roots are deep and strong, supporting the tree’s tall and narrow growth form.",
    "uses": "The Polyalthia longifolia is commonly used as an ornamental decoration during festivals because of its elegant and evergreen appearance. In India, it is also used in traditional medicine for the treatment of fever, skin diseases, hypertension, and helminthiasis. The bark of the tree is known for its medicinal value and is used in various herbal remedies. The wood is durable and has been used in the construction of ship masts, which is why it is called the “Indian Mast Tree.” The Polyalthia longifolia is also valued for its air-purifying properties, as it helps filter dust and pollutants in the environment. In addition, its dense foliage contributes to alleviating noise pollution, making it beneficial in maintaining a cleaner and quieter atmosphere.",
    "references": [],
    "coordinates": "",
    "tree_code": "false_ashoka",
    "image": ""
},
{
    "common_name": "Malapapaya",
    "scientific_name": "Polyscias nodosa",
    "vernacular_names": ["Malapapaya (Visayas, Pangasinan, Tagalog)", "Bias-bias (Tagalog)", "Bungliu (Tagalog, Bikolano)", "Bongliw (Camarines Sur, Bikolano)"],
    "conservation_status": "Least Concerned",
    "ancestry": {
        "kingdom": "Plantae",
        "clade": "Tracheophytes, Angiosperms, Eudicots, Rosids",
        "order": "Apiales",
        "family": "Araliaceae",
        "genus": "Polyscias",
        "species": "P. nodosa"
    },
    "description": "Polyscias nodosa is commonly known as the Malapapaya tree. It is native to Tropical Asia and the Southwestern Pacific, specifically found in the Philippines, Indonesia, Papua New Guinea, and the Solomon Islands. It is an indigenous species that occurs throughout the Philippines and is also native to the Caroline Islands (Palau) and Queensland.",
    "notable_features": "This tree reaches about 25 meters with a diameter of 50 cm. Its leaves are described as ovate-oblong shaped simple leaves, lanceolate from a rounded base, with rounded scallop to saw-tooted edges. It has a smooth surface and visible vertical lines around the bark. Its outer color of the bark is creamish-white with brown color and as for inner bark, it has white color with distinct yellow rays where it is also very brittle. The roots of the malapapaya tree have a taproot system with a prominent central taproot from which smaller feeder roots branch out. The flowers of the tree are small, fragrant, yellow-green, and borne in panicles. These flowers are small, typically measuring about 1.5 cm long in their inflorescence, and are a component of the plant that gives it its fragrant scent. The fruits are small, with small seeds, and are picked from the trees for propagation purposes, with a shape of subglobose (nearly spherical), ridged, and a yellowish-red color when it dries.",
    "uses": "It is primarily used for its wood in the Philippines to produce various small wooden articles like toothpicks, chopsticks, matchsticks, and pencil slats, as well as for fancy woodwork, plywood, and native wooden shoes. The tree's leaves also have medicinal uses, including being employed as a contraceptive and for treating fever. The wood is ideal for small objects such as toothpicks, matchsticks, chopsticks, lollipop/popsicle sticks, and ice cream spoons. Larger logs from the Malapapaya tree are suitable for making plywood and veneer. It is also used for making boxes, crates, native wooden shoes, and for general carpentry and fancy woodwork. This tree has also played an important role in giving medicinal uses. In some parts of Mindanao, the leaves are used medicinally to treat fever and as a contraceptive. Pounded leaves mixed with ash are applied locally as a fish poison. Lastly, this tree also has ecological uses and also for decorations. The tree is sometimes planted as an ornamental tree in gardens, it is also used as a ground cover.",
    "references": [],
    "coordinates": "",
    "tree_code": "",
    "image": ""
}, 
{
    "common_name": "Guava",
    "scientific_name": "Psidium guajava L.",
    "vernacular_names": ["Guava", "Yellow guava", "Lemon guava"],
    "conservation_status": "Least Concern",
    "ancestry": {
        "kingdom": "Plantae",
        "phylum": "Caryophyllophyta",
        "class": "Magnoliophyta",
        "order": "Myrtales",
        "family": "Myrtaceae",
        "genus": "Psidium",
        "species": "Psidium guajava"
    },
    "description": "Psidium guajava L., also referred to as guava, is a small tropical tree found in the Myrtaceae family. It is also referred to by some of the following names: apple guava, Brazilian guava, common guava, Guinea guava, lemon guava, pear guava, tropical guava, and yellow guava. The guava is thought to have native origins in tropical America, from Mexico to Peru, and is now cultivated in numerous tropical and subtropical areas of the globe. The guava tree is sturdy and resilient, tolerating various types of soil and climatic conditions. The fruits are round or oval and have green to yellow skin and white or pink pulp with numerous small seeds. Guava is highly valued not just because of its sweet, refreshing flavor but also for its health value, as it is highly supplemented with vitamin C, fiber, and antioxidants that make it a valuable fruit both in food and in traditional medicine.",
    "notable_features": "The Guava tree has a unique trunk with a smooth and flaking bark and a thick covering of green leaves. The tree's leaves are arranged in pairs but oppositely and give off a very nice scent when crushed. The fruits of the plant may be round or oval and are yellow when fully ripe, having a flesh that can be white, pink, or red and is full of small hard seeds. Guava trees are tolerant of unfavorable conditions and can adapt to almost any soil type. Their root systems are deep and extensive, which enables them to live through periods of drought.",
    "uses": "Guava is a fruit that has multiple applications and is widely recognized for its medicinal and therapeutic properties. The fruit is an excellent source of vitamin C and may be consumed in different ways like fresh, or made into jams, juices, and sweets. Herbal medicine employs guava leaves and bark for the treatment of diarrhea, skin diseases, wounds, and inflammation among others. Besides that, the bark is also tanned and dyed, while the wood is used for making furniture, handles for tools, and burning. Besides all these, guava trees are also used for air cleaning, and as decorative or shadow trees in home gardens.",
    "references": [],
    "coordinates": "",
    "tree_code": "",
    "image": ""
}, {
    "common_name": "Narra",
    "scientific_name": "Pterocarpus indicus",
    "vernacular_names": ["Narra (Tagalog)", "Narra / Philippine Rosewood (English)", "Asana / Narra (Visayan)"],
    "conservation_status": "Vulnerable",
    "ancestry": {
        "kingdom": "Plantae",
        "clade": "Tracheophytes, Angiosperms, Eudicots, Rosids",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Pterocarpus",
        "species": "Pterocarpus indicus"
    },
    "description": "Pterocarpus indicus, commonly called Narra, is the national tree of the Philippines. It is native to Southeast Asia and usually grows in lowland forests. Narra trees are known for their strength and durability, making them a popular source of hardwood. The tree can grow up to 30–40 m tall with a wide canopy that provides shade. Its leaves are compound, with small oval leaflets arranged alternately along the stem.",
    "notable_features": "One of the most striking features of the Narra tree is its bright yellow flowers, which bloom in clusters during the dry season, usually from February to May. These flowers are small but fragrant, attracting bees and other pollinators. After flowering, the Narra tree produces fruit in the form of flat, round, and winged seed pods that are light brown when mature. Each pod contains a single seed that can be dispersed by wind and water. The wood of the Narra tree is highly valued and has been widely used for centuries. It is known for being extremely durable, termite-resistant, and naturally fragrant. Because of its beauty and reddish hue, Narra wood has been used in furniture making, flooring, cabinetry, and even in the crafting of religious statues and heritage pieces. It is considered one of the finest types of hardwood in the Philippines. Unfortunately, this popularity has also led to overharvesting and illegal logging, which greatly contributed to its decline in natural populations, leading to its current conservation status of “Vulnerable.” Beyond its practical uses, Narra also has cultural and symbolic importance. As the national tree, it represents the Filipino people’s strength, endurance, and adaptability in the face of challenges. Its wide canopy providing shelter is seen as a metaphor for protection and unity. In addition, parts of the tree have been traditionally used in folk medicine. The bark and leaves are sometimes prepared as herbal remedies for skin conditions and other ailments, although these uses are not yet fully validated by science. Today, conservation efforts are being undertaken to protect and restore Narra populations. Government agencies like the Department of Environment and Natural Resources (DENR), along with environmental groups, are encouraging the planting of Narra seedlings in reforestation programs. Its inclusion in public spaces also ensures that future generations will continue to enjoy the beauty and benefits of this tree.",
    "uses": "The Narra tree (Pterocarpus indicus) is highly valued for its strong and termite-resistant wood, which is widely used in making furniture, flooring, and carvings. It is also planted as an ornamental and shade tree because of its wide canopy and fragrant yellow flowers. Traditionally, its bark and leaves have been used in folk medicine for various ailments. As the national tree of the Philippines, Narra symbolizes strength and resilience while also playing an ecological role in preventing soil erosion and supporting pollinators.",
    "references": [],
    "coordinates": "",
    "tree_code": "",
    "image": ""
}, {
    "common_name": "Taluto",
    "scientific_name": "Pterocymbium tinctorium",
    "vernacular_names": ["Taluto", "Malasapsap (Tagalog)", "Teluto (Bisaya)", "Taluto / Taluhto / Kaluto (Bikol)"],
    "conservation_status": "Least Concern",
    "ancestry": {
        "kingdom": "Plantae",
        "division": "Tracheophyta",
        "class": "Magnoliopsida",
        "order": "Malvales",
        "family": "Malvaceae",
        "subfamily": "Sterculioideae",
        "genus": "Pterocymbium",
        "species": "Pterocymbium tinctorium"
    },
    "description": "The Pterocymbium tinctorium, commonly known as Taluto, is a tall deciduous tree native to Southeast Asia, particularly found in the Philippines, Cambodia, and Malaysia. It belongs to the family Malvaceae. This tree is common in tropical forests and lowland areas, thriving in moist soil conditions. In the Philippines, it is often seen in secondary forests or planted for shade and timber. This research provides an overview of the Taluto tree, including its classification, physical description, notable features, uses, local names, and conservation status. The Taluto tree is a large deciduous species that can grow up to 30-42 meters tall, with a straight cylindrical trunk reaching up to 70-85 centimeters in diameter. It is fast-growing, especially under favorable tropical conditions, with some plantations observing a growth rate of about 2 cm in diameter per year. The bark is usually grayish and smooth, sometimes showing shallow ridges, while the inner bark is reddish. Its roots are adapted to moist tropical soil, often deep and sturdy, providing strong anchorage even without large buttresses. The leaves of the Taluto are simple, entire, and alternate, though very young leaves may show slight lobing. They are ovate to truncate in shape, with an acuminate apex, and measure around 7 – 14cm long and 4–6 cm wide. The upper surface of the leaf is smooth, while the lower surface may have fine hairs, especially on younger leaves. The flowers grow in branched clusters at the ends of branches, and they can appear even when the tree is leafless. The flowers are unisexual but occur on the same tree, making it monoecious. When fruiting, the Taluto produces winged fruits that are often seen hanging in clusters of about five. The wings are reddish or golden-green when fresh, turning brown or black when dry, and have a papery texture that helps the seeds disperse by wind.",
    "notable_features": "One of the most notable features of the Taluto is its tall, straight trunk and rapid growth, which make it valuable for timber production. The reddish inner bark is also distinctive, as it contains natural dye substances — the species name tinctorium even means “used for dyeing.” The tree’s winged fruits are also a recognizable feature, adding ornamental value when the tree is fruiting. Additionally, the Taluto tends to flower and fruit when leafless, giving it a unique seasonal appearance.",
    "uses": "The Taluto tree is highly useful in both commercial and environmental applications. Its lightweight wood is used for furniture, veneer, plywood, and matchsticks. It is also planted in reforestation programs because of its fast growth and ability to thrive in different soil types. The bark has been traditionally used for natural dyeing (hence the term tinctorium), and in some areas, fibers from the bark are used for making ropes or cords. Although not widely documented, some communities also use parts of the tree in folk medicine, possibly for treating skin conditions or minor wounds. Because of its wide canopy and height, the Taluto is also planted as an ornamental or shade tree in parks and open spaces.",
    "references": [],
    "coordinates": "",
    "tree_code": "",
    "image": ""
},
{
    "scientific_name": "Roystonea regia",
    "common_name": "Royal Palm",
    "vernacular_names": ["Royal Palm", "Cuban Royal Palm", "Florida Royal Palm"],
    "conservation_status": "Least Concern",
    "taxonomic_classification": {
        "kingdom": "Plantae",
        "clade": "Tracheophytes, Angiosperms, Monocots",
        "order": "Arecales",
        "family": "Arecaceae",
        "genus": "Roystonea",
        "species": "Roystonea regia"
    },
    "description": "Royal Palm or Roystonea regia is a tall, dignified tropical palm in the Arecaceae family. It is native to the Caribbean and extensively grown in tropical climates, such as in the Philippines. It’s trunk is smooth, grey-white or light-colored, cylindrical and has a typical height of 20–30 meters or more when well-nourished. The crown has large pinnate fronds that form a wide and elegant canopy. Leaves are very long, with numerous leaflet segments per frond. Blooming is in large clusters under the crownshaft, and the fruit are small drupes carried in large inflorescences. In the Philippines, the Royal Palm Tree is often utilized as an avenue and ornamental tree because of its upright form and tropical look. The tree produces cream-white bisexual flowers in large branched inflorescences emerging below the crownshaft. The small, round fruits are green at first, maturing to a dark purplish-black drupe that is bird- and bat-attracting. Royal Palms need full sun, moist soils, and warm tropical conditions. They are also tolerant of salted conditions, making them well-suited to coastal and resort landscapes in the Philippines.",
    "notable_features": "One of the features most distinctive of the Royal Palm is how smooth and tall its trunk is. Its light-colored, smooth trunk commonly has a slight swell below the green crownshaft. The large fronds create a high canopy, making it a popular accent in parks and boulevards. It is tolerant towards the sun, salt air, and seaside conditions, therefore making itself ideal for tropical landscaping. Since it is not native but commonly cultivated, it does not have a well-documented indigenous vernacular name in Philippine flora literature; hence it is commonly called by its English common name or by its horticultural trade names.",
    "uses": "Royal Palm is mostly prized for its ornamental and landscape value. Its elegant, tall shape is suited to promenades, resort gardens, extensive parks, and urban streetscapes in tropical countries such as the Philippines. In other areas, different parts of the palm have lighter traditional uses: the fronds can be utilized for thatch or craft purposes, the trunk can provide light timber, and the fibers in the leaf-sheaths have been researched for the use in composite materials. The species also adds aesthetic, ecological, and cultural worth to landscapes and is used as a visual landmark and shade in tropical environments.",
    "coordinates": "",
    "tree_code": "royal_palm",
    "image": ""
},
{
    "scientific_name": "Sandoricum koetjape",
    "common_name": "Santol",
    "vernacular_names": ["Cotton fruit", "Kechapi", "Sentul", "Lolly fruit"],
    "conservation_status": "Non - extinct",
    "ancestry": {
        "kingdom": "Plantae",
        "clade": "Tracheophytes-Angiosperms-Eudicots-Rosids",
        "order": "Spindalis",
        "family": "Maliaceae",
        "genus": "Sandoricum",
        "species": "Sandoricum koetjape"
    },
    "description": "Santol comes from Southeast Asia and is identifiable by its round shape and thick skin which, depending on ripeness, can be yellow or reddish. Its pulp is soft, sweet, and juicy, becoming a favorite fruit for many and is also used in many culinary practices. Many people like to consume the fruit raw, or in presumes and jams, and in combination with curries, salads, and for many Southeast Asian recipes, the fruit has a unique and versatile flavor.",
    "notable_features": "Santol tree stands out due to its great size, longevity, and form. As a result, it becomes a notable and excellent tree for tropical environments. As a big, evergreen tree, it typically grows to 25 meters and under the best conditions, it grows to 50 meters. Among its many notable features is a straight, circular trunk that can reach a height of 18 meters without branches. With a height of 18 meters, it can tower over surrounding vegetation. The trunk is usually held by thick and buttress roots that can be 3 meters tall. Such roots may extend 3 meters, providing a dramatic visual presence. With the tree being symmetrical and stately, the oval and densely packed crown improves the overall score of the tree. The santol tree also acquires value due to the ways in which its hardwood can be used. Besides being durable, it can be used in furniture and boat construction, interior joinery and general carpentry. To enhance fine craftsmanship, the wood under cover also becomes moderately durable, is easy to work with, and takes a great polish.",
    "uses": "Santol fruit is commonly eaten fresh, made into jams, preserves, and candies, or used in savory dishes like curries and stews. The bark and leaves are used in traditional medicine to treat ailments such as diarrhea and fever. The wood, being moderately durable and easy to work with, is used in furniture, boat building, interior construction, and general carpentry. Additionally, parts of the plant are used in natural dyeing and as a source of tannins.",
    "fun_facts": "Santol trees are rumored to be home to a mythical spirit known as the pugot in the Ilocos region of the Philippines. Legend has it that the pugot is a headless, nocturnal spirit and is a type of engkanto, a spirit that resides in nature. It can live up to 50 to 70 yrs and also have a unique color changing foliage.",
    "coordinates": "",
    "tree_code": "santol",
    "image": "/images/tree/santol.jpg"
},
{
    "scientific_name": "Swinglea glutinosa",
    "common_name": "Tabog, Mala Cabuyao",
    "vernacular_names": ["Malakabuyau", "Tabog", "Tabok", "Talubok", "Uratan"],
    "conservation_status": "None",
    "ancestry": {
        "kingdom": "Plantae",
        "clade": "Angiosperms, Eudicots, Rosids",
        "order": "Sapindales",
        "family": "Rutaceae",
        "genus": "Swinglea",
        "species": "S. glutinosa"
    },
    "description": "Sterculia glutinosa, commonly known as Tabog or mala cabuyao in the Philippines. It belongs to the family Rutaceae and is endemic to that country. It is a small to medium-sized tree native to the Philippines. The Latin name “glutinosa” comes from the word “gluten,” which means “glue” or “sticky, referring to the gummy or resinous sap that the plant produces. Historically, the tree has been noted in horticultural and citrus-rootstock literature due to its potential for grafting and rootstock use in citrus cultivation. In addition to its horticultural relevance, its fruit and other parts of the tree have been used in folk medicine and local uses. Despite being native to the Philippines, the Tabog tree is also grown in other tropical countries as an ornamental hedge plant, it is also used as a natural barrier in rural areas and gardens because of its physical features.",
    "notable_features": "Sterculia glutinosa, commonly known as tabog or mala cabuyao in the Philippines, is a small to medium-sized tree that can grow up to about 10 meters tall, and sometimes even taller when it gets older. It appears dense and compact, making it an ideal plant for hedges and natural fences. Its trunk has single spines, and the young branches are a bit hairy, though they become smooth as the tree matures. The leaves of the tabog have three parts, these are the leaflets, the one in the middle is the biggest, while the two on the sides are smaller. The side leaflets are oval-shaped, and the middle one is long and narrow, usually with a rounded or blunt tip. Tabog’s flowers are white, about 1.5 centimeters long, have a pleasant smell, and have petals that are longer than the small parts called calyx lobes at the base of the flower. Its fruit is green or yellow, oval-shaped with a tough, leathery skin that feels bumpy and uneven. Inside the fruit are many seeds covered in soft, wool-like pulp. The walls inside the fruit have special glands that produce a sticky substance called mucilage. Because of its thick skin and special fruit structure, scientists have compared tabog to citrus fruits and their wild relatives. The leaves are glossy and leathery, dark green on the upper surface, and lighter green underneath, arranged alternately along the stems.",
    "uses": "The juice from the Tabog tree is used as medicine to treat skin problems. The leaves and bark are also used to help cure coughs and to remove ticks from dogs. The fruit smells nice and has a sour taste that is similar to a lemon. Farmers sometimes use the Tabog tree as a base or “rootstock” to grow other citrus trees on. Its wood is also strong enough to be used for making parts of houses, like pillars.",
    "fun_facts": "The Tabog tree can thrive in different soil types and withstand dry conditions. Its sticky mucilage from the fruit has been used as a natural glue or thickener in some traditional practices. Despite its relation to citrus plants, the Tabog’s fruit isn’t commonly eaten, it’s more known for its scent and usefulness.",
    "coordinates": "",
    "tree_code": "tabog",
    "image": ""
},
{
    "scientific_name": "Swietenia macrophylla",
    "common_name": "Mahogany",
    "vernacular_names": ["Mahogany", "Big-leaf Mahogany"],
    "conservation_status": "Vulnerable",
    "taxonomic_classification": {
        "kingdom": "Plantae",
        "division": "Magnoliophyta",
        "class": "Magnoliopsida",
        "order": "Sapindales",
        "family": "Meliaceae",
        "genus": "Swietenia",
        "species": "S. macrophylia"
    },
    "description": "Mahogany or Swietenia macrophylla is a tall, deciduous tree which means it sheds its leaves annually and is known for its big trunk and reddish-brown hardwood. They can reach up to 150 to 200 feet and 6 feet in diameter. The tree has dark green, glossy, compound leaves and small, fragrant white flowers that develop into woody capsules containing winged seeds. They develop large pinnate leaves that consist of 3 to 6 pairs of leaflets. They are oval-shaped with pointed tips. The terminal leaflet is always absent. Leaves can reach up to 20 inches in length. Mahogany is also known as big-leaf mahogany due to oversized leaves. They usually bloom from April to June. The fruit of the mahogany tree is a large, pear-shaped capsule that is gray or brown in color and contains up to 71 seeds. These fruits usually ripen from January to March. When mature, the capsule splits into five parts to release the seeds. However, mahogany seeds do not remain viable for long, they can only germinate during the first rainy season after being released. The fruit of the big-leaf mahogany is sometimes called “sky fruit” because the capsules grow pointing toward the sky. Today, commercially available mahogany is mostly cultivated on plantations in Asia, especially in India, Indonesia, Bangladesh, and Fiji. Wild species of mahogany are now protected by law and cannot be harvested. Mahogany is a slow-growing tree that can live for up to 350 years in the wild.",
    "notable_features": "Mahogany produces one of the most valuable hardwoods in the world, known as the “true mahogany of commerce.” Its durable and beautifully grained wood is used for furniture, boats, musical instruments, and electric guitars such as Gibson Les Paul models. The bark and seeds have traditional medicinal uses, including treatment for fever, wounds, and malaria. However, the seeds are considered harmful if consumed. Because of its fast growth and dense canopy, mahogany is also commonly planted as a shade tree in tropical areas.",
    "uses": "There are still no reports confirming the edibility of this plant, and its seeds are considered harmful if consumed. Despite this, it has many folkloric uses in traditional medicine. The bark is known to be antipyretic, tonic, and astringent, while seed decoctions have been used as abortifacients. It has also been used to treat hypertension, amoebiasis, chest pain, parasitism, cancer, malaria, cough, and miscarriage. In India, bark extracts serve as an astringent for wounds and are used for anemia, diarrhea, fever, and dysentery, while in Africa, bark decoctions act as a febrifuge. Beyond its medicinal uses, the plant is highly valued for its wood, known as the true mahogany of commerce. Its reddish-brown timber is prized for furniture, musical instruments, boats, and caskets. It is also used in making electric guitars like the Gibson Les Paul models. In Manila, it is commonly planted as a shade tree, and in Haiti, its wood is used for charcoal. Although not edible, the plant remains important for its medicinal, industrial, and practical uses.",
    "coordinates": "",
    "tree_code": "mahogany",
    "image": "/images/tree/mahogany.jpg"
},
{
    "scientific_name": "Syzygium polycephaloides",
    "common_name": "Lipote",
    "vernacular_names": ["Bahag", "Baligang", "Igot", "Syzygium curranii"],
    "conservation_status": "Vulnerable",
    "ancestry": {
        "kingdom": "Plantae",
        "clade": "Myrtaceae",
        "order": "Myrtales",
        "family": "Myrtle",
        "genus": "Syzygium",
        "species": "polycephaloides"
    },
    "description": "Syzygium polycephaloides or Syzygium curranii is commonly known as the Lipote fruit-bearing tree. It is an evergreen fruit-bearing tree that belongs to the Myrtle family (Myrtaceae). The tree is native to the Philippines, specifically found in the parts of Luzon. The flowers of the Lipote tree are small, white, and clustered. The Lipote tree grows from small to medium size. It’s leaves are alternate and oblong-lanceolate shaped and it has sweet-sour fruit that can sometimes be used for wine. Despite being found useful because of its nutritional value among the locals, this tree is now considered rare even in its natural habitat.",
    "notable_features": "The trunk of the tree grows up to 75 cm, its color is purplish-gray, and the texture can be smooth. The leaves are long and oblong; their structure is alternate. The texture of the leaf is smooth and glossy. The color of the leaves starts off with a pinkish shade, then turns green as it matures. Its roots are fibrous, and can grow up to 12-24 inches underground, however, it may vary for each plant. Moreover, the Lipote has a large seed; the seed can either be round or more oval-shaped. The fruits of Lipote are usually small and round, with a dark red to dark purple, as it ripens. Its flavor is sweet, but sometimes it's sour. Inside the fruit is white or sometimes pink. The size of the fruit ranges from 1 to 2.5cm, it is juicy, rich in vitamin C, and can be eaten in many ways; it can be raw, or sometimes it can be used for making wine, juices, and more. It has white flowers that bloom between May and June. The flower appears to be small, and usually groups of three.",
    "uses": "The Lipote is mainly valued for its fruit. It is usually processed into jams, jellies, juices, and wine. Moreover, the Lipote was also reported to have medicinal properties, the fruit is commonly used by the locals for diabetes, high cholesterol, and hypertension. While the Ifugaos use the fruit for treating coughs, and the Leaf.",
    "coordinates": "",
    "tree_code": "lipote",
    "image": "/images/tree/lipote.jpg"
},
{
    "scientific_name": "Terminalia catappa",
    "common_name": "Talisay Bukid, Tropical Almond",
    "coordinates": "",
    "tree_code": "talisay",
    "taxonomic_classification": {
        "kingdom": "Plantae",
        "clade": "Tracheophytes, Angiosperms, Eudicots, Rosids",
        "order": "Myrtales",
        "family": "Combreraceae",
        "genus": "Terminalia",
        "species": "T. catappa"
    },
    "conservation_status": "Least Concern"
},
{
    "scientific_name": "Toona calantas",
    "common_name": "Kalantas, Philippine Cedar",
    "coordinates": "",
    "tree_code": "kalantas",
    "taxonomic_classification": {
        "kingdom": "Plantae",
        "clade": "Tracheopytes, Angiosperms, Eudicots, Rosids",
        "order": "Sapindales",
        "family": "Meliaceae",
        "genus": "Toona",
        "species": "T. calantas"
    },
    "conservation_status": "Vulnerable"
},
{
    "scientific_name": "Trema orientalis",
    "common_name": "Anabiong",
    "coordinates": "",
    "tree_code": "anabiong",
    "taxonomic_classification": {
        "kingdom": "Plantae",
        "clade": "Angiosperms, Eudicots, Rosids",
        "order": "Rosales",
        "family": "Canabaceae",
        "genus": "Trema",
        "species": "T. orientalis"
    },
    "conservation_status": "Least Concern"
},
{
    "scientific_name": "Sterculia ceramica",
    "common_name": "Uos, Banilad",
    "coordinates": "",
    "tree_code": "uos",
    "taxonomic_classification": {
        "kingdom": "Plantae",
        "clade": "Eudicots, Rosids, Rosales, Tracheophytes, Angiosperms",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Sterculia L.",
        "species": "Sterculia ceramica"
    },
    "conservation_status": "Least Concern"
},
{
    "scientific_name": "Dracontomelon edule",
    "common_name": "Edule, Lamio",
    "coordinates": "",
    "tree_code": "edule",
    "taxonomic_classification": {
        "kingdom": "Plantae",
        "clade": "Tracheophytes, Angiosperms, Eudicots, Rosids",
        "order": "Sapindales",
        "family": "Anacardiaceae",
        "genus": "Dracontomelon",
        "species": "D. edule"
    },
    "conservation_status": "Least Concern"
    
}]