[{
    "common_name": "Tanglin",
    "scientific_name": "Adenanthera intermedia",
    "vernacular_names": ["Coralwood", "Coral Bean", "Saga Bean"],
    "conservation_status": "Vulnerable",
    "ancestry": {
        "kingdom": "Plantae",
        "clade": "Tracheophytes-Angiosperms-Eudicots-Rosids",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Adenanthera",
        "species": "Adenanthera intermedia"
    },

    "description": "Adenanthera intermedia or commonly known as Tanglin is a tree that can be only found in the Philippines. The tree belongs to the third largest family of flowering plants called the Fabaceae family. The Adenanthera intermedia is medium-sized and has bipinnate leaves that divide into oblong-shaped leaves. Its bark is usually gray to brown with a rough texture when the tree gets older. The flowers are small and pale yellow to creamy white, they also have an attractive smell. Lastly, the tree commonly grows in rainforests.",
    "notable_features": "Adenanthera intermedia is medium-sized, reaching about 19 meters tall, it has a sturdy trunk and an upright form that makes it stand out in the landscape. Its overall appearance is ornamental, often used for shade and decorative planting, while its strong and durable wood is valued for construction and furniture. The bark of Adenanthera intermedia is generally gray to brown in color, with a rough and slightly fissured texture as the tree matures. It provides a sturdy protective layer for the tree and adds to its rugged appearance, making the trunk visually distinct against its delicate foliage.\n\nThe roots of Adenanthera intermedia are strong and well-developed, anchoring the tree firmly in the soil and supporting its structure. Its roots form associations with nitrogen-fixing bacteria, similar to many members of the Fabaceae family, this enriches the soil and contributes to the fertility of its surrounding environment. The flowers of Adenanthera intermedia are small and pale yellow to creamy white, it produces its flowers along thin, dropping stalks, drooping racemes that resemble rat tails. Though individually tiny, the flowers appear in clusters that give the tree a graceful look when in bloom, attracting insects and adding beauty to its form.\n\nThe fruits of Adenanthera intermedia are flattened pods that hang down on clusters and twist as they mature. When they split open, they reveal hard, glossy red seeds marked with a distinctive black spot, making them one of the tree’s most recognizable features. The tree is a bipinnately compound tree, and it is divided into smaller leaves called leaflets.  The bright green colored leaves of the Adenanthera intermedia are divided into oblong leaflets. The size of the leaflets usually ranges from 2 to 4 cm. When the leaflets become old, the color of the tree turns brown, and they fall off.  In one branch, the leaflets grow alternately, which pattern looks like a zigzag. The tree is known as a deciduous tree; it sheds its leaves once a year. The leaves usually grow from summer, and when they shed, they reproduce new green colored leaves.",
    "uses": "In the Philippines, which is known as a tropical country, it is usually hot, and this tree is common in the country. It can be used as shade by its leaves and trunk. Its red shiny seeds can be used as a design or an ornament. Its wood can be useful for different types of furniture. Moreover, the tree can be used as a charcoal.  Adenanthera intermedia is only in the Philippines. They can be found in the different islands in this country.",
    "references": ["PROSEA - Plant resources of South East Asia. (n.d.). https://prosea.prota4u.org/view.aspx?id=4781#:~:text=Vernacular%20Names,%5D%20qu%5Baj%5Dch.", "Saga hutan, Adenanthera pavonina Linn., CIRCASSIAN BEAN, Xiang si dou: Philippine Herbal Therapy  /  Alternative Medicine. (n.d.). https://www.stuartxchange.com/SagaHutan.html#:~:text=Pods%20are%20linear%2C%2015%20to,0.5%20cm)%20and%20strongly%20fragrant.", "Adenanthera pavonina - an underutilized tree of the humid tropics - Winrock International. (n.d.-b). Winrock International. https://winrock.org/factnet/fact-net-fact-sheets/adenanthera-pavonina-an-underutilized-tree-of-the-humid-tropics/?", "Saga hutan, Adenanthera pavonina Linn., CIRCASSIAN BEAN, Xiang si dou: Philippine Herbal Therapy  /  Alternative Medicine. (n.d.). https://www.stuartxchange.com/SagaHutan.html#:~:text=Pods%20are%20linear%2C%2015%20to,0.5%20cm)%20and%20strongly%20fragrant."],

    "coordinates": "",
    "tree_code": "tanglin",
    "image": "/images/tree/tanglin.jpg"
}, {

}]