[{
        "common_name": "Tanglin",
        "scientific_name": "Adenanthera intermedia",
        "vernacular_names": ["Coralwood", "Coral Bean", "Saga Bean"],
        "conservation_status": "Vulnerable",
        "ancestry": {
            "kingdom": "Plantae",
            "clade": "Tracheophytes-Angiosperms-Eudicots-Rosids",
            "order": "Fabales",
            "family": "Fabaceae",
            "genus": "Adenanthera",
            "species": "Adenanthera intermedia"
        },

        "description": "Adenanthera intermedia or commonly known as Tanglin is a tree that can be only found in the Philippines. The tree belongs to the third largest family of flowering plants called the Fabaceae family. The Adenanthera intermedia is medium-sized and has bipinnate leaves that divide into oblong-shaped leaves. Its bark is usually gray to brown with a rough texture when the tree gets older. The flowers are small and pale yellow to creamy white, they also have an attractive smell. Lastly, the tree commonly grows in rainforests.",
        "notable_features": "Adenanthera intermedia is medium-sized, reaching about 19 meters tall, it has a sturdy trunk and an upright form that makes it stand out in the landscape. Its overall appearance is ornamental, often used for shade and decorative planting, while its strong and durable wood is valued for construction and furniture. The bark of Adenanthera intermedia is generally gray to brown in color, with a rough and slightly fissured texture as the tree matures. It provides a sturdy protective layer for the tree and adds to its rugged appearance, making the trunk visually distinct against its delicate foliage.<br><br>The roots of Adenanthera intermedia are strong and well-developed, anchoring the tree firmly in the soil and supporting its structure. Its roots form associations with nitrogen-fixing bacteria, similar to many members of the Fabaceae family, this enriches the soil and contributes to the fertility of its surrounding environment. The flowers of Adenanthera intermedia are small and pale yellow to creamy white, it produces its flowers along thin, dropping stalks, drooping racemes that resemble rat tails. Though individually tiny, the flowers appear in clusters that give the tree a graceful look when in bloom, attracting insects and adding beauty to its form.<br><br>The fruits of Adenanthera intermedia are flattened pods that hang down on clusters and twist as they mature. When they split open, they reveal hard, glossy red seeds marked with a distinctive black spot, making them one of the tree’s most recognizable features. The tree is a bipinnately compound tree, and it is divided into smaller leaves called leaflets.  The bright green colored leaves of the Adenanthera intermedia are divided into oblong leaflets. The size of the leaflets usually ranges from 2 to 4 cm. When the leaflets become old, the color of the tree turns brown, and they fall off.  In one branch, the leaflets grow alternately, which pattern looks like a zigzag. The tree is known as a deciduous tree; it sheds its leaves once a year. The leaves usually grow from summer, and when they shed, they reproduce new green colored leaves.",
        "uses": "In the Philippines, which is known as a tropical country, it is usually hot, and this tree is common in the country. It can be used as shade by its leaves and trunk. Its red shiny seeds can be used as a design or an ornament. Its wood can be useful for different types of furniture. Moreover, the tree can be used as a charcoal.  Adenanthera intermedia is only in the Philippines. They can be found in the different islands in this country.",
        "references": ["PROSEA - Plant resources of South East Asia. (n.d.). https://prosea.prota4u.org/view.aspx?id=4781#:~:text=Vernacular%20Names,%5D%20qu%5Baj%5Dch.", "Saga hutan, Adenanthera pavonina Linn., CIRCASSIAN BEAN, Xiang si dou: Philippine Herbal Therapy  /  Alternative Medicine. (n.d.). https://www.stuartxchange.com/SagaHutan.html#:~:text=Pods%20are%20linear%2C%2015%20to,0.5%20cm)%20and%20strongly%20fragrant.", "Adenanthera pavonina - an underutilized tree of the humid tropics - Winrock International. (n.d.-b). Winrock International. https://winrock.org/factnet/fact-net-fact-sheets/adenanthera-pavonina-an-underutilized-tree-of-the-humid-tropics/?", "Saga hutan, Adenanthera pavonina Linn., CIRCASSIAN BEAN, Xiang si dou: Philippine Herbal Therapy  /  Alternative Medicine. (n.d.). https://www.stuartxchange.com/SagaHutan.html#:~:text=Pods%20are%20linear%2C%2015%20to,0.5%20cm)%20and%20strongly%20fragrant."],

        "coordinates": "",
        "tree_code": "tanglin",
        "image": "/images/tree/tanglin.jpg"
    },

    {
        "common_name": "Dita",
        "scientific_name": "Alstonia scholaris",
        "vernacular_names": ["Dita (Tagalog, Bikol, Sul)", "Dalipauen (Ilocano)", "Devil Tree", "Scholar Tree", "Blackboard Tree"],
        "conservation_status": "Least Concern",
        "ancestry": {
            "kingdom": "Plantae",
            "class": "Magnoliopsida",
            "order": "Gentianales",
            "family": "Apocynaceae",
            "genus": "Alstonia",
            "species": "A. scholaris"
        },
        "description": "Alstonia scholaris, commonly known as Dita, is a tall evergreen tree with a straight, cylindrical trunk and a broad, rounded crown; it appears light gray or whitish. It exudes white latex when cut, while its roots are strong and wide-spreading, often forming buttresses in older trees. Its flowers are small and greenish-white that grow in clusters. The Dita has thick, leathery, and glossy leaves that are elliptical in shape, dark green on top and lighter underneath, and arranged in whorls of four to eight around the stem. Its stem is straight and sturdy, green when young and turning grayish-brown as it matures, with white latex inside. The bark is used in herbal medicine to treat fever and malaria, while the wood is used for making blackboards, furniture, and paper.",
        "notable_features": "It is unique for its whorled, glossy dark green leaves, its abundant, white, milky latex when cut, its massive, fluted trunk and buttresses in older trees, its fragrant white or cream flowers, and its long history of use in traditional medicine for various ailments. The wood, though lightweight, is also known for being used in making boxes, blackboards, and even school slates, which is how it earned its species name, Scholaris.",
        "fun_facts": "In some cultures, the Dita tree is also known as the \"devil tree\" due to the folklore that surrounds it. Local legends often depict it as a source of supernatural powers, illustrating the deep-rooted cultural significance of this tree. Historically, the Dita tree has also been featured in various literary works and folklore. It symbolizes strength and resilience, often being depicted as a guardian tree in local myths.",
        "folk_tale": "A beautiful woman named Dita, who was shunned by villagers because of her strong scent. A man named Gatok fell in love with her and discovered she was a diwata, daughter of Bathala. Though they married, her scent caused suffering among the villagers, leading to her eventual rejection, explaining the origin of the Dita tree in their barangay.",
        "lifespan": "Some trees may only live for a few decades or less, while others can survive for centuries or even millennia. Generally, the lifespan of a tree ranges from 30 years for fast-growing species to over 5,000 years for the oldest known trees.",
        "references": ["Hermes Bear. (2021/2022). Dita Tree: The Tale of Barangay Dita [Document]. Studocu. https://www.studocu.com/ph/document/eastern-visayas-state-university/secondary-education/dita-tree-the-tale-of-barangay-dita/14069043", "Team, G. B. T. (2025, October 2). Dita Tree Tree: Unlocking the secrets of nature’s hidden gem for health and sustainability. Grow Billion Trees. https://growbilliontrees.com/blogs/tree-stories/dita-tree-tree-unlocking-the-secrets-of-natures-hidden-gem-for-health-and-sustainability?srsltid=AfmBOorcgLK67Cmq4Dk-1bRRdtgoMaPVKKJ9FnUJT6HMZLsepc9NX1UC"],
        "coordinates": "",
        "tree_code": "dita_tree",
        "image": "/images/tree/dita.jpg"
    },

    {
        "common_name": "Cashew, Balogo",
        "scientific_name": "Anacardium occidentale",
        "vernacular_names": ["Cashew (English), Kasoy (Tagalog/Bikol), Balubad (Kapampangan), Maloko (Pangasinan), Balogo (Ilokano)"],
        "conservation_status": "Least Concern",
        "ancestry": {
            "kingdom": "Plantae",
            "class": "Rosids",
            "order": "Sapindales",
            "family": "Anacardiaceae",
            "genus": "Anacardium",
            "species": "A. occidentale"
        },

        "description": "The Balogo Tree, scientifically known as Anacardium occidentale, is a species of the Anacardiaceae family. It is also a flowering plant making it part of the Rosids clade. The tree is known by various names including Cashew (English), Kasoy (Tagalog), Maloko (Pangasinan), and Balubad (Kapampangan). It is native to Brazil, Mexico and the USA but has been widely cultivated across the globe specifically in African and Southeast Asian countries. It has a number of synonyms describing its taxonomic history ancestry, including Acajuba occidentalis and Cassuvium pomiferum.",
        "notable_features": "The Balogo Tree is a medium-sized tree, evergreen, and much branched. It grows best in hot tropical areas and can grow up to 12 meters tall in the wild. On lateritic, gravelly, or coastal sandy soils, it rarely exceeds 6 meters and forms a globose crown about 12 meters wide, while inland trees grown on loamy soils may reach 15 meters with a smaller 4–6 meter crown. Its strong taproot and extensive network of lateral and sinker roots provide stability and allow it to thrive in different soil types. The vine of this species has thick, woody stems that are often flattened and twisted, giving a “monkey ladder” appearance as it coils around forest trees. The woody stem or vine climbs upward to reach sunlight, supporting the plant’s growth and adaptation to its environment. Its bark is brown or gray in color and is smooth with longitudinal fissures. Its leaves are leathery, evergreen, simple, rounded at the ends, and form in an alternate pattern. The flowers it produces are in terminal panicles that grow to about 10 cm to 20 cm long. The flowers themselves are green or reddish in colour. The flowers are also pollinated by honey bees, flies and possibly even ants. The tree produces two fruits, the cashew apple and cashew nut. However, between the two the cashew nut is the true fruit. The cashew apple is the swollen fruit stalk.",
        "uses": "The Balogo Tree has various uses in different aspects. Its fruits, cashew apple and cashew nuts, are for food. The wood of the tree is also popularly used for firewood and charcoal. The stem also contains gum which can be used as an adhesive. It also contains medicinal properties such as cashew syrup from either the cashew apple or cashew fruit used as a remedy for coughs and colds.",
        "fun_facts": "One of the fruits that the Balogo Tree produces, cashew apple, is one of the most nutritious food crops you can find. It contains Vitamin A, Vitamin K, Vitamin C, Potassium, and Calcium. It is also a very versatile fruit as it can be processed into various products such as juice, syrup, and wine.",
        "references": ["Encarnação, S., Serrano, R., Almeida, C., & Silva, O. (2022). Micromorphology and Chemical Studies on Anacardium occidentale L. Stem Bark as an Herbal Medicine. Plants, 12(1), 7–7. https://doi.org/10.3390/plants12010007", "HS1127/HS377: Cashew Apple Fruit Growing in the Florida Home Landscape. (n.d.). Edis.ifas.ufl.edu. https://edis.ifas.ufl.edu/publication/HS377", "Anacardium occidentale - an overview | ScienceDirect Topics. (n.d.). Www.sciencedirect.com. https://www.sciencedirect.com/topics/agricultural-and-biological-sciences/anacardium-occidentale", "Barstow, M. (n.d.). Anacardium occidentale, Cashew THE IUCN RED LIST OF THREATENED SPECIESa. Retrieved October 8, 2025, from https://www.iucnredlist.org/species/pdf/60761604", "NParks | Anacardium occidentale. (n.d.). Www.nparks.gov.sg. https://www.nparks.gov.sg/florafaunaweb/flora/2/7/2709", "Anacardium occidentale Anacardiaceae L. cashew nut LOCAL NAMES Arabic. (n.d.). https://apps.worldagroforestry.org/treedb/AFTPDFS/Anacardium_occidentale.PDF", "Miranda, R. L. (2009). Cashew Tree Bark Secretion - Persectives for its Use in Protein Isolation Strategies. Open Glycoscience, 2(1), 16–19. https://doi.org/10.2174/1875398100902010016", "Agroforestree Species profile. (2025). Worldagroforestry.org. https://apps.worldagroforestry.org/treedb2/speciesprofile.php?Spid=205", "Cashew trees, in a nutshell. (2025). TREE AID. https://www.treeaid.org/blogs-updates/cashews/?srsltid=AfmBOopaKg31MNQ7EFC8GjaXcRw8pBqUQnAZTdYg0tpQSMSNP9D7uvf6", "Aluko, A., Makule, E., & Kassim, N. (2023). Underutilized Cashew Apple Fruit: Its Utility and Development as a Source of Nutrients and Value Added Products in Tanzania. Current Research in Nutrition and Food Science Journal, 11(2), 719–734. https://www.foodandnutritionjournal.org/volume11number2/underutilized-cashew-apple-fruit-its-utility-and-development-as-a-source-of-nutrients-and-value-added-products-in-tanzania/"],
        "coordinates": "13.69538°N, 123.45693°E",
        "tree_code": "cashew",
        "image": "/images/tree/cashew.jpg"
    },

    {
        "common_name": "Guyabano, Soursop",
        "scientific_name": "Annona muricata",
        "vernacular_names": ["Guyabano (Filipino, Bikol), Soursop (English), Graviola (Portuguese)"],
        "conservation_status": "Least Concern",
        "ancestry": {
            "kingdom": "Plantae",
            "class": "Magnolids",
            "order": "Magnoliales",
            "family": "Annonaceae",
            "genus": "Annona",
            "species": "A. muricata"
        },

        "description": "Annona muricata, commonly known as Guyabano in the Philippines or Soursop in English, is a small tropical evergreen tree belonging to the family Annonaceae. It is widely distributed in tropical and subtropical regions, including Central and South America, West and Central Africa, and Southeast Asia. The tree tends to bloom and bear fruit most of the year, growing in warm, humid climates with well-drained soil. Under proper care, Guyabano trees can live up to 25 years.",
        "notable_features": "The Annona muricata tree is a small evergreen tree, mostly distributed in tropical and subtropical regions, including the Philippines. Its height reaches about 5 - 10 meters tall and has a trunk diameter of 15 - 83 cm. Its bark is smooth and grayish-brown when young but becomes rough when aging, while the inner bark is pinkish. The leaves are oblong and dark green, with a thick and glossy surface, pointed at the ends, and measuring 6.25 - 20 cm long and 2.5 - 6.25 cm wide. The flowers of A. muricata are protandrous (they start as male and can later change to female) and may appear anywhere on the trunk, branches, or shoots. They are yellowish-green, extending to 4 - 5 cm long, and have six petals arranged in two whorls—three outer yellowish-green petals and three inner, close-set pale yellow petals. It produces a heart-shaped fruit with a soft-spined green outer skin and a soft, white, fibrous, juicy flesh that is sweet on the inside.  In some countries, each fruit has an average weight of 4 kg, and each contains 55–170 black seeds. The genus name “Annona” is from the Latin word “anon,” which means “yearly produce,” which refers to the plant’s regular production habits of the various species in this genus.",
        "uses": "The fruits of Annona muricata are used to prepare syrups, candies, beverages, ice creams, shakes, and teas. Some communities in Africa and South America also use this as their medicinal plant. According to some studies, Annona muricata has been scientifically and traditionally proven and used to have great natural benefits as it helps lower fever, muscle cramps, heart rate, and blood pressure. Additionally, the natural insecticidal compounds in its fruit pulp and leaves serve as organic pest repellents in agriculture.",
        "references": ["Moghadamtousi, S., Fadaeinasab, M., Nikzad, S., Mohan, G., Ali, H., & Kadir, H. (2015). Annona muricata (Annonaceae): A Review of Its Traditional Uses, Isolated Acetogenins and Biological Activities. International Journal of Molecular Sciences, 16(7), 15625–15658. https://doi.org/10.3390/ijms160715625", "World Agroforestry. (n.d.). Annona muricata. World Agroforestry Tree Database. https://apps.worldagroforestry.org/treedb/AFTPDFS/Annona_muricata.PDF", "The Editors of Encyclopaedia Britannica. (2025, October 10). Soursop | Description, Fruit, plant, uses, & Facts. Encyclopedia Britannica. https://www.britannica.com/plant/soursop", "Annona muricata - National Parks Board. (n.d.). https://www.nparks.gov.sg/florafaunaweb/flora/3/2/3258"],
        "coordinates": "",
        "tree_code": "guyabano",
        "image": "/images/tree/tanglin.jpg"
    },

    {
        "common_name": "Antipolo",
        "scientific_name": "Artocarpus blancoi",
        "vernacular_names": ["Pakak (Batanes, Cagayan, Pangasinan), Tuyop (Zambales), Kalo (Visayas Region), Tipolo (Sibuyan Island), Ugob (Bicol), Chipuho (Ivatan)"],
        "conservation_status": "Least Concern",
        "ancestry": {
            "kingdom": "Plantae",
            "clade": "Eudicots, Rosids, Rosales, Tracheophytes, Angiosperms",
            "order": "Rosales",
            "family": "Moraceae",
            "genus": "Artocarpus",
            "species": "Artocarpus b."
        },

        "description": "Artocarpus blancoi commonly known as Antipolo Tree or Tipolo Tree, a large evergreen tree and is a species of the Moraceae family. The Antipolo tree commonly grows in lowland forests, mountain slopes, and open areas with moist and fertile soil. The tree holds historical importance in the Philippines, as the city of Antipolo was named after it. Over time, it has come to symbolize Filipino heritage, strength, and connection to nature.",
        "notable_features": "The Antipolo tree (Artocarpus blancoi), also known as Tipolo, is a large evergreen  tree that typically grows about 30 to 40 meters tall and can reach a trunk diameter of around 60 centimeters or more. It has a straight trunk with short, stout buttresses at the base, and its outer bark is grayish-black, when cut the bark releases a white latex that can be used as a natural adhesive. The roots are strong and should be planted with the root collar at or slightly below the soil surface. Its flowers are very small and grow in clusters located in the leaf axils, with separate clusters for male and female blooms—the male flowers are yellowish, elongated, cylindrical, and spongy, while the female flowers are round. The fruit of the Antipolo tree (Artocarpus blancoi) is ellipsoid in shape, typically measuring about 10 centimeters long and 7 centimeters wide. When the fruit matures, it turns into a yellow to orange-brown color and is covered with short, spiky or rough appendages about 1 centimeter long. A fleshy edible vegetable that can be eaten when cooked.<br><br>According to BINHI (n.d.) Leaf characteristics are similar to Artocarpus altilis (Rimas). The leaves are simple and arranged in a spiral pattern, each having one to three pairs of lobes. The petioles are covered with fine hairs and measure around 8 centimeters long, while the stipules are also hairy and about 10 centimeters in length.",
        "uses": "The wood of the Antipolo tree is locally used for light construction, while its fruits are usually cooked and eaten as vegetables. The white sap can be used as a glue or adhesive for household purposes. Ecologically it helps prevent soil erosion and can be used for coastal protection or as a boundary marker.",
        "fun_facts": "There is a tradition/family of stories around trees in place-names. For example, one barrio in Lipa City is said to have gotten its name “Antipolo” because there was a prominent large antipolo tree in the middle, and people used it as reference—“sa may antipolo” (“by the antipolo”) when giving directions. The Antipolo tree likely has a lifespan for over a century, especially under ideal conditions. The Antipolo is also endemic and it tolerates a range of conditions.",
        "references": ["IUCN. (n.d.). Artocarpus blancoi [PDF]. The IUCN Red List of Threatened Species. https://www.iucnredlist.org/species/pdf/61524790", "Philstar. (2011, October 24). Native Tree Month, Part 2: Antipolo — Artocarpus blancoi (Elm) Merr. Philstar. https://www.philstar.com/cebu-news/2011/10/24/740381/native-tree-month-part-2-antipolo-artocarpus-blancoi-elm-merr/amp/", "BINHI. (n.d.). Antipolo (Artocarpus blancoi). Tree Info – BINHI. https://binhi.ph/tree-info/?tree-name=Antipolo", "StuartXchange. (n.d.). Antipolo / Artocarpus blancoi / tipolo: Philippine Medicinal Herbs. https://www.stuartxchange.org/Antipolo.html"],
        "coordinates": "",
        "tree_code": "antipolo",
        "image": ""
    },

    {
        "common_name": "Langka, Jackfruit",
        "scientific_name": "Artocarpus heterophyllus Lam",
        "vernacular_names": ["Nangka, Anangka, Badak, Angka"],
        "conservation_status": "Non-extinct",
        "ancestry": {
            "kingdom": "Plantae",
            "clade": "Tracheophytes-Angiosperms-Eudicots-Rosids",
            "order": "Rosales",
            "family": "Moraceae",
            "genus": "Artocarpus",
            "species": "A. heterophillus"
        },

        "description": "Artocarpus heterophyllus lam commonly known as Langka is a tropical tree native to South and Southeast Asia. It belongs to the Moraceae family, which includes mulberries and figs. The large Langka tree has a dense canopy, thick bark that darkens with age, and glossy, leathery oval leaves. It produces the largest fruit of all trees, characterized by spiky green skin and sweet, fragrant yellow flesh. Rich in nutrients, Langka is frequently used in various Filipino dishes and desserts thrive in warm, humid climates, particularly in lowland tropical forests.",
        "notable_features": "Jackfruit is a tree and can grow large and fast, up to 15 to 20 meters. It has a pronounced and prominent architecture and fast-growing, thick, and large leaves and evergreen nature. Jackfruit trees make functional and ornamental additions to home gardens and rural roadside as shade trees, as well as garden and roadside ornaments, due to their fruits. Jackfruit trees have textured and contorted bark as well as large and glossy leaves, and age tends to accentuate and dramatize bark fissures and make rough, dark brown-gray bark, creating contrast and roughened surfaces where juxtaposed glossy leaves.<br><br>Artocarpus heterophyllus trees have well developed and expansive rooting systems that functionally keep trees anchored and growing well. This allows expanding growth and fruit, supported in direct trunk and major branch fruit growth even like jackfruit tree fruit. Jackfruit trees, unlike pioneering legumes, have no hosting symbiotic nitrogen fixing organisms. Jackfruit tree fruit is large and well developed, supportive rooting system growing, and trunk and major branch fruit growth is called cauliflory.<br><br>Small and unisexual, jackfruit flowers come in male and female variants and are arranged in separate \"clusters.\" They are crowding and coming directly from the tree trunk and branches, and although none are particularly noteworthy, these flowers are remarkable because of their unusual placement and because of the role the placement occupies in the formation of the enormous fruit.",
        "uses": "In the Philippines, langka can be both a fruit and a vegetable that can  be served as one of the dishes. It also has high carbohydrates content and vitamin C meaning it holds a lot of carbohydrate material like its natural sugar. Langka seeds are very rich in starch, but poor source of calcium and iron.",
        "fun_facts": "Langka is  the largest tree-borne fruit and is very versatile. A single tree can produce hundreds of fruit each year, and every part of it can be used. The seeds can be eaten after boiling or roasting, and the unripe fruit is used as a vegetable in Indian cuisine, mostly in pickles. When it is ripe, the fruit is sweet, fragrant, and excellent for desserts or eaten fresh. In every way, jackfruit is a remarkable and rare plant.",
        "references": ["Langka / Artocarpus Heterophyllus / Jack fruit / Mu bo luot: Philippine Medicinal Herbs / Philippine Herbal Medicine. (n.d.) https://www.stuartxchange.com/Langka.html", "The Editors of Encyclopaedia Britannica. (2025, September 13). Jackfruit | Description & Uses. Encyclopedia Britannica. https://www.britannica.com/plant/jackfruit", "Wakao Foods. (2023, October 9). 7 Jaw-Dropping Facts about Jackfruits: You Cannot Miss  – Wakao Foods. https://www.wakaofoods.com/blogs/from-the-founders-desk/7-jaw-dropping-facts-about-jackfruits-you-cannot-miss"],
        "coordinates": "",
        "tree_code": "langka",
        "image": "/images/tree/langka.jpg"
    },

    {
        "common_name": "Gumihan, Pedalai",
        "scientific_name": "Artocarpus sericicarpus",
        "vernacular_names": ["Terap bulu, Gumihan (Tagalog),  Gomihan (Bikol)"],
        "conservation_status": "Near Threatened",
        "ancestry": {
            "kingdom": "Plantae",
            "clade": "Tracheophytes, Angiosperms, Eudicots",
            "order": "Rosales",
            "family": "Moraceae",
            "genus": "Artocarpus",
            "species": "A. sericicarpus"
        },

        "description": "Artocarpus sericicarpus, known in the Philippines as Gumihan, is a large, tropical evergreen species of the Moraceae family. It is also known as Pedalai, it can reach heights up to 40 meters tall and is highly valued for its fruit, which is regarded as one of the most delicious in its genus, a group that also includes jackfruit and breadfruit. The tree is native to Borneo and Philippines, usually found in humid and steep areas.<br><br>The tree's characteristics include a straight, cylindrical trunk, and branches that grow outward, making the crown much wider. Its leaves are dark green; young leaves are often lobed while mature ones are entire and leathery. Gumihan's flowers grow in cylindrical heads. Its fruit is round, very similar to rambutan but a bigger version, with soft, hair-like projections on its skin and a bright orange color when ripe. Each fruit contains numerous seeds each surrounded by white-sweet pulp. This tree is very abundant and well-known here in Bicol.",
        "notable_features": "The Artocarpus sericicarpus has a straight, cylindrical trunk with a broad, spreading crown that often overlaps with neighboring trees. The bark is grey or dark grey and, as the tree matures and increases in diameter, it becomes scaly, fissured, or roughened in some areas, though younger bark is generally smooth. The bark is thick and fibrous, and the inner layers contain a sticky latex. Mature Pedalai develops massive, distinctive buttress roots that shoot out from the base of the trunk for structural support, with its wide, shallow root system often intertwining with neighboring trees. The leaves are noticeable for its size and form, with it being arranged in a spiral pattern on the twigs. Mature leaves are typically dark green, large, leathery, and elliptic to ovate in shape. The surface of the leaf usually has a slightly rough texture. The young leaves are lobed, but as the plant matures, they transition to the full-margined elliptical shape. The tree can shed most of its leaves when stressed by conditions outside its ideal warm, humid environment, such as cold temperatures, drought, or malnutrition. The tree is monoecious, meaning it produces both male and female flowers on the same plant, growing in clusters that form small, short, cylindrical heads with soft, hairy bristles. The fruit of this tree is large and round, with a bright orange color when ripe and a skin covered in soft, hair-like projections. Inside is the soft, sweet, pulp, which surrounds the seeds. Even the seeds are edible after being cooked, often by boiling or roasting.",
        "uses": "Pedalai is an important resource in the Philippines, it has been collected for its uses as food from the fruit, medicine from the leaves, it can be eaten boiled, baked, or roasted. The latex from the tree is used for batik-making, and its wood for creating households and boats. The bark is also traditionally used to make barkcloth. Pedalai is historically significant as a resource embedded in traditional life, with every part of the tree holding a cultural and material value.",
        "fun_facts": "A fun fact about the Pedalai tree here at our school is that it grows in the same area alongside three other trees. Because of the trees planted closely, their large roots often overlap and intertwine, and their crowns touch each other, creating a thick shade. This also makes it confusing to distinguish one tree from another. If you look at it from afar, it might look like one enormous tree, making it difficult to identify a tree’s leaves, roots, or twigs if not inspected carefully.",
        "references": ["Artocarpus sericicarpus. (n.d.). iNaturalist. https://www.inaturalist.org/taxa/430692-Artocarpus-sericicarpus#articles-tab", "Best Organic Farm and Nursery in Kerala,India| Variety of exotic fruits and plants for sale. (n.d.). https://www.inetfarms.com/thisfruit/266#:~:text=Artocarpus%20sericarpus%2C%20the%20pedalai%2C%20gumihan,with%20smallsoft%20curly%20hair%20protrusions.", "Gumihan seedling. (n.d.). Lunti Plant Nursery. https://lunti.ph/products/gumihan", "Lr. (n.d.). Artocarpus Fruits Guide, Archives RFC Australia. https://www.growables.org/information/TropicalFruit/JackfruitArcRFC4.htm", "NParks | Artocarpus sericicarpus. (n.d.). https://www.nparks.gov.sg/florafaunaweb/flora/8/7/8795", "National Parks Board (NParks). (n.d.). Default. https://www.nparks.gov.sg/", "Onszaden. (n.d.). Pedalai (Artocarpus sericicarpus). https://onszaden.com/Artocarpus-sericicarpus", "Pedalai - Penang Tropical Fruit Farm. (n.d.). Penang Tropical Fruit Farm. https://tropicalfruitfarm.com.my/fruits/p,p-t/pedalai-2/", "StuartXchange. (n.d.). Family • Moraceae Gumihan Artocarpus sericicarpus F.M.Jarrett PEDALAI. https://www.stuartxchange.org/Gumihan"],
        "coordinates": "",
        "tree_code": "gumihan",
        "image": "/images/tree/gumihan.jpg"
    },

    {
        "common_name": "Pili",
        "scientific_name": "Canarium ovatum",
        "vernacular_names": ["Pili, Pilinuts, Pilaui, Liputi (Tagalog); also known in trade as Philippine nut or Galip nut."],
        "conservation_status": "Least Concern",
        "ancestry": {
            "kingdom": "Plantae",
            "clade": "Eudicots, Rosids",
            "order": "Sapindales",
            "family": "Burseraceae",
            "genus": "Canarium",
            "species": "C. ovatum Engl."
        },

        "description": "The evergreen species Canarium ovatum, commonly known as Pili, is native to the Philippines and belongs to the Burseraceae family. It is known to be most diverse in areas like Bicol, Leyte, and Samar, where it grows naturally. With trunks that can reach 50 centimeters in diameter and occasionally develop buttresses, mature trees typically reach heights of 20 to 25 meters with a straight trunk and a dense, symmetrical crown. It thrives in deep, fertile, well-drained soils in humid tropical climates and is commonly found in lowland forests up to 400 meters in elevation.",
        "notable_features": "The Pili tree is a medium- to large-sized evergreen known for its robust root system and a dense crown. Its trunk is frequently straight when young and slightly spreads as the tree ages. The genus is distinguished by the rough texture and resin exudation of its bark, which is generally a smooth grayish color. One striking characteristic is that it produces additional fruits after exposure to environmental stressors like typhoons or dry spells, earning it the label of the \"stress-loving tree\" among farmers. The tree bears compound leaves that measure approximately 16 cm in length overall, with alternately placed leaflets. These leaflets are typically composed of 5 to 9 units that are leathery, glossy, and elliptic in shape. The Pili's flowers are small, pale yellowish-green, and aromatic, appearing in clusters on young shoots. The tree is mostly dioecious, meaning that the male and female flowers grow on different trees, and are primarily pollinated by insects. Its fruit is a drupe, which is oblong and pointed at both ends, measuring about 4 to 7 cm in length. Upon ripening, its outer coat turns deep purple or black, covering a fibrous pulp and a hard, triangular shell that contains the edible kernel. The kernel is rich in oil, protein, and essential fatty acids. With optimal conditions, a mature tree can produce as much as 100–150 kg of in-shell nuts annually.",
        "uses": "Virtually every part of the Canarium ovatum is useful, which accounts for its wide variety of applications in food, industry, and traditional practice. The kernel (pili nut) is the tree's most valuable part, being rich in oil, protein, and fats, when roasted or caramelized, it develops a buttery nutty flavor, making it popular in confections, baked goods, chocolates, and local delicacies. The fruit pulp is edible after cooking, can be eaten as a vegetable, and yields pili pulp oil used in cooking, soap, and cosmetics, while the young shoots are also edible and used in salads. For industrial and practical purposes, the hard shell of the fruit is used as charcoal or fuel, and the tree's resin (elemi) is used in the production of varnishes, perfumes, and medicinal ointments, with the wood used for light construction, furniture, and firewood. In traditional practice, the kernel emulsion has served as an infant milk substitute, and the oil has been used as a mild laxative, with modern studies confirming that the pulp oil contains bioactive compounds with antioxidant and antibacterial properties. Beyond these uses, the Pili tree holds significant cultural importance in many Philippine communities as an essential source of livelihood, craftsmanship, and local industry.",
        "references": ["Agroforestree Species profile. (n.d.). https://apps.worldagroforestry.org/treedb2/speciesprofile.php?Spid=425", "Dumandan, N. G., Kagaoan, A. C. T., Acda, R. D. P., Tumambing, C. R., & Pham, L. J. (2022). Extraction, profiling, and characterization of phytosterols and triterpenoids from pili (Canarium ovatum Engl.) pulp oil exhibiting antioxidant and antibacterial properties. Biochemistry Research International. https://pubmed.ncbi.nlm.nih.gov/36606186/", "FAO / UPLB. (2023). Key descriptors for Pili nut (Canarium ovatum Engl.) [Descriptor list]. https://openknowledge.fao.org/bitstreams/2e60a054-955d-4e24-8a75-6f9ba522dbe1/download", "Pili / Canarium ovatum / Philippine nut: Philippine Medicinal Herbs / Philippine Alternative  Medicine. (n.d.). https://www.stuartxchange.org/Pili.html", "Pham, L. J. (2015). Philippine pili: Composition of the lipid molecular species. Journal of Ethnic Foods. https://www.sciencedirect.com/science/article/pii/S2352618115000621", "The Editors of Encyclopaedia Britannica. (1998, July 20). Pili nut | Description, Tree, Nut, Nutrition, & Facts. Encyclopedia Britannica. https://www.britannica.com/science/pili-nut", "Tropical Plants Database. (n.d.). Canarium ovatum — useful tropical plant information. Retrieved from https://tropical.theferns.info/viewtropical.php?id=Canarium+ovatum", "Wikipedia. (2024, April). Canarium ovatum. In Wikipedia. https://en.wikipedia.org/wiki/Canarium_ovatum"],
        "coordinates": "",
        "tree_code": "pili_tree",
        "image": ""
    },

    {
        "common_name": "Agoho",
        "scientific_name": "Casurina equisetifolia",
        "vernacular_names": ["Agoho, Aro, Agoso, Maribuhok"],
        "conservation_status": "Least Concern",
        "ancestry": {
            "kingdom": "Plantae",
            "clade": "Rosids",
            "order": "Fagales",
            "family": "Casuarinaceae",
            "genus": "Casuarina L.",
            "species": "Casuarina equisetifolia"
        },

        "description": "Casuarina equisetifolia, from the family of Casuarinaceae, commonly known as Agoho, is a large, conifer native Philippine Tree. It grows in sandy loam as it is not suitable for heavy soils , usually found in humid tropical and subtropical coastlines, open sandy valleys along streams, high altitudes— sometimes as high as 800 meters. This species has trunks that extend an average height of 25 cm with a diameter of 150 cm. It primarily helps in erosion control because of its deep-rooted roots, and its materials that can be used for various purposes.<br><br>Furthermore,  the Agoho tree provides useful components such as seeds, bark, leaves, and fruits which help  in medical treatments—specifically, stomach aches, coughs, asthma, diabetes, diarrhea, dysentery and nervous disorders.<br><br>The Agoho tree is a tree characterized by its tall trunk and narrowly pyramidal crown. The “horse hair”  leaves are arranged in whorls of 7 or 8 around branchlets. The leaves measure about 1 to 3 mm and the branchlets are up to 38 cm. The tree has needle-like branches, similar to pine branches. It yields male flowers which are tiny spikes at the ends of green twigs, while female flowers are small brownish heads on swollen ends of brownish twigs; both shaped as catkins. They also produce oval woody fruits, which open and turn into brown when ripen. Agoho’s seeds are  lightweight and they are dispersed by the wind, allowing them to travel over long distances.<br><br>The Agoho trees' natural habitat is located in coastal regions of Southeast Asia, the Philippines, and Pacific islands. They are pioneer species, which means they can swiftly colonize disturbed areas such as coastal regions and sand dunes. These trees are highly adaptable to coastal conditions due to their high salt-tolerance, which also makes it excellent for planting along coastlines or in coastal restoration projects. They help stabilize coastal areas, and sand dunes, preventing soil loss and damage from wind and water erosion. Aside from that, Agoho can be used in soil enrichment, coastal reclamation, and potential absorption of heavy metals and dyes from wastewater treatment.",
        "notable_features": "The Agoho tree is characterized by its light greyish-brown bark, which is smooth when young and becomes slightly rough and brittle with maturity. Its roots are entrenched, enabling strong anchorage  in sandy or rocky soils, which control erosion, and thrive in soils with larger proportions of gravel and sand particles—allowing strong stability, along with preventing nutrient and water loss. The tree generates monoecious, catkins  flowers. Its fruits are small, oval and woody—initially grey or yellow green, then develops into brown. The leaves are tiny, greyish-green, scales,  measuring about 0.1 - 0.3 cm  long, arranged in rings with 6 - 8 scales, and are not alternate. They have a moderate growth rate of approximately 25 cm per year, with 20 years being the maximum growth and a lifespan of 40 to 50 years.  These attributes make the Agoho essential in the necessity of organisms, human economy, and the environment.",
        "uses": "The Agoho tree has a huge scope of various environmental uses and functional applications. Usually, its wood can be utilized for the production of paper pulp, and fuel. The Bark comprises  a red pigment which is used for making dyes. While the leaves are used for creating traditional medicines or simply for decoration purposes.",
        "fun_facts": "Agoo, a coastal town in the Philippines, is named after Agoho. Due to its green, needle-like leaves, resembling pine trees, it can be an alternative to Christmas trees.  Given that, many use Casuarina equisetifolia as decorations to their homes, offices, and other places, offering a fresh and welcoming environment.",
        "references": ["Agoho, Casuarina equisetifolia Linn., IRON WOOD / Philippine Herbal Therapy  /  Alternative Medicine. (n.d.). https://www.stuartxchange.org/Agoho.html", "Australian Pine (Casuarina equisetifolia). (n.d.). Center for the Study of the Built Environment. https://www.csbe.org/australian-pine-casuarina-equisetifolia", "Berame, J. (n.d.). INTERNATIONAL REVIEW OF HUMANITIES AND SCIENTIFIC RESEARCH By International Scientific Indexing www.irhsr.org 520 PRELIMINARY RESULTS OF GYMNOSPERM SPECIES INVENTORY IN CARAGA REGION XIII, PHILIPPINES. https://irhsr.org/papers/1513675531.pdf", "Casuarinaceae. (n.d.).  https://www.philippineplants.org/Families/Casuarinaceae.html", "Casuarina equisetifolia Casuarinaceae L. ironwood, beaf-wood. (n.d.). https://apps.worldagroforestry.org/treedb/AFTPDFS/Casuarina_equisetifolia.PDF", "Maeght, J.-L., Rewald, B., & Pierret, A. (2013). How to study deep roots—and why it matters. Frontiers in Plant Science, 4. https://doi.org/10.3389/fpls.2013.00299", "NParks | Casuarina equisetifolia. (n.d.). https://www.nparks.gov.sg/florafaunaweb/flora/2/7/2793", "PROSEA - Plant resources of South East Asia. (n.d.).  https://prosea.prota4u.org/view.aspx?id=2993", "WwwUpaneIt, U.-. (n.d.). GISD. https://www.iucngisd.org/gisd/species.php?sc=365#:~:text=arbol%20de%20hierro%20(Spanish%2C%20Galapagos,Casuarina%20litorea%20%2C%20Rumpheus%20ex%20Stickman"],
        "coordinates": "",
        "tree_code": "agoho",
        "image": "/images/tree/agoho.jpg"
    },

    {
        "common_name": "Star Apple, Caimito",
        "scientific_name": "Chrysophyllum cainito",
        "vernacular_names": ["Star Apple, Achras cainito, Cainito, Caimito (Filipino)"],
        "conservation_status": "Least Concern",
        "ancestry": {
            "kingdom": "Plantae",
            "clade": "Tracheophytes, Angiosperms, Eudicots, Asterids, Myrtales",
            "order": "Ericales",
            "family": "Sapotaceae",
            "genus": "Chrysophyllum",
            "species": "C. cainito"
        },

        "description": "Chrysophyllum cainito, commonly called Cainito or Star Apple, belongs to the Sapotaceae family. It is one of the most common backyard and roadside fruit trees in the Philippines. Historically, the caimito traces back to Peru, where it was first documented by the Spanish explorer Cieza de Leon in the early 1500s. However, it had already been enjoyed for centuries by indigenous peoples before European contact. Over time, it spread widely and became well-known in regions such as Panama, the Philippines, the Caribbean, Guatemala, Zanzibar, and India’s warmer climates. A native to the West Indies and Central America, it was first introduced to the country in 1905 by W.S. Lyon, a horticulturalist with the Philippine Bureau of Plant Industry. In the Philippines, there are two main varieties: cainito blanco (white star apple) and cainito morado (purple star apple).",
        "notable_features": "The caimito tree is a medium to large tropical evergreen, typically reaching 25 to 100 feet (7.9 to 30.5 m) in height. It has a round to oval canopy, giving it a full and dense appearance. Its short, stout trunk supports gracefully weeping branches, making it not only functional but also highly ornamental. The foliage is particularly striking, with leaves that are shiny dark green on the upper surface and a silky golden-brown or copper underside, creating a beautiful contrast that glimmers in sunlight.<br><br>The bark of the caimito is brown, rough, and irregularly fissured, while the inner bark is orange-white to yellow-white, fibrous, and exudes white latex when cut. On young twigs, the bark appears reddish-brown and hairy. The flowers are small and inconspicuous, often purplish-white or greenish, and may be unisexual or bisexual. They grow in axillary clusters or directly on the trunk and branches, a feature known as cauliflory. Each flower has a reddish-brown, hairy stalk, a calyx with 4–6 sepals, and a 5-lobed corolla, and they emit a strong odor.<br><br>The fruit of the caimito is its most famous feature. It is round to oblate to ellipsoid, measuring 5–10 cm in diameter, with a smooth, glossy, leathery peel that can be red-purple, dark-purple, or pale green. Inside, the pulp is soft, white, and milky, surrounding 6 to 11 seeds encased in a gelatinous pulp. When sliced across, the fruit reveals a star-shaped pattern, which is why it is commonly called the Star Apple.<br><br>The leaves are alternate, elliptic, and slightly leathery, ranging from 5–15 cm long, with a shiny green upper surface and a golden-brown underside. The stem is erect with drooping branches, and the young leaves are often hairy and shiny, showing red or yellowish tones beneath. Together, these features make the caimito tree not only a source of sweet, edible fruit but also an ornamental and medicinal tree valued in many tropical regions.",
        "uses": "The cainito tree is highly valued for its many uses. Its fruit is sweet when ripe and is commonly eaten fresh or processed into preserves. Beyond its pleasant taste, the ripe fruit has medicinal value, as it is used to soothe inflammation in conditions such as laryngitis and pneumonia, and is also applied in the treatment of diabetes, angina, hemorrhage, and fever. The leaves of the tree are traditionally used for treating wounds and hypoglycemia, while the bark is prepared as a remedy for diarrhea, dysentery, hemorrhages, gonorrhea, and bladder infections.<br><br>Aside from its medicinal applications, the caimito tree has several practical uses. The branches are sometimes used as a medium for growing orchids, and the wood pulp can be processed into high-quality paper. Its bark also yields tannin, which is useful in tanning and dyeing. Meanwhile, the wood itself, though not the hardest, is suitable for indoor construction and is also used as fuel. These combined benefits make the caimito not only a source of nourishment but also an important resource for traditional medicine and practical daily use.",
        "fun_facts": "In Vietnam, the star apple is called vú sữa, which means “mother’s milk.” This name comes from a well-known folktale that highlights both the tree’s symbolism and the unique texture of its fruit. According to the story, a mother once left her children in anger. Heartbroken, the children cried beneath a tree, and their tears flowed into its roots. When the mother returned to find them gone, she discovered that the tree had transformed in their place. One day, she heard sounds in the branches that reminded her of her children’s voices, and a fruit fell to the ground. When it split open, it released a fragrant white juice that tasted like her own milk. The mother realized that her children had become the tree itself, offering her comfort through its fruit. Because of this tale, the milky white flesh of the caimito fruit is seen as a symbol of a mother’s love.<br><br>Another unique trait of the caimito is its name “star apple,” which comes from the star-shaped pattern that appears when the fruit is sliced crosswise. Beyond its cultural meaning and distinct look, the tree also has a fairly long lifespan, living for about 20 to 50 years or more, depending on its environment and care.",
        "references": ["NParks | Chrysophyllum cainito. (n.d.). https://www.nparks.gov.sg/florafaunaweb/flora/2/8/2803", "Marketman. (2005, April 2). Caimito / Star Apple. Market Manila. https://www.marketmanila.com/archives/caimito-star-apple", "Crane, J., & Balerdi, C. F. (2020, January 7). Caimito (Star Apple) growing in the Florida home landscape. Ask IFAS - Powered by EDIS. https://edis.ifas.ufl.edu/publication/HS309", "Chrysophyllum cainito Star Apple, Caimito PFAF Plant Database. (n.d.). https://pfaf.org/user/Plant.aspx?LatinName=Chrysophyllum+cainito", "Team, S. (2021, September 24). Star Apple: the tropical American fruit. Recette Magazine. https://blog.suvie.com/star-apple-the-tropical-american-fruit", "The story about Vietnam Star fruit. (n.d.). TIGER Tours. https://www.mytigertour.com/blog/the-story-about-vietnam-star-fruit#:~:text=The%20boy%20dropped%20his%20lips,Picture%20source:%20Internet"],
        "coordinates": "",
        "tree_code": "star_apple",
        "image": "/images/tree/cainito.jpg"
    },

    {
        "common_name": "Pomelo",
        "scientific_name": "Citrus maxima",
        "vernacular_names": ["Pomelo, Lukban, Suha, Buongon, Pummelo, Shaddock, Youzi"],
        "conservation_status": "Least Concern",
        "ancestry": {
            "kingdom": "Plantae",
            "clade": "Tracheophytes, Angiosperms, Eudicots, Rosids",
            "order": "Sapindales",
            "family": "Rutaceae",
            "genus": "Citrus",
            "species": "C. maxima"
        },

        "description": "Citrus maxima, commonly known as Pomelo or Lukban, is a natural, non-hybrid tree native to Southeast Asia, belonging to the Rutaceae family. It is considered a native crop in the Philippines, widely cultivated for its round fruits, the largest and heaviest ones in the world. Pomelo trees can grow up to 15 meters tall in height and 10 to 30 centimeters in diameter, with trunks that often have crooked, irregular, and low-hanging branching patterns. It is an original ancestor of cultivated Citrus species, including orange and grapefruit. They are found in tropical humid lowland elevations requiring monsoon climates with wet and dry seasons, sun exposure, and high humidity.",
        "notable_features": "Its leaves are large with a leathery texture, typically oval or elliptical in shape with a glossy, dark green surface and a downy or fuzzy lighter underside, while their structure is simple with a single leaflet. Flowers are fragrant and yellow-white in color, often single or in clusters. Its bark is rough in texture and has several gray hues, ranging from light to dark. The tree is commonly grown for its sweet fruit, the largest citrus originating from Southeast Asia, with a thick yellow-green rind and sweet, tangy flesh that can be white, pink, or red. The fruit seeds are typically white and monoembryonic. The whole fruit contains many nutritional benefits such as a good source for vitamin C, vitamin A, antioxidants, fiber, and minerals like potassium and magnesium.",
        "uses": "Pomelo is a versatile plant, the fruit is used fresh as snacks, desserts, fruit preserve, juices, and even in savory dishes. The raw rind and pith can be cooked into candies or used to make zest that adds fragrance and flavor to food. It is used in traditional alternative medicine for its medicinal properties to treat cough and gastrointestinal illnesses, and is still being further researched to study its specific compounds to develop herbal products and foods.",
        "fun_facts": "Pomelo leaves are evergreen and have winged petioles. The fruit is green when unripe and turns yellow when it is ready to harvest. Pomelo trees are perennial and can live for many years, with a lifespan similar to grapefruit trees, which can live up to 50 years. A grafted pomelo tree produces fruit faster, typically within 2 to 4 years, has better disease resistance, and remains smaller in size. In contrast, a seed-grown pomelo tree takes longer to bear fruit, usually between 5 to 10 years, and may not produce the same quality as the parent tree. It also tends to grow larger and has more thorns.",
        "references": ["Pan, T., Ali, M. M., Gong, J., She, W., Pan, D., Guo, Z., Yu, Y., & Chen, F. (2021). Fruit Physiology and Sugar-Acid Profile of 24 Pomelo (Citrus grandis (L.) Osbeck) Cultivars Grown in Subtropical Region of China. Agronomy, 11(12), 2393. https://doi.org/10.3390/agronomy11122393.", "Sharma, S., Singh, B., Kaur, G., Srivastava, Y., & Sandhu, R. S. (2024, August 30). Nutritional, Bioactive, and Health Potential of Pomelo (Citrus maxima): An Exotic Underutilized Fruit. https://www.foodandnutritionjournal.org/volume12number2/nutritional-bioactive-and-health-potential-of-pomelo-citrus-maxima-an-exotic-underutilized-fruit.", "Thilavech, T., Suantawee, T., Chusak, C., & Adisakwattana, S. (2025). Pomelo By-Products: A Bibliometric Review on Enhancing Gut Health and Digestive Function for Metabolic Regulation through Advanced Processing Techniques. Current Research in Food Science, 101150. https://doi.org/10.1016/j.crfs.2025.101150."],
        "coordinates": "",
        "tree_code": "pomelo",
        "image": ""
    },

    {
        "common_name": "Calamansi",
        "scientific_name": "Citrus microcarpa",
        "vernacular_names": ["Kalamansi (Filipino), Calamondin,  Hazara, Manao wan, Jeruk Kasturi, Karamonjin, Limau kesturi, Gan"],
        "conservation_status": "Least Concern",
        "ancestry": {
            "kingdom": "Plantae",
            "clade": "Tracheophytes, Angiosperms, Eudicots, Rosids",
            "order": "Sapindales",
            "family": "Rutaceae",
            "genus": "Citrus",
            "species": "C. microcarpa"
        },

        "description": "Citrus microcarpa, or its common name, Calamansi, is a citrus hybrid cultivated in the Philippines. It is a hybrid of kumquat and mandarin, and it is native to our country, parts of Indonesia, Malaysia, Brunei, Taiwan, and some parts of China. As a fruit-bearing plant, it has many uses, especially in traditional medicine and cuisine, and is overall popular among most countries in Asia, as well as some overseas.",
        "notable_features": "The Calamansi is usually a shrub or small tree growing up to 3-5 meters tall. Its stem is slender with upright branches and the roots are long and deeply buried in the soil. The leaves are usually dark green  in color with a pale green underside, have a glossy appearance, and its shape is elliptic to obovate, meaning it is wider at the tip. They have an alternate formation and its scent is aromatic when crushed or crumpled. This tree also produces white colored, star shaped flowers, which are fragrant in smell. These flowers fall off to produce the aspect that makes this plant popular, and that is its fruit. The fruit is round in shape, resembling a small lime. It has a thin peel, its color varying from green to yellow encapsulating the juicy orange center pulp and the small, obovoid seeds buried in the pulp.",
        "uses": "Citrus microcarpa is a resourceful plant and has many uses, specifically regarding its leaves, flowers, and fruit. Its fruit is the most notable, used in culinary arts as either a main ingredient in a dish to add a citrusy flavor, a condiment for the same purposes, or its juice is extracted to make a flavorful drink on its own or be put in other drinks. Aside from that, it is also used as treatment for skin irritations, coughs, and colds.<br><br>Both its leaves and flowers are brewed as tea, as in traditional practices with medicine, the plant’s leaves are made into teas as a remedy for coughs, colds, and mild stomach aches. It is sometimes combined with other herbs and has a calming effect on the body when consumed. Meanwhile, the flowers provide a relaxation and stress relieving result after drinking it as tea.",
        "references": ["Wikipedia contributors. (2025, September 28). Calamansi. Wikipedia. https://en.wikipedia.org/wiki/Calamansi", "Citrus × microcarpa. (n.d.). https://www.socfindoconservation.co.id/plant/263?lang=en", "Calamansi Tree - unbeleafable. (2023, July 13). Unbeleafable. https://unbeleafable.ph/product/calamansi-tree", "Swanson, B. (2025, September 10). Calamansi Leaf Tea – A Gentle Citrus Brew • The Rustic Spade. The Rustic Spade. https://therusticspade.co.za/calamansi-leaf-tea-a-gentle-citrus-brew/", "Swanson, B. (2025, September 10). Calamansi Leaves vs. Flowers – Which Makes the Better Tea? • The Rustic Spade. The Rustic Spade. https://therusticspade.co.za/calamansi-leaves-vs-flowers-which-makes-the-better-tea/"],
        "coordinates": "",
        "tree_code": "kalamansi",
        "image": ""
    },

    {
        "common_name": "Dao",
        "scientific_name": "Dracontomelon Dao",
        "vernacular_names": ["Dao, New Guinea walnut. Papua New Guinea walnut, Pacific walnut"],
        "conservation_status": "Least Concern",
        "ancestry": {
            "kingdom": "Plantae",
            "clade": "Tracheophytes, Angiosperms, Eudicots, Rosids",
            "order": "Sapindales",
            "family": "Anacardiaceae",
            "genus": "Dracontomelon",
            "species": "D. dao"
        },

        "description": "Dracontomelon dao commonly known as Dao, a large, tropical evergreen tree species of the Anacardiaceae family. The tree is known by a variety of names including Argus Pheasant Tree, New Guinea Walnut, Papuan Walnut. It is native to an extensive range across Southeast Asia and the Pacific, including countries like the Philippines, Thailand, South China, Cambodia, Vietnam, New Guinea, Myanmar, Laos and many more. Dao is distinguished by its height, oftenheight, often growing up to 45-55 meters tall but can still grow larger. It is harvested for its diverse source of food, medicine, wood, and high-quality timber.<br><br>The tree’s physical characteristics include a straight, cylindrical trunk, a broad crown for good shade coverage, and large buttress roots. Its pinnately compound leaves that sheds seasonally, newly growth leaves appearing reddish or light green then matures into a dark, glossy green. The flowers are greenish-white, its fragrance can be unpleasant and the smell often attracts insects. Its fruit called sâu has a sour and slightly sweet taste, and contains 1-5 seeds.<br><br>Historically, Dao is an important resource in Southeast Asia, with its timber used, its fruits and leaves for culinary purposes, and its strong root system for soil conservation.",
        "notable_features": "The Dracontomelon dao tree is a large, evergreen tree (briefly deciduous when growing in the dry season), often reaching 45-55 meters  tall, with a straight cylindrical trunk usually a meter in diameter. The crown of the tree is broad and spreading, providing good shade coverage. The tree’s bark is a brownish-gray color, growing shallow fissures as it continues to mature. Bark is gray to dark brown in color, sometimes with a reddish tinge, and is rough, fissured, and scaly, especially in older trees. It is relatively thick. The roots are deep-rooted with strong lateral roots. Mature dao trees often develop large plank-like buttress roots at the base of the trunk. Flowers are a greenish to yellowish-white color, about 4-5mm across and occur in large, branched clusters called panicles up to 25cm long. They are radially symmetrical, with 5 petals often appearing to be bent backward. The fragrance of the flower is described as mild and sometimes unpleasant, often attracting insects. Flowers appear with new flushes of leaves, and are primarily pollinated by insects such as bees or flies. The fruit of the dao tree, called sâu, is a drupe-type fruit with a round shape, about 2-3cm in diameter. It is green when young and turns brownish-yellow as it ripens. The surface of the fruit is smooth, and its flesh is thin and juicy with a sour and slightly sweet taste. It has around 1-5 seeds per fruit, and is usually produced in bunches hanging from tree branch ends. A mature tree can bear hundreds of sâu per season. Leaves are pinnately compound with an alternate arrangement along its branches. There are usually around 5-7 leaflets per leaf, and the shape of the leaflet itself is elliptical  with a pointed tip, growing to around 7-15cm long and 3-6cm wide with a smooth margin. The surface of the leaf is a glossy dark green that becomes lighter the more you go down. The dao tree sheds its leaves seasonally, often during the dry season. Fresh leaves sprout after the tree begins flowering or with common rain patterns, often starting out a reddish or light green color before turning darker as it grows. The leaves form a spreading, umbrella-like crown as the canopy structure, providing dense shade.",
        "uses": "Dracontomelon dao is a multipurpose tree, usually known for its timber, due to its moderately hard texture. The wood is used for making furniture, plywood, and light construction, while the bark is for traditional medicinal uses, treating wounds and stomach issues. Meanwhile, its fruit is used as a souring agent in Filipino dishes such as sinigang, or is also eaten raw or made into jams and candies. The young leaves are also sometimes added into soups. The tree itself provides dense shade, a good addition to any park. oroadside. It is also usually planted for soil conservation and watershed protection because of its strong roots and buttresses.",
        "references": ["Dao, Dracontomelon dao (Blanco) Merr. & Rolfe, PACIFIC WALNUT, Ren mian zi: Philippine Medicinal Herbs  /  Alternative Medicine. (n.d.). https://www.stuartxchange.com/Dao.html", "Dracontomelon dao - Useful Tropical Plants. (n.d.). https://tropical.theferns.info/viewtropical.php?id=Dracontomelon+dao", "Dracontomelon dao (Argus pheasant tree) | CABI Compendium. (n.d.). CABI Compendium. https://www.cabidigitallibrary.org/doi/10.1079/cabicompendium.19767", "ERDB Knowledge Products. (n.d.). https://erdbservices.denr.gov.ph/eskris/iec_for_guest.php?operation=view&pk0=127", "ECHOcommunity. (n.d.). Dracontomelon dao. ECHO Asia Notes. https://www.echocommunity.org/en/resources/7dfbbe52-6384-4c94-a4e9-642427f728f0", "Flora of China Editorial Committee. (n.d.). Dracontomelon dao. In Flora of China. eFloras. http://www.efloras.org/florataxon.aspx?flora_id=2&taxon_id=200012506", "Madulid, D. A. (2011). Philippine native trees 101: Up close and personal. Green Convergence for Safe Food, Healthy Environment and Sustainable Economy, Inc.", "National Parks Board Singapore (NParks). (n.d.). Dracontomelon dao. Flora & Fauna Web. https://www.nparks.gov.sg/florafaunaweb/flora/3/2/3287", "NParks | Dracontomelon dao. (n.d.). https://www.nparks.gov.sg/florafaunaweb/flora/3/2/3287", "Papua New Guinea Plants Database. (n.d.). Dracontomelon dao Merr. & Rolfe. PNG Trees Key. https://www.pngplants.org/PNGtrees/TreeDescriptions/Dracontomelon_dao_Merr_%26_Rolfe.html", "PROSEA - Plant resources of South East Asia. (n.d.). https://prosea.prota4u.org/view.aspx?id=4205", "Royal Botanic Gardens, Kew. (n.d.). Dracontomelon dao (Blanco) Merr. & Rolfe. Plants of the World Online. https://powo.science.kew.org/taxon/urn:lsid:ipni.org:names:68524-1", "World Agroforestry Centre (ICRAF). (n.d.). Dracontomelon dao. Agroforestry Tree Database. https://apps.worldagroforestry.org/treedb2/speciesprofile.php?Spid=1792", "Useful Tropical Plants. (n.d.). Dracontomelon dao. Tropical Plants Database. https://tropical.theferns.info/viewtropical.php?id=Dracontomelon+dao"],
        "coordinates": "",
        "tree_code": "dao",
        "image": ""
    },

    {
        "common_name": "Dapdap",
        "scientific_name": "Erythrina variegata",
        "vernacular_names": ["Rarang(Bicol), Anii(Bisaya)"],
        "conservation_status": "Least Concern",
        "ancestry": {
            "kingdom": "Plantae",
            "clade": "Angiosperms",
            "order": "Fabales",
            "family": "Fabaceae",
            "genus": "Erythrina",
            "species": "E. variegata"
        },

        "description": "The Dapdap Tree, scientifically known as Erythrina variegata, is a species of the Fabaceae family. The tree is known by various names including Rarang(Bicol), and Anii(Bisaya). It is native to coastal forests in Southeast Asia and is also widespread in areas around the Indian Ocean. Dapdap trees can reach a height of up to 18 to 25 meters.",
        "notable_features": "The Dapdap Tree is a showy, spreading, and deciduous tree. It is shallow-rooted, with its roots developing only in the upper 30 cm of the soil. Its crown ranges from 6 to 12 meters in diameter. Its bark is grey or grey-green in color and furrowed. Its leaves are compound and trifoliate and can be . The flowers it produces are clustered in groups of three and are bright red in color. The fruits are cylindrical in shape and constricted around the seeds.",
        "uses": "The Dapdap Tree has various uses. It provides support and shade for various vine crops such as betel, pepper, vanilla, yam, and grape vines. The wood of the tree is utilized for making packing boxes, picture frames, and for pulp production . In Indonesia, the leaves and young sprouts of the tree are eaten as vegetables.",
        "references": ["“ACIR Community.” Usda.gov, 2025, acir.aphis.usda.gov/s/cird-taxon/a0u3d000000UP9LAAW/erythrina-variegata?fbclid=IwY2xjawNb55ZleHRuA2FlbQIxMQABHvv1mb2YFAmWvhmybwJAON14-HtX-TRAFLoZgwoihOrZ79T0MkBrXUxvr6L0_aem_-DVo23hT3z48GahL7R36Vw.", "Heuzé V., Thiollet H., Tran G., Edouard N., Lebas F., 2019. Coral tree (Erythrina variegata). Feedipedia, a programme by INRAE, CIRAD, AFZ and FAO. https://feedipedia.org/node/2308079-09-09-09-09-09-0"],
        "coordinates": "",
        "tree_code": "dapdap",
        "image": ""
    },

    {
        "common_name": "Banyan",
        "scientific_name": "Ficus benjamin",
        "vernacular_names": ["Lunok (Negros Oriental),  Dalakit (Visayas), Nonok (Samar-Leyte), Diyakel (Surigao del Sur), Salisi (Tagalog), Banyan Tree"],
        "conservation_status": "Least Concern",
        "ancestry": {
            "kingdom": "Plantae",
            "clade": "Angiosperms, Eudicots, Rosids",
            "order": "Rosales",
            "family": "Moraceae",
            "genus": "Ficus",
            "species": "F. Benjamina"
        },

        "description": "Toona calantas, also known as kalantas or Philippine mahogany, is a large & fast-growing deciduous tree of the Meliaceae family native to Southeast Asia, particularly the Philippines, Thailand, and Indonesia. The tree itself can reach up to 25 meters tall with its straight and branchless trunk growing up to 20 meters long. It is known for its high-quality timber used in furniture, musical instruments and plywood, as well as its ecological importance for providing food and habitats for native wildlife and stabilizing soil with its deep roots.<br><br>Its straight and terete (cylindrical) trunk has a near diameter of around 100 - 150 centimeters, with the leaves of the tree compound and alternate oblong, having entire leaflets. The mahogany’s fruit is shaped like a large capsule that dehisces at the apex, with unequally winged seeds. Its lumber is a reddish-brown color, becoming pale red when it is sapped.",
        "notable_features": "The Toona calantas is known for its strikingly unique red color among timbers, which is what led to its classification as “Vulnerable” due to mass deforestation for material collection due to its wide usage in the creation of musical instruments, furniture, joinery, and even carving applications, as well as its excellent capabilities as firewood. The texture of the bark is smooth when the tree is still young, becoming more complex as it matures, shedding thin, flaky patches or woody scales.<br><br>The flowering of the tree occurs from June to August, while fruiting occurs from September to November. The tree exudes a strong, lasting sour odor similar to that of Spanish cedar. The flowers of Calantas are small and white, with the fruit following in around a month after. The fruit is a capsule, around 3-4 centimeters long, with a dark-red to red-brown color. It is smooth to the touch and contains numerous lenticels (small dots) on the surface of the fruit. Meanwhile, the leaves of the tree are oddly pinnate compound leaves with around 10-20 smooth oblong leaflets around 12 centimeters long and 5 centimeters wide.<br><br>The Toona calantas is primarily found in primary forests at low to medium altitudes in the Philippines, hence the name, but can also be found in other parts of Southeast Asia. It is particularly seen abundant in the Balabac group of islands (Palawan Province).",
        "uses": "Toona calantas is known for its astringent and antiseptic properties for its bark, a decoction sometimes being used as a local remedy for cleansing wounds. A particular instance is its powdered bark being dusted over gangrenous ulcers. The flowers are also sometimes used in traditional medicine due to their antispasmodic properties. The wood contains around 0.3 - 1.2% essential oil, contributing to its strong odor that is used to create commercial essential oils.",
        "references": ["Flora Malesiana. (n.d.). Toona calantas. Retrieved October 6, 2025, from https://portal.cybertaxonomy.org/flora-malesiana/cdm_dataportal/taxon/2af2ed17-8983-4d22-a385-a0207419fec0", "iNaturalist. (n.d.). Toona calantas. Retrieved October 6, 2025, from https://www.inaturalist.org/taxa/444363-Toona-calantas", "PROSEA - Plant Resources of South East Asia. (n.d.). Toona calantas. Retrieved October 6, 2025, from https://prosea.prota4u.org/view.aspx?id=4736", "Useful Tropical Plants. (n.d.). Toona calantas. Retrieved October 6, 2025, from https://tropical.theferns.info/viewtropical.php?id=Toona+calantas", "Wikipedia contributors. (2025, October 5). Toona calantas. Wikipedia. https://en.wikipedia.org/wiki/Toona_calantas?utm_source=chatgpt.com"],
        "coordinates": "",
        "tree_code": "banyan_tree",
        "image": ""
    },

    {
        "common_name": "Tabgun",
        "scientific_name": "Ficus ruficaulis Merr",
        "vernacular_names": ["Tabgun (Bikolano), Ruficaulis Fig (English) "],
        "conservation_status": "Least Concern",
        "ancestry": {
            "kingdom": "Plantae",
            "clade": "Tracheophytes, Angiosperms, Eudicots, Rosids",
            "order": "Rosales",
            "family": "Moraceae",
            "genus": "Artocarpus",
            "species": "A. sericicarpus"
        },

        "description": "Ficus ruficaulis Merr., also referred to as Tabgun Tree, is a tropical evergreen tree native to the Philippines, Sulawesi, and Taiwan, belonging to the family Moraceae. It grows over 10 meters or more with fleshy, elliptical leaves or ovate leaves, and specialized bark roots. It produces small, concealed flowers and thrives in wet tropical environments. Its bark, leaves, fruits, and roots are used for medicinal purposes and contribute by providing shade and habitat for wildlife.",
        "notable_features": "The Tabgun Tree, scientifically  known as Ficus ruficaulis Merr., is a member of the  family Moraceae. Its complete taxonomic classification includes Kingdom Plantae, Division Magnoliophyta, Class Magnoliopsida, Order Rosales, Family Moraceae, Genus Ficus,  and Species Ficus ruficaulis Merr. The tree is known by its vernacular names “Tabgun” or “Tagbun” in Filipino. It is native to tropical Asian islands, specifically the  Philippines, Sulawesi, and Taiwan, and is a part of the diverse Ficus genus. It has a number of synonyms describing its taxonomic history ancestry, including as Ficus antaoensis and Ficus gerontocarpa. Similar to other native Philippine tree species, it potentially faces risks from habitat destruction and deforestation.<br><br>The Tabgun Tree  grows up to 10 meters or more, as observed  in other related species. It has a unique appearance characterized by fleshy leaves and large root systems developed as bark roots to provide support. The leaves show growing patterns of elliptical or ovate shapes that are usually evergreen in nature. The tree produces small flowers that are usually concealed inside a structure. Its canopy is supported by its stem and can have specialized bark roots that help in nutrient absorption and stability. The bark and leaves are sometimes used for gastrointestinal problems, while fruits and roots are used in traditional medical purposes. The tree holds historical significance in the Philippines where it supports local biodiversity and cultural practices.<br><br>Tagbun tree provides plenty of cultural history through oral traditions. In some Bicol communities, old Tabgun trees are home to forest ghosts known as \"engkantos\".  Individuals would generally avoid cutting down trees without deliberately praying as a show of respect.  Tagbun Tree is unique because of its adaptation to tropical wet environments and close relationship with local animals. It is a long-lived tree that can exist for many years while still contributing significantly to the stability and diversity of its ecosystems. Related species, such as Tabon-Tabon in the Philippines, are well-known for their use in indigenous Filipino cuisine, particularly the making of kinilaw. The tree was also found to have medicinal properties, such as antibacterial and antioxidant activity.",
        "uses": "The Tagbun Tree gives multiple practical benefits in antibacterial and antioxidant properties and to treat gastrointestinal problems. Its wood can also be used for local construction and can help stabilize soils. It is a long-lived tree that plays an important role in providing a habitat for wildlife and contributing to the stability of an ecosystem.",
        "references": ["Ficus ruficaulis Merr. | Plants of the World Online | Kew Science. (n.d.). Plants of the World Online. https://powo.science.kew.org/taxon/urn:lsid:ipni.org:names:853620-1", "All Asia TCN - Ficus ruficaulis. (n.d.). https://allasiatcn.org/taxa/index.php?tid=19665", "Moraceae. (n.d.). https://philippineplants.org/Families/Moraceae.html", "Tabon-Tabon - Arca del Gusto - Slow Food Foundation. (2018, December 8). Slow Food Foundation.https://www.fondazioneslowfood.com/en/ark-of-taste-slow-food/tabon-tabon/", "Tabon-tabon / Atuna excelsa / IFIFI / Pipi tree / Merbatu/  Alternative Medicine. (n.d.). https://www.stuartxchange.org/TabonTabon"],
        "coordinates": "",
        "tree_code": "tabgun",
        "image": ""
    },
    {
        "common_name": "Tangisang-Bayawak",
        "scientific_name": "Ficus variegata",
        "vernacular_names": ["Tangisang-Bayawak(Tagalog),  Tabgon(Bikolano), Lapting(Ilokano), Tubol(Pangasinense), Variegated fig(English), Variegated fig(English)"],
        "conservation_status": "Endangered",
        "ancestry": {
            "kingdom": "Plantae",
            "clade": "Eudicots, Rosids",
            "order": "Rosales",
            "family": "Moraceae",
            "genus": "Ficus",
            "species": "F. variegata"
        },

        "description": "Ficus variegata, commonly known as Tangisang-Bayawak,is a medium to large sized tall tropical tree. It is related to figs which are commonly seen as ornamental plants yet grow taller than most of the figs that can reach 15 to 30 meters in height. It is commonly used for herbal medicine and for its wood.<br><br>The tree's appearance includes a straight trunk, smooth and grayish bark where its flowers and fruits grow at the side instead of the branches like most trees. It also has very large buttress roots that support the tree in a wide area. Its leaves grow in an alternately spiral pattern with its appearance that is very leathery and glossy about 10–25 cm long, bright green on top and lighter beneath.. Its flowers are round in shape and green in color and only open when it is ready for reproduction. The tree produces cauliflorous fruits—figs that grow on the trunk and larger branches. These figs are red to reddish-green when ripe, about 2–3 cm in diameter, and are eaten by many forest animals.<br><br>Historically, Tangisang-Bayawak was used for medicinal purposes due to its anti-bacterial and antioxidant properties and still used up until now, specially in boils.",
        "notable_features": "The Tangisang-Bayawak is very tall and large with a very smooth trunk, usually growing up to 30 meters in length and more than a meter in diameter. At its base, it has large buttress roots that covers a wide range of areas. Its trunk is very long and straight with its bark being whitish in color and very smooth unlike most trees in a tropical forest. This tree is very unique as its flowers and fruits mostly grow at the sides of the trunk instead of the branches. Its flowers are green in color and round in shape which resembles more of a fruit than a flower (which is called a fig fruit), it grows about 1-3.5 centimeters in diameter and is pollinated by a different type of wasp called fig wasps. After pollination, the fig fruit turns into a reddish color and produces approximately 1300 seeds in one fruit. The taste of the fruit is very bland yet is eaten raw or cooked in parts in Java in Indonesia. The leaves grow alternately spiral in pattern and but the leaf itself is elliptical in shape and is 10-17 centimeters long and has a heart shaped tip, it is green in color and very glossy and leathery when touched.<br><br>A medium to large tropical fig tree that can grow up to 30 meters tall with a straight, sturdy trunk and sometimes buttress roots for support. Its bark is smooth and grayish-brown, occasionally with pale markings, and exudes milky latex when cut. (Monaco Nature Encyclopedia, 2022).<br><br>The leaves are simple, alternate, and oblong to elliptic, about 10–25 cm long. They are bright green on top and paler underneath, giving the canopy a lush appearance. The leaves are deciduous or semi-deciduous—trees that shed all their leaves once a year, briefly shedding during dry seasons.<br><br>One of its most distinctive features is its cauliflorous fruiting habit—the figs grow directly on the trunk and large branches. The fruits are round to pear-shaped, about 2–3 cm in diameter, and turn red or orange-red when ripe. These fruits attract birds, bats, and monkeys, making the tree an important keystone species in forest ecosystems.<br><br>The wood is lightweight but durable, and while not considered high-grade timber, it is used for furniture framing, crates, and general construction.",
        "uses": "Tangisang-Bayawak is known for its medicinal purposes, especially its barks and leaves. Its bark can be used for antioxidants and its leaves, bark, and fruits can be used for its antibacterial properties. Its wood is low quality compared to other trees so it is only used for temporary constructions, moldings, drawers, crates, and knife sheaths. Its wax is used in Batik works.",
        "references": ["Philippine medicinal plants. (n.d.). Stuartxchange. https://www.stuartxchange.org/Agi.html", "Makiling. (2018, November 15). Tangisang bayawak: MBG Plant of the Month for November 2018. An ASEAN Heritage Park. https://makiling.center/tangisang-bayawak-mbg-plant-of-the-month-for-november-2018/", "Mazza, G. (2018, January 28). Ficus variegata - Monaco Nature Encyclopedia. Monaco Nature Encyclopedia. https://www.monaconatureencyclopedia.com/ficus-variegata-2/?lang=en", "Monaco Nature Encyclopedia (2022). Ficus variegata Blume. https://www.monaconatureencyclopedia.com/ficus-variegata-2", "Tropical Plants Database (2023). Ficus variegata. https://tropical.theferns.info/viewtropical.php?id=Ficus+variegata"],
        "coordinates": "",
        "tree_code": "tangisang_bayawak",
        "image": "/images/tree/tangisang-bayawak.jpg"
    },
    {
        "common_name": "Chisa, Canistel, Eggfruit",
        "scientific_name": "Lacuma campechiana",
        "vernacular_names": ["Chesa, Atiesa, Tiesa, Canistel, Eggfruit"],
        "conservation_status": "Least Concern",
        "ancestry": {
            "kingdom": "Plantae",
            "clade": "Tracheophytes, Angiosperms, Eudicots, Asterids",
            "order": "Ericales",
            "family": "Sapotaceae",
            "genus": "Lucuma",
            "species": "L. campechiana"
        },

        "description": "Lacuma campechiana, commonly known as Chisa, is an evergreen tree in the family Sapotaceae. It typically grows to about 10-15 m tall in its native habitat, though under favorable conditions it can reach greater heights. It has glossy green leaves clustered at the tips of its branches. The tree produces cream colored flowers that later develop into smooth, yellow to orange, sweet fruit.",
        "notable_features": "Chisa can be easily identified by its golden-yellow fruit and unique egg-like texture, which distinguishes it from other tropical fruits. It is rich in vitamin A, vitamin C, and several B vitamins. The fruit also provides dietary fiber and minerals like calcium and phosphorus. Its adaptability allows it to thrive in various tropical and subtropical regions, even in poor soils, making it a resilient and easy to grow tree.",
        "uses": "Chisa fruits are commonly eaten fresh or used in desserts such as custards, ice cream, jams, and smoothies. In the Philippines, it is often turned into candies or added to local delicacies like polvuron. Its bark and seeds have been used in traditional remedies for fever, skin conditions, and ulcers. Studies have also found that chisa fruit extracts possess antioxidant and liver protective properties. The tree’s wood is sometimes used in construction, and it also serves as an ornamental plant.",
        "fun_fact": "The fruit’s yolk-like flesh earned it the nickname “eggfruit” and in the Philippines it is known as chesa or tiesa. The name “campechiana” comes from Campeche, a region in Mexico where the species was first described. The latex from the tree has been used to mix with chicle, the natural base for chewing gum.",
        "references": ["Wikipedia contributors. (2025, October 2). Lucuma campechiana. Wikipedia. https://en.wikipedia.org/wiki/Lucuma_campechiana", "Llc, T. T. (2022, October 20). Pouteria campechiana- Canistel, the curious heart-shaped Egg Super-Fruit. Top Tropicals. https://toptropicals.com/html/toptropicals/articles/fruit/Pouteria-campechiana-canistel.htm?srsltid=AfmBOooYfByb2VsY-ahEDwA_6knwe0p53Q4RtD2iubIeO95bNdBkI6EA", "The Editors of Encyclopaedia Britannica. (1998, July 20). Canistel | Description, range, & Facts. Encyclopedia Britannica. https://www.britannica.com/plant/canistel"],
        "coordinates": "",
        "tree_code": "chisa",
        "image": ""
    },

    {
        "common_name": "Dao",
        "scientific_name": "Dracontomelon Dao",
        "vernacular_names": ["Dao, New Guinea walnut. Papua New Guinea walnut, Pacific walnut"],
        "conservation_status": "Least Concern",
        "ancestry": {
            "kingdom": "Plantae",
            "clade": "Tracheophytes, Angiosperms, Eudicots, Rosids",
            "order": "Sapindales",
            "family": "Anacardiaceae",
            "genus": "Dracontomelon",
            "species": "D. dao"
        },

        "description": "Dracontomelon dao commonly known as Dao, a large, tropical evergreen tree species of the Anacardiaceae family. The tree is known by a variety of names including Argus Pheasant Tree, New Guinea Walnut, Papuan Walnut. It is native to an extensive range across Southeast Asia and the Pacific, including countries like the Philippines, Thailand, South China, Cambodia, Vietnam, New Guinea, Myanmar, Laos and many more. Dao is distinguished by its height, oftenheight, often growing up to 45-55 meters tall but can still grow larger. It is harvested for its diverse source of food, medicine, wood, and high-quality timber. The tree’s physical characteristics include a straight, cylindrical trunk, a broad crown for good shade coverage, and large buttress roots. Its pinnately compound leaves that sheds seasonally, newly growth leaves appearing reddish or light green then matures into a dark, glossy green. The flowers are greenish-white, its fragrance can be unpleasant and the smell often attracts insects. Its fruit called sâu has a sour and slightly sweet taste, and contains 1-5 seeds. Historically, Dao is an important resource in Southeast Asia, with its timber used, its fruits and leaves for culinary purposes, and its strong root system for soil conservation.",
        "notable_features": "The Dracontomelon dao tree is a large, evergreen tree (briefly deciduous when growing in the dry season), often reaching 45-55 meters  tall, with a straight cylindrical trunk usually a meter in diameter. The crown of the tree is broad and spreading, providing good shade coverage. The tree’s bark is a brownish-gray color, growing shallow fissures as it continues to mature. Bark is gray to dark brown in color, sometimes with a reddish tinge, and is rough, fissured, and scaly, especially in older trees. It is relatively thick. The roots are deep-rooted with strong lateral roots. Mature dao trees often develop large plank-like buttress roots at the base of the trunk. Flowers are a greenish to yellowish-white color, about 4-5mm across and occur in large, branched clusters called panicles up to 25cm long. They are radially symmetrical, with 5 petals often appearing to be bent backward. The fragrance of the flower is described as mild and sometimes unpleasant, often attracting insects. Flowers appear with new flushes of leaves, and are primarily pollinated by insects such as bees or flies. The fruit of the dao tree, called sâu, is a drupe-type fruit with a round shape, about 2-3cm in diameter. It is green when young and turns brownish-yellow as it ripens. The surface of the fruit is smooth, and its flesh is thin and juicy with a sour and slightly sweet taste. It has around 1-5 seeds per fruit, and is usually produced in bunches hanging from tree branch ends. A mature tree can bear hundreds of sâu per season. Leaves are pinnately compound with an alternate arrangement along its branches. There are usually around 5-7 leaflets per leaf, and the shape of the leaflet itself is elliptical  with a pointed tip, growing to around 7-15cm long and 3-6cm wide with a smooth margin. The surface of the leaf is a glossy dark green that becomes lighter the more you go down. The dao tree sheds its leaves seasonally, often during the dry season. Fresh leaves sprout after the tree begins flowering or with common rain patterns, often starting out a reddish or light green color before turning darker as it grows. The leaves form a spreading, umbrella-like crown as the canopy structure, providing dense shade.",
        "uses": "Dracontomelon dao is a multipurpose tree, usually known for its timber, due to its moderately hard texture. The wood is used for making furniture, plywood, and light construction, while the bark is for traditional medicinal uses, treating wounds and stomach issues. Meanwhile, its fruit is used as a souring agent in Filipino dishes such as sinigang, or is also eaten raw or made into jams and candies. The young leaves are also sometimes added into soups. The tree itself provides dense shade, a good addition to any park. oroadside. It is also usually planted for soil conservation and watershed protection because of its strong roots and buttresses.",
        "references": ["Dao, Dracontomelon dao (Blanco) Merr. & Rolfe, PACIFIC WALNUT, Ren mian zi: Philippine Medicinal Herbs  /  Alternative Medicine. (n.d.). https://www.stuartxchange.com/Dao.html", "Dracontomelon dao - Useful Tropical Plants. (n.d.). https://tropical.theferns.info/viewtropical.php?id=Dracontomelon+dao", "Dracontomelon dao (Argus pheasant tree) | CABI Compendium. (n.d.). CABI Compendium. https://www.cabidigitallibrary.org/doi/10.1079/cabicompendium.19767", "ERDB Knowledge Products. (n.d.). https://erdbservices.denr.gov.ph/eskris/iec_for_guest.php?operation=view&pk0=127", "ECHOcommunity. (n.d.). Dracontomelon dao. ECHO Asia Notes. https://www.echocommunity.org/en/resources/7dfbbe52-6384-4c94-a4e9-642427f728f0", "Flora of China Editorial Committee. (n.d.). Dracontomelon dao. In Flora of China. eFloras. http://www.efloras.org/florataxon.aspx?flora_id=2&taxon_id=200012506", "Madulid, D. A. (2011). Philippine native trees 101: Up close and personal. Green Convergence for Safe Food, Healthy Environment and Sustainable Economy, Inc.", "National Parks Board Singapore (NParks). (n.d.). Dracontomelon dao. Flora & Fauna Web. https://www.nparks.gov.sg/florafaunaweb/flora/3/2/3287", "Papua New Guinea Plants Database. (n.d.). Dracontomelon dao Merr. & Rolfe. PNG Trees Key. https://www.pngplants.org/PNGtrees/TreeDescriptions/Dracontomelon_dao_Merr_%26_Rolfe.html", "PROSEA - Plant resources of South East Asia. (n.d.). https://prosea.prota4u.org/view.aspx?id=4205", "Royal Botanic Gardens, Kew. (n.d.). Dracontomelon dao (Blanco) Merr. & Rolfe. Plants of the World Online. https://powo.science.kew.org/taxon/urn:lsid:ipni.org:names:68524-1", "World Agroforestry Centre (ICRAF). (n.d.). Dracontomelon dao. Agroforestry Tree Database. https://apps.worldagroforestry.org/treedb2/speciesprofile.php?Spid=1792", "Useful Tropical Plants. (n.d.). Dracontomelon dao. Tropical Plants Database. https://tropical.theferns.info/viewtropical.php?id=Dracontomelon+dao"],
        "coordinates": "",
        "tree_code": "dao",
        "image": "/images/tree/dao.jpg"
    },

    {
        "common_name": "Dapdap",
        "scientific_name": "Erythrina variegata",
        "vernacular_names": ["Rarang(Bicol), Anii(Bisaya)"],
        "conservation_status": "Least Concern",
        "ancestry": {
            "kingdom": "Plantae",
            "clade": "Angiosperms",
            "order": "Fabales",
            "family": "Fabaceae",
            "genus": "Erythrina",
            "species": "E. variegata"
        },

        "description": "The Dapdap Tree, scientifically known as Erythrina variegata, is a species of the Fabaceae family. The tree is known by various names including Rarang(Bicol), and Anii(Bisaya). It is native to coastal forests in Southeast Asia and is also widespread in areas around the Indian Ocean. Dapdap trees can reach a height of up to 18 to 25 meters. ",
        "notable_features": "The Dapdap Tree is a showy, spreading, and deciduous tree. It is shallow-rooted, with its roots developing only in the upper 30 cm of the soil. Its crown ranges from 6 to 12 meters in diameter. Its bark is grey or grey-green in color and furrowed. Its leaves are compound and trifoliate and can be . The flowers it produces are clustered in groups of three and are bright red in color. The fruits are cylindrical in shape and constricted around the seeds.",
        "uses": "The Dapdap Tree has various uses. It provides support and shade for various vine crops such as betel, pepper, vanilla, yam, and grape vines. The wood of the tree is utilized for making packing boxes, picture frames, and for pulp production . In Indonesia, the leaves and young sprouts of the tree are eaten as vegetables.",
        "references": ["“ACIR Community.” Usda.gov, 2025, acir.aphis.usda.gov/s/cird-taxon/a0u3d000000UP9LAAW/erythrina-variegata?fbclid=IwY2xjawNb55ZleHRuA2FlbQIxMQABHvv1mb2YFAmWvhmybwJAON14-HtX-TRAFLoZgwoihOrZ79T0MkBrXUxvr6L0_aem_-DVo23hT3z48GahL7R36Vw.", "Heuzé V., Thiollet H., Tran G., Edouard N., Lebas F., 2019. Coral tree (Erythrina variegata). Feedipedia, a programme by INRAE, CIRAD, AFZ and FAO. https://feedipedia.org/node/2308079-09-09-09-09-09-0"],
        "coordinates": "",
        "tree_code": "dapdap",
        "image": ""
    },

    {
        "common_name": "Balete",
        "scientific_name": "Ficus Benjamin",
        "vernacular_names": ["Lunok (Negros Oriental),  Dalakit (Visayas), Nonok (Samar-Leyte), Diyakel (Surigao del Sur), Salisi (Tagalog), Banyan Tree"],
        "conservation_status": "Least Concern",
        "ancestry": {
            "kingdom": "Plantae",
            "clade": "Angiosperms, Eudicots, Rosids",
            "order": "Rosales",
            "family": "Moraceae",
            "genus": "Ficus",
            "species": "F. Benjamina"
        },

        "description": "Toona calantas, also known as kalantas or Philippine mahogany, is a large & fast-growing deciduous tree of the Meliaceae family native to Southeast Asia, particularly the Philippines, Thailand, and Indonesia. The tree itself can reach up to 25 meters tall with its straight and branchless trunk growing up to 20 meters long. It is known for its high-quality timber used in furniture, musical instruments and plywood, as well as its ecological importance for providing food and habitats for native wildlife and stabilizing soil with its deep roots. Its straight and terete (cylindrical) trunk has a near diameter of around 100 - 150 centimeters, with the leaves of the tree compound and alternate oblong, having entire leaflets. The mahogany’s fruit is shaped like a large capsule that dehisces at the apex, with unequally winged seeds. Its lumber is a reddish-brown color, becoming pale red when it is sapped.",
        "notable_features": "The Toona calantas is known for its strikingly unique red color among timbers, which is what led to its classification as “Vulnerable” due to mass deforestation for material collection due to its wide usage in the creation of musical instruments, furniture, joinery, and even carving applications, as well as its excellent capabilities as firewood. The texture of the bark is smooth when the tree is still young, becoming more complex as it matures, shedding thin, flaky patches or woody scales. The flowering of the tree occurs from June to August, while fruiting occurs from September to November. The tree exudes a strong, lasting sour odor similar to that of Spanish cedar. The flowers of Calantas are small and white, with the fruit following in around a month after. The fruit is a capsule, around 3-4 centimeters long, with a dark-red to red-brown color. It is smooth to the touch and contains numerous lenticels (small dots) on the surface of the fruit. Meanwhile, the leaves of the tree are oddly pinnate compound leaves with around 10-20 smooth oblong leaflets around 12 centimeters long and 5 centimeters wide. The Toona calantas is primarily found in primary forests at low to medium altitudes in the Philippines, hence the name, but can also be found in other parts of Southeast Asia. It is particularly seen abundant in the Balabac group of islands (Palawan Province).",
        "uses": "Toona calantas is known for its astringent and antiseptic properties for its bark, a decoction sometimes being used as a local remedy for cleansing wounds. A particular instance is its powdered bark being dusted over gangrenous ulcers. The flowers are also sometimes used in traditional medicine due to their antispasmodic properties. The wood contains around 0.3 - 1.2% essential oil, contributing to its strong odor that is used to create commercial essential oils.",
        "references": ["Flora Malesiana. (n.d.). Toona calantas. Retrieved October 6, 2025, from https://portal.cybertaxonomy.org/flora-malesiana/cdm_dataportal/taxon/2af2ed17-8983-4d22-a385-a0207419fec0", "iNaturalist. (n.d.). Toona calantas. Retrieved October 6, 2025, from https://www.inaturalist.org/taxa/444363-Toona-calantas", "PROSEA - Plant Resources of South East Asia. (n.d.). Toona calantas. Retrieved October 6, 2025, from https://prosea.prota4u.org/view.aspx?id=4736", "Useful Tropical Plants. (n.d.). Toona calantas. Retrieved October 6, 2025, from https://tropical.theferns.info/viewtropical.php?id=Toona+calantas", "Wikipedia contributors. (2025, October 5). Toona calantas. Wikipedia. https://en.wikipedia.org/wiki/Toona_calantas?utm_source=chatgpt.com"],
        "coordinates": "",
        "tree_code": "balete",
        "image": "/images/tree/balete.jpg"
    },

    {
        "common_name": "Binunga",
        "scientific_name": "Macaranga tanarius",
        "vernacular_names": ["Himindang (Bicol)", "Kuyonon (Bisaya)"],
        "conservation_status": "Least Concern",
        "ancestry": {
            "kingdom": "Plantae",
            "clade": "Rosids",
            "order": "Euphorbiales",
            "family": "Euphorbiaceae",
            "genus": "Macaranga",
            "species": "M. tanarius"
        },
        "description": "The Binunga Tree, scientifically known as Macaranga tanarius, is a species of the Euphorbiaceae family. The tree is known by various names including Himindang (Bicol), and Kuyonon (Bisaya). It is native to the Philippines, Andaman Islands, Thailand, Myanmar, New South Wales, and etc. The Binunga is a small, dioecious tree, which can grow up to a height of 4 to 8 meters tall. Its leaves are large and round with an alternate leaf pattern.",
        "notable_features": "Its bark is rather smooth, strips off easily, and is gray-brown in color. The inner bark of the tree is yellowish-white and excretes a colorless liquid. Its fruit is small, and capsule-like, which can grow 10 to 12 millimeters in diameter. These fruits grow in dense, spherical clusters and are covered in soft prickles. The trees’ crown is thick, dome-shaped and with many slender branches. The flowers of this tree are small and can be yellow or orange in color. The Binunga has been recommended as a pioneer species to provide shade and shelter in order to promote natural regeneration on deforested land.",
        "uses": "The Binunga Tree has various uses in different aspects. It is used in traditional medicine such as a root-bark extract from the tree used to treat diarrhea, dysentery, and fever. Its bark and leaves are also utilized in our country to prepare a fermented drink “basi”, an Ilocano beverage which is made from sugarcane. The bark of the tree also contains tannin, used to toughen fishing nets. The wood of the tree is also a favorite material for making wooden shoes.",
        "references": ["Fern, Ken. “Macaranga Tanarius - Useful Tropical Plants.” Theferns.info, 2019, tropical.theferns.viewtropical.php?id=Macaranga+tanarius&fbclid=IwY2xjawNbzSdleHRuA2FlbQIxMQABHqSnIltP5kc8jb7Y84TECBmcgNMxTH2wHl8ZRVuDYNl89cruTh4D4GNXRcyF_aem_Gln_HmxmZs4punk5GOt9ZQ ", " Orwa C, Mutua A, Kindt R, Jamnadass R, Simons A. 2009. Agroforestree Database: a tree reference and selection guide version 4.0. World Agroforestry Centre, Kenya. https://www.worldagroforestry.org/output/agroforestree-database ", " Quiroz, Diana. “Macaranga Tanarius (Parasol Leaf Tree).” Macaranga Tanarius (Parasol Leaf Tree), 19 Feb. 2018,  www.researchgate.net/publication/323258064_Macaranga_tanarius_parasol_leaf_tree, https://doi.org/10.13140/RG.2.2.18457.72804. ", " “Tree of the Month (Part 1): BINUNGA (Macaranga Tanarius).” Philstar.com, The Freeman, 21 Apr. 2013,www.philstar.com/the-freeman/cebu-news/2013/04/22/933570/tree-month-part-1-binunga-macaranga-tanarius?fbclid=IwY2xjawNbzSVleHRuA2FlbQIxMQABHsvrjfDqyUScWKSDlF_4yeT0rXuUL_0stPvMV6cxdtQUlNfCb2rZbxCy4Noh_aem_8fzCcr6GTiyISR_na7MgHA."],
        "coordinates": "",
        "tree_code": "binunga",
        "image": ""
    },
    {
        "common_name": "Mango",
        "scientific_name": "Mangifera indica",
        "vernacular_names": ["Mangga (Filipino)", "Paho (Bisaya)", "Mango (Ilokano)", "Mango"],
        "conservation_status": "Least Concern",
        "ancestry": {
            "kingdom": "Plantae",
            "clade": "Tracheophytes, Angiosperms, Eudicots, Rosids",
            "order": "Sapindales",
            "family": "Anacardiaceae",
            "genus": "Mangifera",
            "species": "M. indica"
        },
        "description": "Mangifera indica L., known commonly as Mango, an evergreen tree species of the Anacardiaceae family. Originating in Southeast Asia and India, and considered native in Southern Asia, it usually reaches a height of 15-18 meters tall, but it has a possibility to grow taller. Parts of the tree that are harvested are the fruit for its flesh and seeds, the wood for the purpose of furniture and musical instruments, the leaves for medicinal purposes, and the bark for dye. The tree has a rounded and symmetrical canopy with a thick and smooth trunk and deep, wide-spreading roots springing from its trunk. The leaves are long and pointed at both ends, along with small yellowish or white flowers. Lastly, the fruit has a variety of shapes, ranging from round, kidney-shaped, or long and slender.",
        "notable_features": "The Mangifera indica L. tree has greyish-brown colored trunks, being thick in diameter, while its bark is smooth in texture, peeling off in irregular and thick pieces. The roots are formed at the base of the trunk and have a deep depth. Its leaves are dark green, simple, and in shapes like oblong, oval-lanceolate, or etc. The length can range from 12-45 centimeters and are borne in clusters. Flowers are small and fragrant, with colors of yellowish and white, grouped into clusters. Its fruit has variation with the size, having forms such as oval, round, heart-shaped, kidney-shaped, or long and slender. They have greenish yellow color for the outer skin, while their insides have a bright orange-yellow sweet and juicy flesh along with a large pit in the middle.",
        "uses": "Mangoes are primarily enjoyed for their juicy fruit, which is used fresh in juices, smoothies, cooking, and desserts. The wood of the mango tree is used for making furniture and carvings, while the leaves have medicinal uses for treating conditions like diabetes and digestive issues. Mango seed oil is valued in skincare for its moisturizing properties, and mango butter, extracted from the seed, is a common ingredient in lotions.",
        "references": ["Philippine Flora. (2009, September 2). Malapapaya. Retrieved from https://philippineflora.wordpress.com/2009/09/02/malapapaya/ ", " StuartXchange. (n.d.). Malapapaya, Polyscias nodosa / Alternative Medicine. Retrieved from https://www.stuartxchange.org/Malapapaya ", " Boer, E. & Sosef, M. S. M. (1998). Polyscias J.R. Forster & J.G. Forster. In Sosef, M.S.M., Hong, L.T., & Prawirohatmodjo, S. (Eds.), Plant Resources of South-East Asia No 5(3): Timber trees; Lesser-known timbers. PROSEA. Retrieved from ", " https://prosea.prota4u.org/view.aspx?id=6132"],
        "coordinates": "",
        "tree_code": "mango",
        "image": "/images/tree/mangga.jpg"
    },
    {
        "common_name": "Chico / Sapodilla",
        "scientific_name": "Manilkara zapota",
        "vernacular_names": ["Chico", "Sapodilla", "Soapapple", "Chicozapote"],
        "conservation_status": "Not threatened",
        "ancestry": {
            "kingdom": "Plantae",
            "clade": "Tracheophytes, Angiosperms, Eudicots, Asterids",
            "order": "Ericales",
            "family": "Sapotaceae",
            "genus": "Manilkara",
            "species": "M. zapota"
        },
        "description": "Manilkara zapota, more commonly known as Chico or Sapodilla, is an evergreen tree which is native to Southern Mexico, Central America, and the Caribbean. This tree can also be found in tropical and subtropical regions all around the world, especially in Asia. The Manilkara zapota was first introduced in the Philippines during the Spanish colonization period through various resource exchanges like the Galleon trade. Its epithet zapota was derived from the Spanish word “zapote” which alludes to the tree’s soft fruit.",
        "notable_features": "The Manilkara zapota is a medium-sized tree, having a sturdy and reddish trunk which is able to grow up to more than 30 meters tall with a diameter of 1.5 meters. The bark of the tree contains a white latex also known as chicle, this was used as an important component of gum. The leaves are elliptic and ovate in shape, and are arranged alternately. It also has a light green color with a glossy appearance. The leaves of this tree have a length of about 5 - 12.5 cm. The tree also bears small, unnoticeable bell-shaped flowers with a light cream color. The fruit it bears has a spheroid shape and is rusty brown in color. It has a diameter roughly around 5 - 10 cm. Inside it contains a translucent, yellowish, and juicy flesh. The fruit is usually eaten fresh and its taste is often described to have a sweet flavor, usually alluded to as a pear combined with brown sugar. The fruit also contains 2 - 5 seeds that are glossy, black, and have a size identical to beans.",
        "uses": "The Manilkara zapota was mainly used as building materials for various structures like posts, rafts, and it was also utilized in the creation of Maya Temples back in the day. Its chicle is a milky latex which was a prominent ingredient for gum. The chicle itself was also used as chewing gum by the Aztecs. It was believed that by chewing chicle, it was able to quench one’s thirst and was an accompaniment to meals. In various research studies, its fruit poses many health-benefits as it contains bioactive compounds with antioxidants, anti-inflammatory, and other properties that are able to fight off diseases. The Manilkara zapota can also be used in various chemicals such as pesticides.",
        "references": ["Wikipedia contributors. (2025, October 4). Manilkara zapota. Wikipedia. https://en.m.wikipedia.org/wiki/Manilkara_zapota ", " The Editors of Encyclopaedia Britannica. (1998, July 20). Sapodilla | Description, Distribution, & Facts. Encyclopedia Britannica. https://www.britannica.com/plant/sapodilla ", " Rivas-Gastelum, M. F., Garcia-Amezquita, L. E., Garcia-Varela, R., & Sánchez-López, A. L. (2023). Manilkara zapota “chicozapote” as a fruit source of health-beneficial bioactive compounds and its effects on chronic degenerative and infectious diseases, a review. Frontiers in Nutrition, 10. https://doi.org/10.3389/fnut.2023.1194283 ", " NatureServe Explorer 2.0. (n.d.). https://explorer.natureserve.org/Taxon/ELEMENT_GLOBAL.2.156165/Manilkara_zapota ", " Hilbert, D. R., Koeser, A., McLean, D. C., Klein, R., Watson, D. G., & Gilman, E. (2019, April 29). Manilkara zapota: Sapodilla. Ask IFAS - Powered by EDIS. https://edis.ifas.ufl.edu/publication/ST405 ", " Marketman. (2006, February 12). Chico / Sapodilla. Market Manila. https://www.marketmanila.com/archives/chico-sapodilla"],
        "coordinates": "",
        "tree_code": "chico",
        "image": "/images/tree/chico.jpg"
    },
    {
        "common_name": "Rambutan",
        "scientific_name": "Nephelium lappaceum",
        "vernacular_names": ["Rambutan", "Hairy Lychee", "Ramboostan"],
        "conservation_status": "Least Concern",
        "ancestry": {
            "kingdom": "Plantae",
            "clade": "Tracheophytes, Angiosperms, Eudicots, Rosids",
            "order": "Sapindales",
            "family": "Sapindaceae",
            "genus": "Nephelium",
            "species": "N. lappaceum"
        },
        "description": "Nephelium lappaceum L., more widely known as Rambutan or Hairy Lychee, is a tropical tree native to the Malay-Indonesian region, and other Southeast Asian countries. They usually grow in warm or tropical regions. Its name originated from the Malay word 'rambut' which means 'hairy' that alludes to its fruit’s appearance. It is closely related to other edible fruits such as lychee and longan. This evergreen tree has a fairly straight and erect trunk which can grow up to 15–24 m tall. Its leaves are compound, having around 5 - 11 elliptic leaflets which have a length of about 5 - 15 cm. The leaf itself ranges from about 14 - 30 cm long.",
        "notable_features": "Its fruit is a round oval shape with a thick reddish skin covered in spines ('hairs'). The fruit inside is a translucent whitish or pale pink aril or a seed covering. Its taste is described to be sweet with hints of an acidic flavor that is similar to grapes. This fruit may be consumed fresh, blended into juices and smoothies, and used in desserts like jam and ice creams.",
        "uses": "Rambutan’s sweet flesh can be eaten fresh or made into jams, juices, and desserts. The fruit is rich in vitamin C, which helps the body absorb iron from foods and boost the immune system. The seeds can be used to make oil for soap and beauty products, while the peel is sometimes used in traditional medicine. Its peel is used to fight infections. Even the tree is valuable because its wood can be used for furniture or firewood.",
        "references": ["Wikipedia contributors. (2025, October 2). Rambutan. Wikipedia. ", " https://en.wikipedia.org/wiki/Rambutan ", "Wikipedia contributors. (2025, October 2). Rambutan. Wikipedia. ", " https://en.wikipedia.org/wiki/Rambutan ", "Rambutan: 15 Interesting Facts for This Exotic Fruit. (n.d.). Retrieved October 8, 2025, from https://wikifarmer.com/library/en/article/rambutan-15-interesting-facts-for-this-exotic-fruit"],
        "coordinates": "",
        "tree_code": "rambutan",
        "image": "/images/tree/rambutan.jpg"
    },
    {
        "common_name": "Avocado",
        "scientific_name": "Persea americana",
        "vernacular_names": ["Avocado", "Alligator Pear", "Butter Fruit", "Avokado"],
        "conservation_status": "Least Concern",
        "ancestry": {
            "kingdom": "Plantae",
            "clade": "Tracheophytes, Angiosperms, Magnoliids",
            "order": "Laurales",
            "family": "Lauraceae",
            "genus": "Persea",
            "species": "Persea americana"
        },
        "description": "Persea americana, commonly known as the Avocado tree, is an evergreen tree in the laurel family (Lauraceae). This tree is widely cultivated because of the fruit’s rich flavor and nutrition. The Avocado tree is a tall or spreading tree that typically reaches the heights of 9 - 20 meters tall. It’s leaves are elliptical or egg-shaped with an average length that ranges from 10–30 cm (4–12 inches). It may even emerge with a reddish hue when young, then mature to a deep green color. The Avocado tree’s flowers are small and have a greenish color. They are borne in dense inflorescences in the leaf axils. The flowers have nine stamens that are arranged in three series (and a one-celled ovary). The fruit produced is a large berry (commonly known as the avocado), it may be pear-shaped or oval, with a smooth and thick layer of skin, with a color of green to purplish-black. It has a buttery edible pulp, with one large seed in the middle.",
        "notable_features": "One of the most notable characteristics of the avocado tree is the buttery, oil-filled pulp of its fruit. Another unique trait of this species is that it has a special flowering mechanism called synchronous dichogamy (flower types A and B) that facilitates cross-pollination and improved fruiting. The tree's broad shiny leaves and heavy canopy also provide it with ornamental use in favorable climates. Cultivated varieties are often grafted to secure good fruit quality and a head start on production in commercial use.",
        "uses": "The avocado tree is cultivated mainly for its fruit, as it is rich in healthy fats, vitamins and minerals, and consumed extensively in salads, dips (in particular, guacamole), spreads, and smoothies. The pulp is also commercially used to make avocado oil for cooking, cosmetics, and skincare. In terms of landscaping, avocado trees can serve as shades and decorative garden specimens in hot climates. Some traditional uses also include seed, skin or leaves in folk remedies or craft materials, although care should be taken because the parts of the tree can be poisonous to some animals.",
        "references": ["Britannica Editors. (2025, October 13). Avocado | Description, Types, History, Uses, & Facts. Encyclopedia Britannica. https://www.britannica.com/plant/avocado#:~:text=Avocado%20trees%20can%20be%20tall,and%20a%20one%2Dcelled%20ovary. ", "Gardenia.net. (n.d.). Persea americana (Avocado Tree). https://www.gardenia.net/plant/persea-americana-avocado-tree ", "University of ", "Florida Institute of Food and Agricultural Sciences (IFAS). (n.d.). ENH-594/ST435: Persea americana: Avocado. https://edis.ifas.ufl.edu/publication/ST435 ", "World Agroforestry Centre (ICRAF). (n.d.). Persea americana. https://apps.worldagroforestry.org/treedb/AFTPDFS/Persea_americana.PDF ", "Missouri Botanical Garden. (n.d.). Persea americana – Avocado. ", "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?taxonid=281661"],
        "coordinates": "",
        "tree_code": "avocado",
        "image": "/images/tree/avocado.jpg"
    },
    {
        "common_name": "False Ashoka / Indian Mast",
        "scientific_name": "Monoon longifolium (Polyalthia longifolia)",
        "vernacular_names": ["False Ashoka", "Indian Mast Tree"],
        "conservation_status": "Least Concern",
        "ancestry": {
            "kingdom": "Plantae",
            "phylum": "Streptophyta",
            "class": "Equisetopsida",
            "subclass": "Magnoliidae",
            "order": "Magnoliales",
            "family": "Annonaceae",
            "genus": "Monoon",
            "species": "Monoon longifolium"
        },
        "description": "Polyalthia longifolia, belonging to the family Annonaceae and commonly known as False Ashoka or Indian Mast Tree, is a large evergreen tree native to India and Sri Lanka. It typically grows to a height of 12–25 meters, featuring a straight, slender trunk and pendulous, glossy, lance-shaped leaves that remain green throughout the year. The tree’s graceful, columnar form and dense foliage make it a popular ornamental species in tropical regions.",
        "notable_features": "The Polyalthia longifolia is known for its height and its resemblance to the true Ashoka tree (Saraca asoca), from which it got its name “False Ashoka.” It can grow up to 12–25 meters tall, with a woody, slender, and column-like stem that gives it a symmetrical and upright appearance. The bark is gray and smooth when young, becoming slightly rough and flaky as the tree matures. The leaves are simple, leathery, and evergreen, lanceolate to oblong-lanceolate in shape, and are arranged alternately along the branches. They are glossy, pendulous, and wavy-edged, giving the tree a graceful, cascading look. The flowers are star-shaped, with six thin, linear petals that range in color from pale green to greenish yellow. These are followed by clusters of small, oval fruits that mature from green to dark purple or black. The roots are deep and strong, supporting the tree’s tall and narrow growth form.",
        "uses": "The Polyalthia longifolia is commonly used as an ornamental decoration during festivals because of its elegant and evergreen appearance. In India, it is also used in traditional medicine for the treatment of fever, skin diseases, hypertension, and helminthiasis. The bark of the tree is known for its medicinal value and is used in various herbal remedies. The wood is durable and has been used in the construction of ship masts, which is why it is called the “Indian Mast Tree.” The Polyalthia longifolia is also valued for its air-purifying properties, as it helps filter dust and pollutants in the environment. In addition, its dense foliage contributes to alleviating noise pollution, making it beneficial in maintaining a cleaner and quieter atmosphere.",
        "references": ["Indian tree, tree of india, Monoon longifolium, polyalthia longifolia: Philippine Medicinal Herbs  / Philippine Alternative Medicine. (n.d.). https://www.stuartxchange.org/IndianTree.html ", "Polyalthia longifolia / IPlantz. (2025). https://www.iplantz.com/plant/1273/polyalthia-longifolia/  ", "Abi. “Mast Tree Florida: Growing and Caring for a Polyalthia Longifolia.” GFL Outdoors, 16 Dec. 2022, www.gfloutdoors.com/mast-tree-florida-growing-and-caring-for-a-polyalthia-longifolia/.  Accessed 8 Oct. 2025. ", "Nurseries-Dev. (2024, July 15). Indian Mast tree 'Polyalthia longifolia' or Asoka. Nurseries Online Australia. https://www.nurseriesonline.com.au/plant-index/trees-shrubs/evergreen-trees-and-shrubs/polyalthia/ ", "NParks | Monoon longifolium “Pendula.” (2012) https://www.nparks.gov.sg/florafaunaweb/flora/3/0/3080 "],
        "coordinates": "",
        "tree_code": "false_ashoka",
        "image": "/images/tree/tanglin.jpg"
    },
    {
        "common_name": "Malapapaya",
        "scientific_name": "Polyscias nodosa",
        "vernacular_names": ["Malapapaya (Visayas, Pangasinan, Tagalog)", "Bias-bias (Tagalog)", "Bungliu (Tagalog, Bikolano)", "Bongliw (Camarines Sur, Bikolano)"],
        "conservation_status": "Least Concerned",
        "ancestry": {
            "kingdom": "Plantae",
            "clade": "Tracheophytes, Angiosperms, Eudicots, Rosids",
            "order": "Apiales",
            "family": "Araliaceae",
            "genus": "Polyscias",
            "species": "P. nodosa"
        },
        "description": "Polyscias nodosa is commonly known as the Malapapaya tree. It is native to Tropical Asia and the Southwestern Pacific, specifically found in the Philippines, Indonesia, Papua New Guinea, and the Solomon Islands. It is an indigenous species that occurs throughout the Philippines and is also native to the Caroline Islands (Palau) and Queensland.",
        "notable_features": "This tree reaches about 25 meters with a diameter of 50 cm. Its leaves are described as ovate-oblong shaped simple leaves, lanceolate from a rounded base, with rounded scallop to saw-tooted edges. It has a smooth surface and visible vertical lines around the bark. Its outer color of the bark is creamish-white with brown color and as for inner bark, it has white color with distinct yellow rays where it is also very brittle. The roots of the malapapaya tree have a taproot system with a prominent central taproot from which smaller feeder roots branch out. The flowers of the tree are small, fragrant, yellow-green, and borne in panicles. These flowers are small, typically measuring about 1.5 cm long in their inflorescence, and are a component of the plant that gives it its fragrant scent. The fruits are small, with small seeds, and are picked from the trees for propagation purposes, with a shape of subglobose (nearly spherical), ridged, and a yellowish-red color when it dries.",
        "uses": "It is primarily used for its wood in the Philippines to produce various small wooden articles like toothpicks, chopsticks, matchsticks, and pencil slats, as well as for fancy woodwork, plywood, and native wooden shoes. The tree's leaves also have medicinal uses, including being employed as a contraceptive and for treating fever. The wood is ideal for small objects such as toothpicks, matchsticks, chopsticks, lollipop/popsicle sticks, and ice cream spoons. Larger logs from the Malapapaya tree are suitable for making plywood and veneer. It is also used for making boxes, crates, native wooden shoes, and for general carpentry and fancy woodwork. This tree has also played an important role in giving medicinal uses. In some parts of Mindanao, the leaves are used medicinally to treat fever and as a contraceptive. Pounded leaves mixed with ash are applied locally as a fish poison. Lastly, this tree also has ecological uses and also for decorations. The tree is sometimes planted as an ornamental tree in gardens, it is also used as a ground cover.",
        "references": ["Philippine Flora. (2009, September 2). Malapapaya. Retrieved from https://philippineflora.wordpress.com/2009/09/02/malapapaya/ ", "StuartXchange. (n.d.). Malapapaya, Polyscias nodosa / Alternative Medicine. Retrieved from https://www.stuartxchange.org/Malapapaya ", "Boer, E. & Sosef, M. S. M. (1998). Polyscias J.R. Forster & J.G. Forster. In Sosef, M.S.M., Hong, L.T., & Prawirohatmodjo, S. (Eds.), Plant Resources of South-East Asia No 5(3): Timber trees; Lesser-known timbers. PROSEA. Retrieved from https://prosea.prota4u.org/view.aspx?id=6132"],
        "coordinates": "",
        "tree_code": "malapapaya",
        "image": "/images/tree/malapapaya.jpg"
    },
    {
        "common_name": "Guava",
        "scientific_name": "Psidium guajava L.",
        "vernacular_names": ["Guava", "Yellow guava", "Lemon guava"],
        "conservation_status": "Least Concern",
        "ancestry": {
            "kingdom": "Plantae",
            "phylum": "Caryophyllophyta",
            "class": "Magnoliophyta",
            "order": "Myrtales",
            "family": "Myrtaceae",
            "genus": "Psidium",
            "species": "Psidium guajava"
        },
        "description": "Psidium guajava L., also referred to as guava, is a small tropical tree found in the Myrtaceae family. It is also referred to by some of the following names: apple guava, Brazilian guava, common guava, Guinea guava, lemon guava, pear guava, tropical guava, and yellow guava. The guava is thought to have native origins in tropical America, from Mexico to Peru, and is now cultivated in numerous tropical and subtropical areas of the globe. The guava tree is sturdy and resilient, tolerating various types of soil and climatic conditions. The fruits are round or oval and have green to yellow skin and white or pink pulp with numerous small seeds. Guava is highly valued not just because of its sweet, refreshing flavor but also for its health value, as it is highly supplemented with vitamin C, fiber, and antioxidants that make it a valuable fruit both in food and in traditional medicine.",
        "notable_features": "The Guava tree has a unique trunk with a smooth and flaking bark and a thick covering of green leaves. The tree's leaves are arranged in pairs but oppositely and give off a very nice scent when crushed. The fruits of the plant may be round or oval and are yellow when fully ripe, having a flesh that can be white, pink, or red and is full of small hard seeds. Guava trees are tolerant of unfavorable conditions and can adapt to almost any soil type. Their root systems are deep and extensive, which enables them to live through periods of drought.",
        "uses": "Guava is a fruit that has multiple applications and is widely recognized for its medicinal and therapeutic properties. The fruit is an excellent source of vitamin C and may be consumed in different ways like fresh, or made into jams, juices, and sweets. Herbal medicine employs guava leaves and bark for the treatment of diarrhea, skin diseases, wounds, and inflammation among others. Besides that, the bark is also tanned and dyed, while the wood is used for making furniture, handles for tools, and burning. Besides all these, guava trees are also used for air cleaning, and as decorative or shadow trees in home gardens.",
        "references": ["[1] Arévalo-Marín, E., Casas, A., Landrum, L., Shock, M. P., Alvarado-Sizzo, H., Ruiz-Sanchez, E., & Clement, C. R. (2021). The Taming of Psidium guajava: Natural and Cultural History of a Neotropical Fruit. Frontiers in Plant Science, 12. https://doi.org/10.3389/fpls.2021.714763 ", " [2] Sanda, K.A., et al. “Pharmacological Aspects of Psidium Guajava: An Update.” International Journal of Pharmacology, vol. 7, no. 3, 1 Mar. 2011, pp. 316–324, https://doi.org/10.3923/ijp.2011.316.324.  Accessed 16 Mar. 2020. ", " [3] www.wisdomlib.org. “Traditional Uses of Guava.” Wisdomlib.org, 30 Oct. 2024, www.wisdomlib.org/science/journal/world-journal-of-pharmaceutical-research/d/doc1378477.html. Accessed 8 Oct. 2025."],
        "coordinates": "",
        "tree_code": "guava",
        "image": ""
    },
    {
        "common_name": "Narra",
        "scientific_name": "Pterocarpus indicus",
        "vernacular_names": ["Narra (Tagalog)", "Narra / Philippine Rosewood (English)", "Asana / Narra (Visayan)"],
        "conservation_status": "Vulnerable",
        "ancestry": {
            "kingdom": "Plantae",
            "clade": "Tracheophytes, Angiosperms, Eudicots, Rosids",
            "order": "Fabales",
            "family": "Fabaceae",
            "genus": "Pterocarpus",
            "species": "Pterocarpus indicus"
        },
        "description": "Pterocarpus indicus, commonly called Narra, is the national tree of the Philippines. It is native to Southeast Asia and usually grows in lowland forests. Narra trees are known for their strength and durability, making them a popular source of hardwood. The tree can grow up to 30–40 m tall with a wide canopy that provides shade. Its leaves are compound, with small oval leaflets arranged alternately along the stem.",
        "notable_features": "One of the most striking features of the Narra tree is its bright yellow flowers, which bloom in clusters during the dry season, usually from February to May. These flowers are small but fragrant, attracting bees and other pollinators. After flowering, the Narra tree produces fruit in the form of flat, round, and winged seed pods that are light brown when mature. Each pod contains a single seed that can be dispersed by wind and water. The wood of the Narra tree is highly valued and has been widely used for centuries. It is known for being extremely durable, termite-resistant, and naturally fragrant. Because of its beauty and reddish hue, Narra wood has been used in furniture making, flooring, cabinetry, and even in the crafting of religious statues and heritage pieces. It is considered one of the finest types of hardwood in the Philippines. Unfortunately, this popularity has also led to overharvesting and illegal logging, which greatly contributed to its decline in natural populations, leading to its current conservation status of “Vulnerable.” Beyond its practical uses, Narra also has cultural and symbolic importance. As the national tree, it represents the Filipino people’s strength, endurance, and adaptability in the face of challenges. Its wide canopy providing shelter is seen as a metaphor for protection and unity. In addition, parts of the tree have been traditionally used in folk medicine. The bark and leaves are sometimes prepared as herbal remedies for skin conditions and other ailments, although these uses are not yet fully validated by science. Today, conservation efforts are being undertaken to protect and restore Narra populations. Government agencies like the Department of Environment and Natural Resources (DENR), along with environmental groups, are encouraging the planting of Narra seedlings in reforestation programs. Its inclusion in public spaces also ensures that future generations will continue to enjoy the beauty and benefits of this tree.",
        "uses": "The Narra tree (Pterocarpus indicus) is highly valued for its strong and termite-resistant wood, which is widely used in making furniture, flooring, and carvings. It is also planted as an ornamental and shade tree because of its wide canopy and fragrant yellow flowers. Traditionally, its bark and leaves have been used in folk medicine for various ailments. As the national tree of the Philippines, Narra symbolizes strength and resilience while also playing an ecological role in preventing soil erosion and supporting pollinators.",
        "references": ["International Union for Conservation of Nature (IUCN) Red List – Global conservation status of Pterocarpus indicus. https://www.iucnredlist.org ", " Food and Agriculture Organization (FAO) Plant Database – Details on Narra’s distribution, growth, and uses. https://www.fao.org/plant-production/en ", " DOST-PCAARRD portal. (2025, August 4). DOST-PCAARRD Portal. https://www.pcaarrd.dost.gov.ph/  ", " National Museum. (n.d.). https://www.nationalmuseum.gov.ph/  ", " StuartXchange Front Page - SX - Godofredo Umali Stuart’s Cyber-Warehouse. (n.d.). https://www.stuartxchange.org/ "],
        "coordinates": "",
        "tree_code": "narra",
        "image": "/images/tree/narra.jpg"
    },
    {
        "common_name": "Taluto",
        "scientific_name": "Pterocymbium tinctorium",
        "vernacular_names": ["Taluto", "Malasapsap (Tagalog)", "Teluto (Bisaya)", "Taluto / Taluhto / Kaluto (Bikol)"],
        "conservation_status": "Least Concern",
        "ancestry": {
            "kingdom": "Plantae",
            "division": "Tracheophyta",
            "class": "Magnoliopsida",
            "order": "Malvales",
            "family": "Malvaceae",
            "subfamily": "Sterculioideae",
            "genus": "Pterocymbium",
            "species": "Pterocymbium tinctorium"
        },
        "description": "The Pterocymbium tinctorium, commonly known as Taluto, is a tall deciduous tree native to Southeast Asia, particularly found in the Philippines, Cambodia, and Malaysia. It belongs to the family Malvaceae. This tree is common in tropical forests and lowland areas, thriving in moist soil conditions. In the Philippines, it is often seen in secondary forests or planted for shade and timber. This research provides an overview of the Taluto tree, including its classification, physical description, notable features, uses, local names, and conservation status. The Taluto tree is a large deciduous species that can grow up to 30-42 meters tall, with a straight cylindrical trunk reaching up to 70-85 centimeters in diameter. It is fast-growing, especially under favorable tropical conditions, with some plantations observing a growth rate of about 2 cm in diameter per year. The bark is usually grayish and smooth, sometimes showing shallow ridges, while the inner bark is reddish. Its roots are adapted to moist tropical soil, often deep and sturdy, providing strong anchorage even without large buttresses. The leaves of the Taluto are simple, entire, and alternate, though very young leaves may show slight lobing. They are ovate to truncate in shape, with an acuminate apex, and measure around 7 – 14cm long and 4–6 cm wide. The upper surface of the leaf is smooth, while the lower surface may have fine hairs, especially on younger leaves. The flowers grow in branched clusters at the ends of branches, and they can appear even when the tree is leafless. The flowers are unisexual but occur on the same tree, making it monoecious. When fruiting, the Taluto produces winged fruits that are often seen hanging in clusters of about five. The wings are reddish or golden-green when fresh, turning brown or black when dry, and have a papery texture that helps the seeds disperse by wind.",
        "notable_features": "One of the most notable features of the Taluto is its tall, straight trunk and rapid growth, which make it valuable for timber production. The reddish inner bark is also distinctive, as it contains natural dye substances — the species name tinctorium even means “used for dyeing.” The tree’s winged fruits are also a recognizable feature, adding ornamental value when the tree is fruiting. Additionally, the Taluto tends to flower and fruit when leafless, giving it a unique seasonal appearance.",
        "uses": "The Taluto tree is highly useful in both commercial and environmental applications. Its lightweight wood is used for furniture, veneer, plywood, and matchsticks. It is also planted in reforestation programs because of its fast growth and ability to thrive in different soil types. The bark has been traditionally used for natural dyeing (hence the term tinctorium), and in some areas, fibers from the bark are used for making ropes or cords. Although not widely documented, some communities also use parts of the tree in folk medicine, possibly for treating skin conditions or minor wounds. Because of its wide canopy and height, the Taluto is also planted as an ornamental or shade tree in parks and open spaces.",
        "references": ["IUCN SSC Global Tree Specialist Group.; Botanic Gardens Conservation International; et al. (BGCI) (2019). \"Pterocymbium tinctorium\". IUCN Red List of Threatened Species. 2019 e.T33254A156219571. doi:10.2305/IUCN.UK.2019-3.RLTS.T33254A156219571.en ", " \"Pterocymbium tinctorium (Blanco) Merr\". Plants of the World Online. The Trustees of the Royal Botanic Gardens, Kew. n.d. Retrieved August 23, 2020 ", " Pterocymbium tinctorium. (2021). INaturalist. https://www.inaturalist.org/taxa/709632-Pterocymbium-tinctorium ", " Taluto / Pterocymbium tinctorium / Bellflower sterculia / Winged boot tree/ Alternative Medicine. (2024). Stuartxchange.org. https://www.stuartxchange.org/Taluto"],
        "coordinates": "",
        "tree_code": "taluto",
        "image": "/images/tree/taluto.jpg"
    },
    {
        "common_name": "Royal Palm",
        "scientific_name": "Roystonea regia",
        "vernacular_names": ["Royal Palm", "Cuban Royal Palm", "Florida Royal Palm"],
        "conservation_status": "Least Concern",
        "taxonomic_classification": {
            "kingdom": "Plantae",
            "clade": "Tracheophytes, Angiosperms, Monocots",
            "order": "Arecales",
            "family": "Arecaceae",
            "genus": "Roystonea",
            "species": "Roystonea regia"
        },
        "description": "Royal Palm or Roystonea regia is a tall, dignified tropical palm in the Arecaceae family. It is native to the Caribbean and extensively grown in tropical climates, such as in the Philippines. It’s trunk is smooth, grey-white or light-colored, cylindrical and has a typical height of 20–30 meters or more when well-nourished. The crown has large pinnate fronds that form a wide and elegant canopy. Leaves are very long, with numerous leaflet segments per frond. Blooming is in large clusters under the crownshaft, and the fruit are small drupes carried in large inflorescences. In the Philippines, the Royal Palm Tree is often utilized as an avenue and ornamental tree because of its upright form and tropical look. The tree produces cream-white bisexual flowers in large branched inflorescences emerging below the crownshaft. The small, round fruits are green at first, maturing to a dark purplish-black drupe that is bird- and bat-attracting. Royal Palms need full sun, moist soils, and warm tropical conditions. They are also tolerant of salted conditions, making them well-suited to coastal and resort landscapes in the Philippines.",
        "notable_features": "One of the features most distinctive of the Royal Palm is how smooth and tall its trunk is. Its light-colored, smooth trunk commonly has a slight swell below the green crownshaft. The large fronds create a high canopy, making it a popular accent in parks and boulevards. It is tolerant towards the sun, salt air, and seaside conditions, therefore making itself ideal for tropical landscaping. Since it is not native but commonly cultivated, it does not have a well-documented indigenous vernacular name in Philippine flora literature; hence it is commonly called by its English common name or by its horticultural trade names.",
        "uses": "Royal Palm is mostly prized for its ornamental and landscape value. Its elegant, tall shape is suited to promenades, resort gardens, extensive parks, and urban streetscapes in tropical countries such as the Philippines. In other areas, different parts of the palm have lighter traditional uses: the fronds can be utilized for thatch or craft purposes, the trunk can provide light timber, and the fibers in the leaf-sheaths have been researched for the use in composite materials. The species also adds aesthetic, ecological, and cultural worth to landscapes and is used as a visual landmark and shade in tropical environments.",
        "references": ["National Tropical Botanical Garden. (n.d.). Roystonea regia – Tropical Plant Database. https://ntbg.org/database/plants/detail/roystonea-regia ", " Philippines Country Report on Forest Genetic Resources. (n.d.). Roystonea regia (HBK) O.F. Cook. Food and Agriculture Organization. https://www.fao.org/4/i3825e/i3825e54.pdf ", " Plant Family Palmae (PDF). (n.d.). United States Department of Agriculture. https://www.fs.usda.gov/nsl/Wpsm/Roystonea.pdf ", " “Mga katangian ng Royal Palm o Roystonea Regia.” (n.d.). PostPosmo (Filipino language article). https://tl.postposmo.com/royal-palm-tree/ ", " “Roystonea Regia – Cuban Royal Palm, Florida Royal Palm.” (n.d.). Agrobio Resources: Botanical Name to Common or Vernacular Name. https://agrobioresources.blogspot.com/2016/05/botanical-name-to-common-or-vernacular.html ", " Sacred Heart College, Thevara. (n.d.). “Cuban Royal Palm (Roystonea regia).” https://www.shcollege.ac.in/campusflora_cuban-royal-palm/ ", " National Parks Board Singapore (NParks). (n.d.). Roystonea regia (Cuban Royal Palm). Flora & Fauna Web. https://www.nparks.gov.sg/florafaunaweb/flora/3/0/3093"],

        "coordinates": "",
        "tree_code": "royal_palm",
        "image": ""
    },
    {
        "common_name": "Santol",
        "scientific_name": "Sandoricum koetjape",
        "vernacular_names": ["Cotton Fruit", "Kechapi", "Sentul", "Lolly Fruit"],
        "conservation_status": "Non-extinct",
        "ancestry": {
            "kingdom": "Plantae",
            "clade": "Tracheophytes-Angiosperms-Eudicots-Rosids",
            "order": "Sapindales",
            "family": "Meliaceae",
            "genus": "Sandoricum",
            "species": "Sandoricum koetjape"
        },
        "description": "Santol is a tropical fruit tree native to Southeast Asia. It bears round fruits with thick skin that can be yellow or reddish when ripe, and soft, juicy pulp that is sweet and slightly sour. The Santol tree is large and evergreen, reaching up to 25–50 meters tall with thick buttress roots and a symmetrical crown.",
        "notable_features": "Santol trees have tall, straight trunks up to 18 meters without branches and strong buttress roots. The hardwood is durable, making it ideal for furniture and boat construction.",
        "uses": "The fruit is eaten fresh, or made into jams, preserves, candies, or savory dishes. The bark and leaves are used in traditional medicine for fever and diarrhea. The wood is used for furniture, boats, and carpentry.",
        "references": ["Santol Fruit. (n.d.). https://specialtyproduce.com/produce/Santol_Fruit_11159.php ", " The Editors of Encyclopaedia Britannica. (2025, September 13). Jackfruit | Description &  ", " Uses.Encyclopedia Britannica. ", " https://www.britannica.com/plant/jackfruit ", " Sandoricum koetjape - Useful Tropical Plants. (n.d.-b). ", " https://tropical.theferns.info/viewtropical.php?id=Sandoricum+koetjape"],
        "coordinates": "",
        "tree_code": "santol",
        "image": "/images/tree/santol.jpg"
    },
    {
        "common_name": "Talisay Bukid",
        "scientific_name": "Terminalia catappa",
        "vernacular_names": ["Talisay Bukid", "Tropical Almond", "Indian Almond", "Umbrella Tree"],
        "conservation_status": "Least Concern",
        "ancestry": {
            "kingdom": "Plantae",
            "clade": "Tracheophytes, Angiosperms, Eudicots, Rosids",
            "order": "Myrtales",
            "family": "Combretaceae",
            "genus": "Terminalia",
            "species": "T. catappa"
        },
        "description": "Terminalia catappa, commonly known as Talisay Bukid or Tropical Almond, is a large deciduous tree belonging to the Combretaceae family. It is native to Asia, Australia, Madagascar, and the Seychelles but has since spread across the tropics, including the Philippines. Adapted to coastal and rural areas, the tree is highly tolerant to drought, salt, and strong winds, thriving in full sun and making it a resilient part of tropical landscapes. In the Philippines, it is a familiar presence in both coastal towns and countryside “bukid” areas.<br><br>Talisay Bukid (Terminalia catappa) is a large tropical tree widely found in the Philippines, often planted along roadsides, parks, and coastal areas. Known for its spreading, horizontal branches, the tree develops a distinct pagoda-like shape. It belongs to the family Combretaceae and is native to tropical Asia, although it is now naturalized throughout the tropics. The tree can grow up to 25–35 meters tall, with a broad crown that provides abundant shade.<br><br>Its leaves are large, leathery, and oval-shaped, typically turning red, yellow, or purple before falling off, making the tree semi-deciduous. The bark is generally grayish to brown, smooth in younger trees but rougher with age. Talisay Bukid flowers are small, white to greenish-white, and fragrant, appearing in slender spikes.",
        "notable_features": "The Talisay Bukid is known for its distinctive appearance. When young, the branches form a tiered, pagoda-like shape, but as the tree matures, its canopy spreads wide, creating a broad umbrella-like crown. The bark is grayish-brown, shallowly fissured, and may peel in scales, while the roots are fibrous and spreading, giving the tree stability and preventing soil erosion. Its large, leathery leaves are obovate to broadly oval, glossy on top, and pale beneath. Before falling during the dry season, the leaves turn into bright shades of red, yellow, or copper brown, producing an unusual “autumn” effect in tropical landscapes. The flowers of the tree are small, greenish-white, and borne on slender spikes. Although they have no petals and a slightly fetid smell, the tree is monoecious, bearing both male and female flowers.<br><br>The fruits of the Talisay Bukid are oval drupes, green when young but turning yellow to purple as they ripen. Inside is a hard shell that encloses an edible kernel with a taste similar to almonds. These nuts are a food source in many tropical regions, and the fleshy outer part of the fruit can also be eaten. The tree’s timber is moderately hard and useful for light construction, furniture-making, and boat building. In folk medicine, different parts of the tree such as the bark, leaves, and roots have been used to treat dysentery, fever, liver disorders, and skin ailments.<br><br>The Talisay Bukid is widespread across the tropics today, but its origins trace back to the Indian Ocean and Asia-Pacific regions. Historical accounts suggest that Captain William Bligh introduced the tree to the West Indies in 1793, and human movement has since carried it to other parts of the world such as Brazil, East Africa, and the Caribbean. In the Philippines, the tree is tied to a folk tale from Batangas, where two sons searched for a tall talisay tree after their mother dreamt of its healing fruit. When they brought the fruit home, their mother’s illness was cured, and the town was later named Talisay in honor of the tree.<br><br>The Talisay Bukid stands out not only for its wide, umbrella-shaped canopy but also for its long lifespan of 100 to 200 years. It is valued for the shade it provides, its ecological benefits in coastal protection, its use in food and medicine, and the stories and traditions that surround it.",
        "uses": "The kernels of the Talisay Bukid are edible and provide nourishment. In traditional medicine, its red leaves are used to expel worms, while the fruit serves as a purgative. Leaves mixed with oil are applied to the breast to ease pain, and the bark is used for gastric ailments, bilious diarrhea, and dysentery. The sap of young leaves combined with kernel oil has been used in leprosy treatment, while bark decoction helps with gonorrhea and stomach cramps. Leaves are also applied to rheumatic joints, and the juice of young leaves is taken for scabies, headaches, colic, and skin diseases. Macerated leaves in oil are used for tonsillitis, and leaf extracts are applied in hepatitis and dermatitis treatments.<br><br>The kernel oil, also known as Indian Almond oil, has both edible and industrial uses. The wood produces red, cross-grained timber valued in construction, especially for boats, bridges, crates, planks, and water troughs. The tree also yields gum or resin from its trunk. Its fruit shells and roots contain tannins and dyes, which are used for leather tanning, as well as making ink and black dye for rattan and cotton. In addition, the foliage serves as fodder, even used for silkworms.<br><br>Beyond its practical applications, the Talisay Bukid has been found to possess numerous bioactive properties, including antioxidant, anti-inflammatory, hepatoprotective, antimicrobial, analgesic, antidiabetic, antitumor, and antifungal effects.",
        "references": [],

        "coordinates": "",
        "tree_code": "talisay",
        "image": "/images/tree/talisay.jpg"

    },
    {
        "common_name": "Kalantas, Philippine Cedar",
        "scientific_name": "Toona calantas",
        "vernacular_names": ["Kalantas", "Calantas", "Philippine Cedar", "Philippine Mahogany", "Lanipga", "Ample", "Bantinan", "Danupra", "Kantingen"],
        "conservation_status": "Vulnerable",
        "ancestry": {
            "kingdom": "Plantae",
            "clade": "Tracheophytes, Angiosperms, Eudicots, Rosids",
            "order": "Sapindales",
            "family": "Meliaceae",
            "genus": "Toona",
            "species": "T. calantas"
        },
        "description": "Toona calantas, also known as kalantas/calantas or Philippine mahogany, is a large & fast-growing deciduous tree of the Meliaceae family native to Southeast Asia, particularly the Philippines, Thailand, and Indonesia. The tree itself can reach up to 25 meters tall with its straight and branchless trunk growing up to 20 meters long. It is considered by the DENR to be a vulnerable species due to heavy logging and habitat loss, while the IUCN declares it as data deficient. Kalantas can grow up to 25 meters in height and 25 centimeters in diameter. It is known for its high-quality timber used in furniture, musical instruments and plywood, as well as its ecological importance for providing food and habitats for native wildlife and stabilizing soil with its deep roots.<br><br>Its straight and terete (cylindrical) trunk has a near diameter of around 100 - 150 centimeters, with the leaves of the tree compound and alternate oblong, having entire leaflets. The mahogany’s fruit is shaped like a large capsule that dehisces at the apex, with unequally winged seeds. Its lumber is a reddish-brown color, while its sapwood is a pale red.",
        "notable_features": "The Toona calantas is known for its strikingly unique red color among timbers, which is what led to its classification as “Vulnerable” due to mass deforestation for material collection due to its wide usage in the creation of musical instruments, furniture, joinery, and even carving applications, as well as its excellent capabilities as firewood. The texture of the bark is smooth when the tree is still young, becoming more complex as it matures, shedding thin, flaky patches or woody scales.<br><br>The flowering of the tree occurs from June to August, while fruiting occurs from September to November. The tree exudes a strong, lasting sour odor similar to that of Spanish cedar. The flowers of Calantas are small and white, with the fruit following in around a month after. The fruit is a capsule, around 3-4 centimeters long, with a dark-red to red-brown color. It is smooth to the touch and contains numerous lenticels (small dots) on the surface of the fruit. Meanwhile, the leaves of the tree are oddly pinnate compound leaves with around 10-20 smooth oblong leaflets around 12 centimeters long and 5 centimeters wide.<br><br>The Toona calantas is primarily found in primary forests at low to medium altitudes in the Philippines, hence the name, but can also be found in other parts of Southeast Asia. It is particularly seen abundant in the Balabac group of islands (Palawan Province).",
        "uses": "Toona calantas is known for the astringent and antiseptic properties of its bark, a decoction sometimes being used as a local remedy for cleansing wounds. A particular instance is its powdered bark being dusted over gangrenous ulcers. The flowers are also sometimes used in traditional medicine due to their antispasmodic properties. The wood contains around 0.3 - 1.2% essential oil, contributing to its strong odor that is used to create commercial essential oils.",
        "references": ["Flora Malesiana. (n.d.). Toona calantas. Retrieved October 6, 2025, from https://portal.cybertaxonomy.org/flora-malesiana/cdm_dataportal/taxon/2af2ed17-8983-4d22-a385-a0207419fec0 ", " iNaturalist. (n.d.). Toona calantas. Retrieved October 6, 2025, from https://www.inaturalist.org/taxa/444363-Toona-calantas ", "PROSEA - Plant Resources of South East Asia. (n.d.). Toona calantas. Retrieved October 6, 2025, from https://prosea.prota4u.org/view.aspx?id=4736 ", "Useful Tropical Plants. (n.d.). Toona calantas. Retrieved October 6, 2025, from https://tropical.theferns.info/viewtropical.php?id=Toona+calantas ", "Wikipedia contributors. (2025, October 5). Toona calantas. Wikipedia. Retrieved October 6, 2025, from https://en.wikipedia.org/wiki/Toona_calantas"],

        "coordinates": "",
        "tree_code": "kalantas"
    },
    {
        "common_name": "Anabiong",
        "scientific_name": "Trema orientalis",
        "vernacular_names": ["Anabiong", "Anabion", "Charcoal Tree"],
        "conservation_status": "Least Concern",
        "ancestry": {
            "kingdom": "Plantae",
            "clade": "Angiosperms, Eudicots, Rosids",
            "order": "Rosales",
            "family": "Canabaceae",
            "genus": "Trema",
            "species": "T. orientalis"
        },
        "description": "Trema orientalis, belonging to the Cannabaceae, commonly known as Anabiong or Charcoal Tree, is a fast-growing tree commonly found in the Philippines and other tropical regions. It thrives in various types of soil, often appearing in secondary forests, open areas, and roadsides. This species can reach a height of 10-25 meters, featuring a slender trunk and light green foliage. It is widely used in reforestation because of its rapid growth and its ability to enrich soil.Moreover, the Anabiong tree provides useful materials such as fuelwood, and its bark and leaves are traditionally used for medicinal purposes.<br><br>The Anabiong tree is a medium-sized tree characterized by its slender, upright trunk and lightly spreading crown. Its bark is light brown to gray, smooth when young but may become slightly rough as it matures. The leaves are simple, alternate, and light green, with toothed edges and pointed tips. They usually measure 5–15 cm in length and feel slightly rough to the touch. The tree has thin, flexible branches, giving it a delicate overall appearance. It produces small, greenish-white flowers in clusters, which later develop into tiny round fruits that turn black when ripe.<br><br> The Anabiong tree (Trema orientalis) is native to tropical and subtropical regions of Asia, Africa, and the Pacific, including the Philippines, where it grows naturally. For generations, communities have used it for fuel, charcoal, and traditional medicine. Known as a pioneer species, it is often among the first trees to grow in cleared or disturbed areas, helping restore vegetation. Its fast growth and adaptability have made it valuable for reforestation and soil conservation, playing a key role in both traditional use and modern environmental efforts.",
        "notable_features": "The Anabiong tree is characterized by its light brown to gray bark, which is smooth when young and becomes slightly rough or scaly with age, though it remains relatively thin and free of deep fissures. Its roots are strong and wide-spreading, usually shallow to moderately deep, allowing the tree to anchor firmly in different soil types, control erosion, and thrive in poor or disturbed soils—making it especially valuable for reforestation and land restoration.",
        "uses": "The Anabiong tree (Trema orientalis) has a wide range of practical and environmental uses. Its wood is light and easy to cut, making it suitable for fuel, charcoal, and temporary construction materials. The leaves and bark are commonly boiled and used as herbal remedies for coughs, fever, colds, stomach pain, diarrhea, and even malaria. Some communities use the bark to make poultices for wounds, inflammation, and skin infections, while its roots are used to relieve toothache and treat digestive problems.",
        "references": ["Anabiong /. Trema orientalis Blume/ HANADIONG / Yi se shan huang ma : Philippine Medicinal Herbs / Philippine Alternative Medicine. (n.d.). https://www.stuartxchange.com/Anabiong.html", "Anabiong (Trema orientalis) | ITTO. (n.d.). ITTO. https://share.google/bHBcHxU4N1Q1jA1nj", "Agroforestree Species profile. (n.d.-b). https://apps.worldagroforestry.org/treedb2/speciesprofile.php?Spid=1654", "ANABIONG. (2016, August 5). THE RETURN OF PHILIPPINE NATIVE TREES. https://rainforestrestorationinitiative.wordpress.com/2016/08/05/anabiong/", "View plants. (n.d.). https://brimm.nmsc.edu.ph/plants/Display/12"],

        "coordinates": "",
        "tree_code": "anabiong"
    },
    {
        "common_name": "Tan-ag",
        "scientific_name": "Kleinhovia hospita",
        "vernacular_names": ["Guest tree (Engl.)", "Hamitanago (Bik.)", "Tanak (Tag.)", "Tañgag (Tag.)"],
        "conservation_status": "Least Concern",
        "ancestry": {
            "kingdom": "Plantae",
            "clade": "Tracheophytes, Angiosperms, Eudicots, Rosids",
            "order": "Malvales",
            "family": "Malvaceae",
            "genus": "Kleinhovia",
            "species": "K. hospita"
        },
        "description": "Kleinhovia hospita, also referred to as the Guest Tree but commonly known as Tan-ag in the Philippines, is a tropical tree species belonging to the Malvaceae family.  It is a fast-growing, medium-sized evergreen tree that can reach heights of 10 to 20 meters, occasionally growing taller in favorable conditions. The tree has a short, sometimes crooked trunk that supports a broad, rounded crown, making it a good shade provider. Its bark is grayish and becomes rough and slightly fissured as it matures. The leaves of the Tan-ag tree are simple and alternately arranged along the branches. They are broad, ovate to heart-shaped with pointed tips, and can grow quite large. Young leaves appear light green and tender, while mature ones are darker and slightly glossy.<br><br>The Tan-ag tree produces beautiful clusters of small, pale pink flowers that grow in loose terminal panicles. These flowers are ornamental and attract various pollinators, such as bees and butterflies. After flowering, the tree develops distinctive inflated, papery fruit capsules that are often five-lobed. Each capsule contains one to two round seeds. These fruits hang in bunches and, when dry, split open to release the seeds, contributing to the tree’s natural propagation. Tan-ag trees thrive in secondary forests, open fields, and along roadsides or riverbanks, showing resilience even in disturbed areas.<br><br>It is native to Asian tropical regions, specifically native to the Philippines, India, Malaysia, Indonesia, and Papua New Guinea, and was introduced to other tropical nations. It is often 10–15 meters tall and easily identified by its wide, heart-shaped leaves, rose-pink flowers, and papery, light brown fruits that open when mature. The heritage of Kleinhovia hospita is from the Malvaceae lineage, a clan of plants that includes hibiscus and cacao, making it a plant adapted to warm and humid climates. It is commonly observed to grow alongside roadsides, village boundaries, and forest glades, creating shade and ornamentation because of its dense cover and pretty flowers.",
        "notable_features": "Tan-ag is known for its moderate height, spreading crown, and showy pink blossoms. The bark is gray and rough, while its leaves are large and heart-shaped, features that make it easily recognizable. The inflated fruit capsules are a distinctive feature, adding to its ornamental value. Its light, soft wood is workable and suitable for small carpentry, handicrafts, and household tools. The tree’s bark fibers are also strong and have been traditionally used to make ropes and woven materials. While the tree lacks buttress roots, the term often associated with it, young Tan-ag trees are supported by rapidly growing primary roots that penetrate deeply into the soil. As the tree matures, it develops a vast network of superficial, spreading roots, which can appear twisted and gnarled, especially when growing near rivers. The flowers of the Tan-ag tree, small and pale pink, are produced in loose panicles at the ends of the branches, often described as \"sprinkling\" the tree's canopy. Its bark is gray and cracked on the outside, with a yellowish interior. The tree's genus, Kleinhovia, was named by Carl Linnaeus in honor of Dutch botanist Christiaan Kleynhoff, while the species name, hospita, meaning \"guest,\" may refer to the tree's common growth near riverbanks close to populated areas. Indigenous cultures in tropical Asia have long used the Tan-ag tree for food, medicine, and lumber, underscoring its ecological importance and cultural value.",
        "uses": "The Tan-ag tree is valued for its many practical and cultural uses. It is commonly planted as an ornamental and shade tree in school grounds, parks, and roadside landscapes because of its appealing pink blossoms and wide canopy. Its bark and leaves are widely used in traditional herbal medicine, particularly for treating skin diseases such as scabies, rashes, and head lice (kuto). The leaves and bark are used in therapeutic remedies, such as eyewash and hair washes, and the blossoms draw bees for honey.  In rural communities, young leaves are eaten as vegetables or added to local dishes for their mild flavor and nutritional value.<br><br>The bark fibers of the Tan-ag tree are extracted and used for making ropes, mats, and woven materials, reflecting its importance in rural craftsmanship. Its wood, though light and soft, is used for small carpentry projects, woodcrafts, and household implements. The tree also plays an ecological role in soil stabilization and erosion control, especially along slopes and riverbanks, thanks to its root system. Because it grows quickly and thrives in poor soil, it is also used in reforestation and greening programs across different regions in the Philippines.",
        "references": ["Tan-ag / Kleinhovia hospita, guest tree ­  / Philippine medicinal Herbs / Alternative Medicine in the Philippines. (n.d.). https://www.stuartxchange.com/Tan-ag.html", "Wikipedia contributors. (2025, October 3). Kleinhovia. Wikipedia. https://en.wikipedia.org/wiki/Kleinhovia", "NParks | Kleinhovia hospita. (n.d.). https://www.nparks.gov.sg/FloraFaunaWeb/Flora/2/9/2981", "Llc, T. T. (2023, January 15). Kleinhovia hospita (Guest Tree) | Top Tropicals Plant Encyclopedia. TopTropicals.com - Rare Plants for Home and Garden. https://toptropicals.com/catalog/uid/kleinhovia_hospita.htm?srsltid=AfmBOooDrUYXUW58NeFIs03l1LJeY6mZ5Ya-XmjuYLyx2ecrjIa5MQ3i", "Tan-ag (Kleinhovia hospita) can be ornamental too. (n.d.). http://philippinenativeforesttrees.blogspot.com/2010/08/tan-ag-kleinhovia-hospita-can-be.html", "Kleinhovia hospita / IPlantz. (n.d.). https://www.iplantz.com/plant/933/kleinhovia-hospita/", "Tan-ag / Kleinhovia hospita, guest tree   / Philippine medicinal Herbs / Alternative Medicine in the Philippines. (n.d.). https://www.stuartxchange.com/Tan-ag.html", "Tan-ag (Kleinhovia hospita) can be ornamental too. (n.d.). https://philippinenativeforesttrees.blogspot.com/2010/08/tan-ag-kleinhovia-hospita-can-be.html", "NParks | Monodora myristica. (n.d.). https://www.nparks.gov.sg/FloraFaunaWeb/Flora/7/2/7247#:~:text=The%20simple%2C%20alternate%20leaves%20are%20oblong%20to,paler.%20New%20leaves%20are%20purplish%20in%20color.", "PROSEA - Plant resources of South East Asia. (n.d.). https://prosea.prota4u.org/view.aspx?id=3021", "Guest Tree (Kleinhovia hospita). (n.d.). iNaturalist. https://www.inaturalist.org/taxa/346180-Kleinhovia-hospita"],

        "coordinates": "",
        "tree_code": "tan_ag",
        "image": "/images/tree/tan-ag.jpg"

    },
    {
        "common_name": "Uos",
        "scientific_name": "Sterculia ceramica",
        "vernacular_names": ["Banilad", "Balindagat", "Malakalumpang", "Uos"],
        "conservation_status": "Least Concern",
        "ancestry": {
            "kingdom": "Plantae",
            "clade": "Eudicots, Rosids, Rosales, Tracheophytes, Angiosperms",
            "order": "Malvales",
            "family": "Malvaceae",
            "genus": "Sterculia L.",
            "species": "Sterculia ceramica"
        },
        "description": "The Sterculia ceramica, commonly known as the Uos in the Philippines, is an evergreen tree that grows up to 15–20 m tall, with the bole being able to grow up to 40–60 cm in diameter. Its bark provides fiber that is commonly used by the locals, and the tree is also harvested because of its wood. The Uos is considered an ornamental tree and is sometimes used as a landscape decor in streets, making use of its unique form that is pleasant to the sight. These grow best in fertile, well-drained soil, and in sunny, sheltered regions. Which is why the Uos is found in some places of Southeast Asia, namely, Taiwan, Malaysia, and the Philippines. The natural habitat of the Uos is located in primary forests, seashores, with up to 1000 m altitude.",
        "notable_features": "The Uos is unique for its ability to grow on sandy clay or coraline limestone substances. Its wood is pale and straw-colored, with straight grains, coarse texture, and parts in contact with the ground or exposed to weather is considered non-durable. Which makes them exposed to pests and borers. The leaves of the Uos are alternate, chartaceous, oblong, and apex acute.  Its flowers are arranged in clusters or panicles, and also covered in small hairs. The genus Sterculia L.  consists of some species with large buttress roots in rain-forest settings; those species tend to avoid showing the massive buttressing and adapt to beach-forest conditions. The genus also has seeds leaden black, often with a yellow or red located near the seed stalk, while the stems of plants under this genus produces a gummy exudate when it is wounded.The Uos highlights their ability to survive in coastal woodlands or wind-exposed areas.",
        "uses": "Despite not being considered a commercial timber species, the Uos’ wood has still been used for plywood, veneer, shutter boards, housing, molding, door and window frames, and some minor joinery by the locals. In coastal forest areas, the Uos plays a big role in ecological stabilization because of its structure’s suitability for a habitat and its role in shoreline woodland. Moreover, its presence along the beach forests provides shade and structure that may break strong winds. Especially in coastal rural areas in the Philippines.",
        "references": ["PhilippinePlants.org. (n.d.). Family: Sterculiaceae. In Philippine Plants – STERCULIA L. https://www.philippineplants.org/Families/Sterculiaceae.html", "ProjectNoah. (n.d.). Banilad Tree (Sterculia ceramica) Spotting. https://projectnoah.org/spotting/370669", "ITTO – Tropical Timber Info. (n.d.). Sterculia (Sterculia ceramica) Print Friendly View. https://www.tropicaltimber.info/specie/sterculia-sterculia-ceramica/", "“Flora of Mount Mantalingahan Protected Landscape”. (n.d.). Sterculia ceramica – Not Evaluated. https://www.forestfoundation.ph/wp-content/uploads/2023/10/Flora-of-MMPL-final.pdf", "TopTropicals. (n.d.). Sterculia ceramica (Banilad, Uos tree). Tropical Plant Database. Retrieved October 9, 2025, from https://toptropicals.com/catalog/uid/sterculia_ceramica.htm", "Kew Science. (n.d.). Sterculia ceramica R. Br. ex A. Juss. Plants of the World Online. Royal Botanic Gardens, Kew. Retrieved October 9, 2025, from https://powo.science.kew.org/taxon/urn:lsid:ipni.org:names:834423-1"],

        "coordinates": "",
        "tree_code": "uos",
        "image": "/images/tree/uos.jpg"

    },
    {
        "common_name": "Tabog",
        "scientific_name": "Swinglea glutinosa",
        "vernacular_names": ["Malakabuyau", "Tabog", "Tabok", "Talubok", "Uratan"],
        "conservation_status": "None",
        "ancestry": {
            "kingdom": "Plantae",
            "clade": "Angiosperms-Eudicots-Rosids",
            "order": "Sapindales",
            "family": "Rutaceae",
            "genus": "Swinglea",
            "species": "Swinglea glutinosa"
        },
        "description": "Sterculia glutinosa, commonly known as Tabog or mala cabuyao in the Philippines. It belongs to the family Rutaceae and is endemic to that country.  It is a small to medium-sized tree native to the Philippines. The Latin name “glutinosa” comes from the word “gluten,” which means “glue” or “sticky, referring to the gummy or resinous sap that the plant produces. Historically, the tree has been noted in horticultural and citrus-rootstock literature due to its potential for grafting and rootstock use in citrus cultivation. In addition to its horticultural relevance, its fruit and other parts of the tree have been used in folk medicine and local uses.  Despite being native to the Philippines, the Tabog tree is also grown in other tropical countries as an ornamental hedge plant, it is also used as a natural barrier in rural areas and gardens because of its physical features.",
        "notable_features": "Sterculia glutinosa, commonly known as tabog or mala cabuyao in the Philippines, is a small to medium-sized tree that can grow up to about 10 meters tall, and sometimes even taller when it gets older.  It appears dense and compact, making it an ideal plant for hedges and natural fences. Its trunk has single spines, and the young branches are a bit hairy, though they become smooth as the tree matures. The leaves of the tabog have three parts, these are the leaflets, the one in the middle is the biggest, while the two on the sides are smaller. The side leaflets are oval-shaped, and the middle one is long and narrow, usually with a rounded or blunt tip. \n\n Tabog’s flowers are white, about 1.5 centimeters long, have a pleasant smell, and have petals that are longer than the small parts called calyx lobes at the base of the flower. Its fruit is green or yellow,  oval-shaped with a tough, leathery skin that feels bumpy and uneven. Inside the fruit are many seeds covered in soft, wool-like pulp. The walls inside the fruit have special glands that produce a sticky substance called mucilage. Because of its thick skin and special fruit structure, scientists have compared tabog to citrus fruits and their wild relatives. The leaves are glossy and leathery, dark green on the upper surface, and lighter green underneath, arranged alternately along the stems.",
        "uses": "The juice from the Tabog tree is used as medicine to treat skin problems. The leaves and bark are also used to help cure coughs and to remove ticks from dogs. The fruit smells nice and has a sour taste that is similar to a lemon. Farmers sometimes use the Tabog tree as a base or “rootstock” to grow other citrus trees on. Its wood is also strong enough to be used for making parts of houses, like pillars.",
        "references": ["Malakabuyau, Chaetospermum glutinosum, TABOG: Philippine Medicinal Herbs  /  Philippine Alternative Medicine. (2011b, February 1). https://www.stuartxchange.com/Malakabuyau.html?  ", " NParks | Swinglea glutinosa. (n.d.). https://www.nparks.gov.sg/florafaunaweb/flora/6/3/6382  ", " StuartXchange. (2011, February 1). Malakabuyau, Chaetospermum glutinosum, TABOG: Philippine medicinal herbs / Philippine alternative medicine. https://www.stuartxchange.com/Malakabuyau.html ", " Swinglea glutinosa (CRC 3288). (n.d.). Givaudan Citrus Variety Collection at UCR. https://citrusvariety.ucr.edu/crc3288 "],
        "coordinates": "",
        "tree_code": "tabog",
        "image": ""
    },
    {
        "common_name": "Mahogany",
        "scientific_name": "Swietenia macrophylla",
        "vernacular_names": ["Big-leaf Mahogany"],
        "conservation_status": "Vulnerable",
        "ancestry": {
            "kingdom": "Plantae",
            "division": "Magnoliophyta",
            "class": "Magnoliopsida",
            "order": "Sapindales",
            "family": "Meliaceae",
            "genus": "Swietenia",
            "species": "Swietenia macrophylla"
        },
        "description": "Mahogany or Swietenia macrophylla is a tall, deciduous tree which means it sheds its leaves annually and is known for its big trunk and reddish-brown hardwood. They can reach up to 150 to 200 feet and 6 feet in diameter. The tree has dark green, glossy, compound leaves and small, fragrant white flowers that develop into woody capsules containing winged seeds. They develop large pinnate leaves that consist of 3 to 6 pairs of leaflets. They are oval-shaped with pointed tips. The terminal leaflet is always absent. Leaves can reach up to 20 inches in length. Mahogany is also known as big-leaf mahogany due to oversized leaves. \n\n They usually bloom from April to June. The fruit of the mahogany tree is a large, pear-shaped capsule that is gray or brown in color and contains up to 71 seeds. These fruits usually ripen from January to March. When mature, the capsule splits into five parts to release the seeds. However, mahogany seeds do not remain viable for long, they can only germinate during the first rainy season after being released. The fruit of the big-leaf mahogany is sometimes called “sky fruit” because the capsules grow pointing toward the sky. \n\nToday, commercially available mahogany is mostly cultivated on plantations in Asia, especially in India, Indonesia, Bangladesh, and Fiji. Wild species of mahogany are now protected by law and cannot be harvested. Mahogany is a slow-growing tree that can live for up to 350 years in the wild.",
        "notable_features": "Mahogany produces one of the most valuable hardwoods in the world, known as the “true mahogany of commerce.” Its durable and beautifully grained wood is used for furniture, boats, musical instruments, and electric guitars such as Gibson Les Paul models. The bark and seeds have traditional medicinal uses, including treatment for fever, wounds, and malaria. However, the seeds are considered harmful if consumed. Because of its fast growth and dense canopy, mahogany is also commonly planted as a shade tree in tropical areas.",
        "uses": "There are still no reports confirming the edibility of this plant, and its seeds are considered harmful if     consumed.   Despite this, it has many folkloric uses in traditional medicine. The bark is known to be antipyretic, tonic, and astringent, while seed decoctions have been used as abortifacients. It has also been used to treat hypertension, amoebiasis, chest pain, parasitism, cancer, malaria, cough, and miscarriage. In India, bark extracts serve as an astringent for wounds and are used for anemia, diarrhea, fever, and dysentery, while in Africa, bark decoctions act as a febrifuge. \n\nBeyond its medicinal uses, the plant is highly valued for its wood, known as the true mahogany of commerce. Its  reddish-brown timber is prized for furniture, musical instruments, boats, and caskets. It is also used in making electric guitars like the Gibson Les Paul models. In Manila, it is commonly planted as a shade tree, and in Haiti, its wood is used for charcoal. Although not edible, the plant remains important for its medicinal, industrial, and practical uses.",
        "references": ["Mahogany, Swietenia mahogani Jacq., WEST INDIAN MAHOGANY, Tao hua xin mu : Philippine Medicinal Herbs / Philippine HERBAL THERAPY / Alternative Medicine / StuartXchange. (2018). Stuartxchange.com. https://www.stuartxchange.com/Mahogany ", " Mahogany. (2024, October 11). University of Santo Tomas. https://www.ust.edu.ph/ust-manila-tree-inventory/mahogany/ ", " Villegas, E. (2024, August). Why the Philippines should plant more native trees. #ThinkLandscape. https://thinklandscape.globallandscapesforum.org/69313/philippines-mahogany-native-trees/ ", " mahogany | wood | Britannica. (n.d.). Www.britannica.com. https://www.britannica.com/topic/mahogany-wood"],
        "coordinates": "",
        "tree_code": "mahogany",
        "image": "/images/tree/mahogany.jpg"
    },
    {
        "common_name": "Lipote",
        "scientific_name": "Syzygium polycephaloides",
        "vernacular_names": ["Bahag", "Baligang", "Igot", "Syzygium curranii"],
        "conservation_status": "Vulnerable",
        "ancestry": {
            "kingdom": "Plantae",
            "clade": "Tracheophytes-Angiosperms-Eudicots-Rosids",
            "order": "Myrtales",
            "family": "Myrtaceae",
            "genus": "Syzygium",
            "species": "Syzygium polycephaloides"
        },
        "description": "Syzygium polycephaloides or Syzygium curranii is commonly known as the Lipote fruit-bearing tree. It is an evergreen fruit-bearing tree that belongs to the Myrtle family (Myrtaceae). The tree is native to the Philippines, specifically found in the parts of Luzon. The flowers of the Lipote tree are small, white, and clustered. The Lipote tree grows from small to medium size. It’s leaves are alternate and oblong-lanceolate shaped and it has sweet-sour fruit that can sometimes be used for wine. Despite being found useful because of its nutritional value among the locals, this tree is now considered rare even in its natural habitat.",
        "notable_features": "The trunk of the tree grows up to 75 cm, its color is purplish-gray, and the texture can be smooth. The leaves are long and oblong; their structure is alternate. The texture of the leaf is smooth and glossy. The color of the leaves starts off with a pinkish shade, then turns green as it matures. Its roots are fibrous, and can grow up to 12-24 inches underground, however, it may vary for each plant. Moreover, the Lipote has a large seed; the seed can either be round or more oval-shaped. \n\nThe fruits of Lipote are usually small and round, with a dark red to dark purple, as it ripens. Its flavor is sweet, but sometimes it's sour. Inside the fruit is white or sometimes pink. The size of the fruit ranges from 1 to 2.5cm, it is juicy, rich in vitamin C, and can be eaten in many ways; it can be raw, or sometimes it can be used for making wine, juices, and more. It has white flowers that bloom between May and June. The flower appears to be small, and usually groups of three.",
        "uses": "The Lipote is mainly valued for its fruit. It is usually processed into jams, jellies, juices, and wine. Moreover, the Lipote was also reported to have medicinal properties, the fruit is commonly used by the locals for diabetes, high cholesterol, and hypertension. While the Ifugaos use the fruit for treating coughs, and the Leaf  ",
        "references": ["Lipote, Syzygium polycephaloides: Philippine Medicinal Herbs  /  Alternative Medicine. (n.d.). https://www.stuartxchange.org/Lipote.html ", " Lipote - Arca del Gusto - Slow Food Foundation. (2021, July 26). Slow Food Foundation. https://www.fondazioneslowfood.com/en/ark-of-taste-slow-food/lipote/ ", " veliyathgardens. (n.d.). Lipote fruit plants (Syzygium curranii). Veliyathgardens. https://veliyathgarden.com/products/lipote-fruit-syzygium-curranii?srsltid=AfmBOoqg8Jd0fEF2E_Esnk0pDBUkLT-pgSaFkC87B-It8x1qvuTLj-Fe ", " Lipote fruit tree. (n.d.). https://www.bigwas.com/2020/08/lipote-fruit-tree.html"],
        "coordinates": "",
        "tree_code": "lipote",
        "image": "/images/tree/lipote.jpg"
    }

]